<?php  return array (
  'resourceClass' => 'modDocument',
  'resource' => 
  array (
    'id' => 34,
    'type' => 'document',
    'contentType' => 'text/html',
    'pagetitle' => 'Производство наплавочных прутков',
    'longtitle' => 'Производство наплавочных прутков  на заказ по низкой цене в Екатеринбурге | УБМ',
    'description' => 'Производство наплавочных прутков любой сложности ⚙️ Низкие цены ✅ Гарантия качества ✅ Литейное производство УБМ в Екатеринбурге и Свердловской области',
    'alias' => 'proizvodstvo-naplavochnyix-prutkov',
    'alias_visible' => 1,
    'link_attributes' => '',
    'published' => 1,
    'pub_date' => 0,
    'unpub_date' => 0,
    'parent' => 3,
    'isfolder' => 0,
    'introtext' => '',
    'content' => '',
    'richtext' => 1,
    'template' => 8,
    'menuindex' => 3,
    'searchable' => 1,
    'cacheable' => 1,
    'createdby' => 1,
    'createdon' => 1681994447,
    'editedby' => 1,
    'editedon' => 1686901127,
    'deleted' => 0,
    'deletedon' => 0,
    'deletedby' => 0,
    'publishedon' => 1686901127,
    'publishedby' => 1,
    'menutitle' => '',
    'donthit' => 0,
    'privateweb' => 0,
    'privatemgr' => 0,
    'content_dispo' => 0,
    'hidemenu' => 1,
    'class_key' => 'modDocument',
    'context_key' => 'web',
    'content_type' => 1,
    'uri' => 'produkcziya/proizvodstvo-naplavochnyix-prutkov/',
    'uri_override' => 0,
    'hide_children_in_tree' => 0,
    'show_in_tree' => 1,
    'properties' => '{"ms2gallery":{"media_source":"3"}}',
    'image' => 
    array (
      0 => 'image',
      1 => 'img-0215.jpeg',
      2 => 'default',
      3 => NULL,
      4 => 'image',
    ),
    'icon' => 
    array (
      0 => 'icon',
      1 => '',
      2 => 'default',
      3 => NULL,
      4 => 'image',
    ),
    'descr' => 
    array (
      0 => 'descr',
      1 => '',
      2 => 'default',
      3 => NULL,
      4 => 'richtext',
    ),
    '_content' => '<!DOCTYPE html>
<html>
	<head>
	<base href="http://lpubm.na4u.ru/" />
	<meta name="robots" content="index, follow" />
	<link rel="canonical" href="http://lpubm.na4u.ru/produkcziya/proizvodstvo-naplavochnyix-prutkov/" />
		<meta http-equiv="Content-Type" content="text/html; charset=windows-1251" />
	<meta charset="UTF-8" />
	<meta name="viewport" content="width=device-width, initial-scale=1" />
    <title itemprop="name">Производство наплавочных прутков  на заказ по низкой цене в Екатеринбурге | УБМ</title>
	<meta name="description" itemprop="description" content="Производство наплавочных прутков любой сложности ⚙️ Низкие цены ✅ Гарантия качества ✅ Литейное производство УБМ в Екатеринбурге и Свердловской области" />
	<meta name="abstract" content="Производство наплавочных прутков  на заказ по низкой цене в Екатеринбурге | УБМ" />
	
	
    <link rel="shortcut icon" href="/favicon.png" type="image/png" />
    <meta name="copyright" content="Copyright (c) 2024 by Литейное производство">
    <link rel="schema.DC" href="http://purl.org/dc/elements/1.1/">
    <meta name="DC.contributor" content="Литейное производство">
    <meta name="DC.creator" content="Admin">
    <meta name="DC.date" content="2023-06-16">
    <meta name="DC.format" content="text/html">
    <meta name="DC.identifier" content="Производство наплавочных прутков - 34">
    <meta name="DC.language" content="ru">
    <meta name="DC.publisher" content="Литейное производство">
    <meta name="DC.rights" content="Copyright (c) 2024 by Литейное производство">
    <meta name="DC.rightsHolder" content="Литейное производство">
    <meta name="DC.title" content="Производство наплавочных прутков">

    <link href="/assets/ubm/css/uss-style-8.1.0.min.css" rel="stylesheet" type="text/css" />
    <link href="/assets/ubm/css/style-d=1578909180.css" rel="stylesheet" type="text/css" />
    <script src="/assets/ubm/js/jquery-1.9.1.min.js" type="text/javascript"></script>
    <script src="/assets/ubm/js/jquery.formstyler.min.js" type="text/javascript"></script>
    <link rel="preload" href="/assets/ubm/js/jquery.form.min.js" as="script"/>
    <link rel="preload" href="/assets/ubm/js/jquery.autocomplete.min.js" as="script"/>
    <link rel="preload" href="/assets/ubm/js/uss-script-8.1.0.min.js" as="script"/>
	
	<link rel="stylesheet" href="/assets/ubm/css/swiper-bundle.min.css" />


<link rel="stylesheet"
href="https://cdn.jsdelivr.net/gh/fancyapps/fancybox@3.5.7/dist/jquery.fancybox.min.css"
/>
</head>
	<link rel="stylesheet" href="/assets/style.css">
	<link rel="stylesheet" href="/assets/ubm/css/responsive.css" />
	<body class = "product-page">
	    
	      <div class="modal fade" id="susbc-form">
                    			    <div class="modal-dialog shadow-lg  mb-5 bg-white rounded">
                    				    <div class="modal-content sub-bg">
                    				    	<div class="modal-header subs-header">
                    				    	    <div class="modal-title-wrapper">
                    				    	        <div class=\'modal-title\'>ОСтавьте заявку</div>
                    				    	        <div class=\'modal-subtitle\'>Наш менеджер свяжется с вами и проконсультирует</div>
                    				    	    </div>
                    				    	    
                    						    <button type="button" class="close" data-dismiss="modal" aria-hidden="true"> 
                    						        <svg xmlns="http://www.w3.org/2000/svg" width="26" height="26" viewBox="0 0 26 26" fill="none">
                                                  <path d="M1 1L25 25" stroke="white"/>
                                                  <path d="M25 1L1 25" stroke="white"/>
                                                </svg>
                    						    </button>
                    						     <!--<h4 class="modal-title"> Производство наплавочных прутков</h4>-->
                    					    </div>
                        					    <div class="modal-body">
                        					        [[!AjaxForm?
                                                        &snippet=`FormIt`
                                                        &form=`Order_form`
                                                        &hooks=`email`
                                                        &emailSubject=`Сообщение с сайта lpubm.na4u.ru `
                                                        &emailTo=`lp@lpubm.ru`
                                                        &emailTpl=`tpl.contact_form`
                                                        &validate=`name:required,email:required,message:required`
                                                        &validationErrorMessage=`В форме содержатся ошибки!`
                                                        &successMessage=`Ваше сообщение отправлено!
                                                        Наши специалисты свяжутся с вами в ближайшее время.`
                                                        ]]
                        						</div>
                    					    </div>
                    				    </div>
                    			    </div>
	    
	    
	    

			<!-- Yandex.Metrika counter -->
<script type="text/javascript" >
   (function(m,e,t,r,i,k,a){m[i]=m[i]||function(){(m[i].a=m[i].a||[]).push(arguments)};
   m[i].l=1*new Date();
   for (var j = 0; j < document.scripts.length; j++) {if (document.scripts[j].src === r) { return; }}
   k=e.createElement(t),a=e.getElementsByTagName(t)[0],k.async=1,k.src=r,a.parentNode.insertBefore(k,a)})
   (window, document, "script", "https://mc.yandex.ru/metrika/tag.js", "ym");
   ym(92489463, "init", {
        clickmap:true,
        trackLinks:true,
        accurateTrackBounce:true
   });
</script>
<noscript><div><img src="https://mc.yandex.ru/watch/92489463" style="position:absolute; left:-9999px;" alt="" /></div></noscript>
<!-- /Yandex.Metrika counter -->

<script src="//code.jivo.ru/widget/VTHqXXTq3m" async></script>

<div class="header">
	<div class="inner-min mobile-menu">
    	<div class=" main-header">
    		<a href="/" class="hb_l header-logo-pc">
                <div class="header-logo">ЛП УБМ</div>
                <div class="logo_sitename"> Литейное производство  </div>
    	    </a>
        	<a href="/" class="header-logo-mobile">
        	        <svg xmlns="http://www.w3.org/2000/svg" width="61" height="37" viewBox="0 0 61 37" fill="none">
                      <path d="M0.141266 11.8663V10.3913C0.421443 10.4187 0.652177 10.405 0.833468 10.3501C1.02025 10.2896 1.17682 10.1743 1.30318 10.004C1.42953 9.82818 1.53666 9.57547 1.62456 9.24585C1.71795 8.91623 1.8086 8.49047 1.89649 7.96857C2.01735 7.30384 2.11899 6.61987 2.20139 5.91668C2.2838 5.21349 2.35247 4.5158 2.40741 3.82359C2.46784 3.1259 2.51728 2.45292 2.55573 1.80467C2.59419 1.15642 2.6244 0.55486 2.64638 0H10.4337V11.8663H8.71139V1.62338H4.26152C4.23405 2.06287 4.20109 2.55456 4.16263 3.09843C4.12418 3.6423 4.07748 4.21914 4.02254 4.82894C3.96761 5.43873 3.89894 6.06776 3.81653 6.71601C3.73962 7.36427 3.64073 8.01527 3.51987 8.66901C3.42099 9.22937 3.30013 9.73478 3.15729 10.1853C3.01446 10.6357 2.82218 11.0121 2.58046 11.3142C2.33873 11.6109 2.02285 11.8086 1.6328 11.9075C1.24275 12.0119 0.74557 11.9982 0.141266 11.8663Z" fill="white"/>
                      <path d="M12.7467 11.8663V0H22.182V11.8663H20.4598V1.62338H14.4689V11.8663H12.7467Z" fill="white"/>
                      <path d="M29.501 11.8663L31.0008 8.79262L26.8641 0H28.8006L31.899 6.96323L35.0799 0H36.9175L31.3634 11.8663H29.501Z" fill="white"/>
                      <path d="M38.2085 11.8663V0H45.9464V1.62338H39.9308V4.48284H43.0045C43.1144 4.48284 43.2545 4.48833 43.4248 4.49932C43.6006 4.50481 43.7654 4.51854 43.9192 4.54052C44.562 4.61743 45.1031 4.82619 45.5426 5.1668C45.9876 5.50741 46.3227 5.93866 46.5479 6.46056C46.7787 6.98246 46.894 7.5538 46.894 8.17458C46.894 8.79537 46.7814 9.36671 46.5562 9.88861C46.3309 10.4105 45.9958 10.8418 45.5508 11.1824C45.1113 11.523 44.5675 11.7317 43.9192 11.8086C43.7654 11.8306 43.6033 11.8471 43.433 11.8581C43.2627 11.8636 43.1199 11.8663 43.0045 11.8663H38.2085ZM39.9308 10.2429H42.9386C43.0485 10.2429 43.1693 10.2375 43.3012 10.2265C43.4385 10.2155 43.5676 10.199 43.6885 10.177C44.2214 10.0672 44.5949 9.81444 44.8092 9.4189C45.0289 9.02335 45.1388 8.60858 45.1388 8.17458C45.1388 7.73509 45.0289 7.32032 44.8092 6.93027C44.5949 6.53472 44.2214 6.28201 43.6885 6.17214C43.5676 6.14467 43.4385 6.12819 43.3012 6.1227C43.1693 6.11171 43.0485 6.10622 42.9386 6.10622H39.9308V10.2429Z" fill="white"/>
                      <path d="M48.5414 11.8663V0H50.0988L54.4004 8.92447L58.6772 0H60.2511V11.8581H58.6195V3.74119L54.7877 11.8663H54.0048L50.1647 3.74119V11.8663H48.5414Z" fill="white"/>
                      <path d="M0 25.0563V24.4394C0.172658 24.4551 0.315494 24.4488 0.428506 24.4206C0.541519 24.3892 0.632557 24.3201 0.70162 24.2134C0.773823 24.1067 0.836608 23.9481 0.889975 23.7378C0.943342 23.5243 0.996709 23.2465 1.05008 22.9043C1.10972 22.5339 1.15995 22.165 1.20076 21.7977C1.24471 21.4304 1.28238 21.0584 1.31377 20.6817C1.3483 20.3019 1.37656 19.9126 1.39853 19.5139C1.42051 19.1153 1.44091 18.7024 1.45975 18.2755H5.7401V25.0563H5.0479V18.9395H2.12841C2.10643 19.2628 2.08446 19.594 2.06248 19.933C2.04365 20.2721 2.01853 20.619 1.98714 20.9737C1.95889 21.3284 1.92278 21.6941 1.87884 22.0709C1.83803 22.4444 1.78623 22.8305 1.72344 23.2292C1.67322 23.5306 1.61357 23.81 1.54451 24.0674C1.47858 24.3248 1.38441 24.5414 1.26197 24.7172C1.14268 24.893 0.981013 25.0139 0.776962 25.0798C0.576051 25.1457 0.317063 25.1379 0 25.0563Z" fill="#8A8A8A"/>
                      <path d="M11.0961 19.9707V25.0563H10.4228V21.0961L7.63512 25.0563H7.05123V19.9707H7.72459V23.8979L10.5169 19.9707H11.0961Z" fill="#8A8A8A"/>
                      <path d="M13.7975 25.0563V20.6111H11.994V19.9707H16.2932V20.6111H14.4897V25.0563H13.7975Z" fill="#8A8A8A"/>
                      <path d="M19.343 25.1975C18.847 25.1975 18.4169 25.0877 18.0527 24.8679C17.6917 24.6482 17.4108 24.339 17.2099 23.9403C17.0089 23.5416 16.9085 23.0738 16.9085 22.537C16.9085 21.9814 17.0074 21.5011 17.2051 21.0961C17.4029 20.6912 17.6807 20.3788 18.0386 20.1591C18.3996 19.9393 18.825 19.8294 19.3147 19.8294C19.817 19.8294 20.2455 19.9456 20.6002 20.1779C20.955 20.4071 21.2234 20.7367 21.4055 21.1668C21.5875 21.5968 21.6707 22.1101 21.655 22.7065H20.9487V22.4617C20.9361 21.8024 20.7933 21.3049 20.5202 20.969C20.2502 20.6331 19.8547 20.4651 19.3336 20.4651C18.7873 20.4651 18.3682 20.6425 18.0763 20.9972C17.7875 21.352 17.6431 21.8574 17.6431 22.5135C17.6431 23.1539 17.7875 23.6515 18.0763 24.0062C18.3682 24.3578 18.781 24.5336 19.3147 24.5336C19.6789 24.5336 19.9959 24.4504 20.2659 24.284C20.539 24.1145 20.7541 23.8712 20.911 23.5541L21.5561 23.8037C21.3552 24.2463 21.0586 24.5901 20.6662 24.835C20.2769 25.0767 19.8358 25.1975 19.343 25.1975ZM17.3982 22.7065V22.1274H21.283V22.7065H17.3982Z" fill="#8A8A8A"/>
                      <path d="M24.8096 19.368C24.5867 19.368 24.3827 19.313 24.1974 19.2032C24.0122 19.0933 23.8647 18.9473 23.7548 18.7652C23.6481 18.58 23.5947 18.376 23.5947 18.1531H24.1692C24.1692 18.3289 24.232 18.4796 24.3575 18.6051C24.4831 18.7307 24.6338 18.7935 24.8096 18.7935C24.9885 18.7935 25.1392 18.7307 25.2616 18.6051C25.3872 18.4796 25.45 18.3289 25.45 18.1531H26.0245C26.0245 18.376 25.9695 18.58 25.8597 18.7652C25.7529 18.9473 25.607 19.0933 25.4217 19.2032C25.2365 19.313 25.0325 19.368 24.8096 19.368ZM26.7402 19.9707V25.0563H26.0669V21.0961L23.2792 25.0563H22.6953V19.9707H23.3687V23.8979L26.161 19.9707H26.7402Z" fill="#8A8A8A"/>
                      <path d="M28.0572 25.0563V19.9707H28.7494V22.1792H31.6171V19.9707H32.3093V25.0563H31.6171V22.8431H28.7494V25.0563H28.0572Z" fill="#8A8A8A"/>
                      <path d="M35.7497 25.1975C35.2443 25.1975 34.8127 25.083 34.4548 24.8538C34.0969 24.6246 33.8223 24.3076 33.6308 23.9026C33.4393 23.4976 33.3435 23.033 33.3435 22.5088C33.3435 21.9751 33.4408 21.5074 33.6355 21.1055C33.8301 20.7037 34.1064 20.3914 34.4642 20.1685C34.8252 19.9424 35.2537 19.8294 35.7497 19.8294C36.2583 19.8294 36.6915 19.944 37.0494 20.1732C37.4104 20.3992 37.6851 20.7147 37.8734 21.1197C38.0649 21.5215 38.1607 21.9845 38.1607 22.5088C38.1607 23.0424 38.0649 23.5118 37.8734 23.9167C37.6819 24.3186 37.4057 24.6325 37.0447 24.8585C36.6837 25.0845 36.252 25.1975 35.7497 25.1975ZM35.7497 24.5336C36.3148 24.5336 36.7355 24.3468 37.0117 23.9732C37.288 23.5965 37.4261 23.1084 37.4261 22.5088C37.4261 21.8935 37.2864 21.4038 37.007 21.0396C36.7308 20.6755 36.3117 20.4934 35.7497 20.4934C35.3699 20.4934 35.056 20.5797 34.808 20.7524C34.5631 20.9219 34.3795 21.1589 34.257 21.4634C34.1377 21.7648 34.0781 22.1132 34.0781 22.5088C34.0781 23.1209 34.2194 23.6122 34.5019 23.9827C34.7844 24.3499 35.2004 24.5336 35.7497 24.5336Z" fill="#8A8A8A"/>
                      <path d="M41.3514 25.1975C40.8554 25.1975 40.4253 25.0877 40.0611 24.8679C39.7001 24.6482 39.4192 24.339 39.2183 23.9403C39.0174 23.5416 38.9169 23.0738 38.9169 22.537C38.9169 21.9814 39.0158 21.5011 39.2136 21.0961C39.4113 20.6912 39.6892 20.3788 40.047 20.1591C40.408 19.9393 40.8334 19.8294 41.3231 19.8294C41.8254 19.8294 42.2539 19.9456 42.6086 20.1779C42.9634 20.4071 43.2318 20.7367 43.4139 21.1668C43.5959 21.5968 43.6791 22.1101 43.6634 22.7065H42.9571V22.4617C42.9445 21.8024 42.8017 21.3049 42.5286 20.969C42.2586 20.6331 41.8631 20.4651 41.342 20.4651C40.7957 20.4651 40.3766 20.6425 40.0847 20.9972C39.7959 21.352 39.6515 21.8574 39.6515 22.5135C39.6515 23.1539 39.7959 23.6515 40.0847 24.0062C40.3766 24.3578 40.7895 24.5336 41.3231 24.5336C41.6873 24.5336 42.0043 24.4504 42.2743 24.284C42.5474 24.1145 42.7625 23.8712 42.9194 23.5541L43.5645 23.8037C43.3636 24.2463 43.067 24.5901 42.6746 24.835C42.2853 25.0767 41.8442 25.1975 41.3514 25.1975ZM39.4066 22.7065V22.1274H43.2914V22.7065H39.4066Z" fill="#8A8A8A"/>
                      <path d="M0.466177 35.0563V29.9707H4.51109V35.0563H3.81889V30.6346H1.15838V35.0563H0.466177Z" fill="#8A8A8A"/>
                      <path d="M7.95643 35.1975C7.45101 35.1975 7.01937 35.083 6.66149 34.8538C6.30362 34.6246 6.02894 34.3076 5.83744 33.9026C5.64595 33.4976 5.5502 33.033 5.5502 32.5088C5.5502 31.9751 5.64752 31.5074 5.84215 31.1055C6.03678 30.7037 6.31304 30.3914 6.67091 30.1685C7.03192 29.9424 7.46043 29.8294 7.95643 29.8294C8.46499 29.8294 8.8982 29.944 9.25608 30.1732C9.61709 30.3992 9.89177 30.7147 10.0801 31.1197C10.2716 31.5215 10.3674 31.9845 10.3674 32.5088C10.3674 33.0424 10.2716 33.5118 10.0801 33.9167C9.88863 34.3185 9.61238 34.6325 9.25137 34.8585C8.89035 35.0845 8.45871 35.1975 7.95643 35.1975ZM7.95643 34.5336C8.52149 34.5336 8.94215 34.3468 9.2184 33.9732C9.49466 33.5965 9.63278 33.1084 9.63278 32.5088C9.63278 31.8935 9.49309 31.4038 9.2137 31.0396C8.93744 30.6755 8.51835 30.4934 7.95643 30.4934C7.57658 30.4934 7.26266 30.5797 7.01466 30.7524C6.7698 30.9219 6.58615 31.1589 6.46372 31.4634C6.34443 31.7648 6.28478 32.1132 6.28478 32.5088C6.28478 33.1209 6.42605 33.6122 6.70858 33.9827C6.99111 34.3499 7.40706 34.5336 7.95643 34.5336Z" fill="#8A8A8A"/>
                      <path d="M15.4463 29.9707V35.0563H14.7729V31.0961L11.9853 35.0563H11.4014V29.9707H12.0748V33.8979L14.8671 29.9707H15.4463Z" fill="#8A8A8A"/>
                      <path d="M18.5997 35.1975C18.088 35.1975 17.6407 35.0861 17.2577 34.8632C16.8778 34.6372 16.578 34.3248 16.3583 33.9261L16.9139 33.573C17.0991 33.8869 17.3299 34.1255 17.6061 34.2887C17.8824 34.452 18.1995 34.5336 18.5573 34.5336C18.9309 34.5336 19.2307 34.4473 19.4567 34.2746C19.6827 34.1019 19.7958 33.8649 19.7958 33.5636C19.7958 33.3564 19.7471 33.1916 19.6498 33.0691C19.5556 32.9467 19.4112 32.8588 19.2166 32.8054C19.0251 32.7521 18.7849 32.7254 18.4961 32.7254H17.8934V32.1321H18.4867C18.8383 32.1321 19.1208 32.0693 19.3343 31.9437C19.5509 31.815 19.6592 31.6141 19.6592 31.341C19.6592 31.0522 19.5509 30.8387 19.3343 30.7006C19.1208 30.5593 18.865 30.4887 18.5667 30.4887C18.2654 30.4887 17.9797 30.5515 17.7097 30.677C17.4429 30.7995 17.2184 30.958 17.0364 31.1526L16.5937 30.6864C16.848 30.4071 17.1447 30.1952 17.4837 30.0508C17.8259 29.9032 18.2042 29.8294 18.6185 29.8294C18.945 29.8294 19.2401 29.8875 19.5038 30.0037C19.7706 30.1167 19.981 30.2831 20.1348 30.5028C20.2918 30.7225 20.3702 30.9862 20.3702 31.2939C20.3702 31.5827 20.2996 31.8323 20.1583 32.0426C20.0202 32.2529 19.824 32.4272 19.5697 32.5653L19.5321 32.3063C19.7518 32.3471 19.9339 32.435 20.0783 32.57C20.2227 32.705 20.3294 32.8666 20.3985 33.055C20.4676 33.2434 20.5021 33.4349 20.5021 33.6295C20.5021 33.9528 20.4173 34.2322 20.2478 34.4677C20.0814 34.7 19.8538 34.8805 19.565 35.0092C19.2794 35.1348 18.9576 35.1975 18.5997 35.1975Z" fill="#8A8A8A"/>
                      <path d="M21.5365 35.0563V29.9707H23.6319C23.7387 29.9707 23.8674 29.977 24.0181 29.9895C24.1719 30.0021 24.3147 30.0256 24.4466 30.0602C24.7322 30.1355 24.9614 30.2893 25.1341 30.5216C25.3099 30.7539 25.3978 31.0333 25.3978 31.3598C25.3978 31.5419 25.3695 31.7051 25.313 31.8495C25.2596 31.9908 25.1827 32.1132 25.0823 32.2168C25.0352 32.2702 24.9834 32.3173 24.9269 32.3581C24.8704 32.3958 24.8154 32.4272 24.7621 32.4523C24.8625 32.4711 24.9708 32.5151 25.087 32.5841C25.269 32.6909 25.4072 32.8353 25.5014 33.0173C25.5955 33.1963 25.6426 33.4144 25.6426 33.6719C25.6426 34.0203 25.5594 34.3044 25.393 34.5242C25.2267 34.7439 25.0038 34.8946 24.7244 34.9762C24.5988 35.0107 24.4623 35.0327 24.3147 35.0421C24.1703 35.0516 24.0338 35.0563 23.905 35.0563H21.5365ZM22.2334 34.4677H23.8721C23.938 34.4677 24.0212 34.463 24.1217 34.4535C24.2221 34.441 24.3116 34.4253 24.3901 34.4064C24.5753 34.3594 24.7103 34.2652 24.795 34.1239C24.8829 33.9795 24.9269 33.8225 24.9269 33.653C24.9269 33.4301 24.8609 33.2481 24.7291 33.1068C24.6004 32.9624 24.4277 32.8745 24.2111 32.8431C24.1389 32.8274 24.0636 32.818 23.9851 32.8149C23.9066 32.8117 23.836 32.8101 23.7732 32.8101H22.2334V34.4677ZM22.2334 32.2168H23.6555C23.7371 32.2168 23.8281 32.2121 23.9286 32.2027C24.0322 32.1901 24.1217 32.1697 24.197 32.1415C24.3602 32.085 24.4795 31.9877 24.5549 31.8495C24.6334 31.7114 24.6726 31.5607 24.6726 31.3975C24.6726 31.2185 24.6302 31.0616 24.5455 30.9266C24.4638 30.7916 24.3398 30.6974 24.1735 30.6441C24.0604 30.6033 23.938 30.5797 23.8062 30.5734C23.6775 30.5672 23.5958 30.564 23.5613 30.564H22.2334V32.2168Z" fill="#8A8A8A"/>
                      <path d="M28.7048 35.1975C28.1994 35.1975 27.7678 35.083 27.4099 34.8538C27.052 34.6246 26.7774 34.3076 26.5859 33.9026C26.3944 33.4976 26.2986 33.033 26.2986 32.5088C26.2986 31.9751 26.3959 31.5074 26.5906 31.1055C26.7852 30.7037 27.0615 30.3914 27.4193 30.1685C27.7803 29.9424 28.2088 29.8294 28.7048 29.8294C29.2134 29.8294 29.6466 29.944 30.0045 30.1732C30.3655 30.3992 30.6402 30.7147 30.8285 31.1197C31.02 31.5215 31.1158 31.9845 31.1158 32.5088C31.1158 33.0424 31.02 33.5118 30.8285 33.9167C30.6371 34.3185 30.3608 34.6325 29.9998 34.8585C29.6388 35.0845 29.2071 35.1975 28.7048 35.1975ZM28.7048 34.5336C29.2699 34.5336 29.6906 34.3468 29.9668 33.9732C30.2431 33.5965 30.3812 33.1084 30.3812 32.5088C30.3812 31.8935 30.2415 31.4038 29.9621 31.0396C29.6859 30.6755 29.2668 30.4934 28.7048 30.4934C28.325 30.4934 28.0111 30.5797 27.7631 30.7524C27.5182 30.9219 27.3346 31.1589 27.2121 31.4634C27.0928 31.7648 27.0332 32.1132 27.0332 32.5088C27.0332 33.1209 27.1745 33.6122 27.457 33.9827C27.7395 34.3499 28.1555 34.5336 28.7048 34.5336Z" fill="#8A8A8A"/>
                      <path d="M31.7778 36.1864V34.463C32.0666 34.463 32.2738 34.3703 32.3994 34.1851C32.525 33.9968 32.627 33.697 32.7055 33.2857C32.7588 33.0189 32.8028 32.7317 32.8373 32.424C32.8718 32.1164 32.9017 31.7648 32.9268 31.3692C32.9519 30.9705 32.9754 30.5044 32.9974 29.9707H36.3595V34.463H36.8493V36.1864H36.1806V35.0563H32.4418V36.1864H31.7778ZM32.9503 34.463H35.6721V30.564H33.6378C33.6284 30.8026 33.6143 31.0553 33.5954 31.3221C33.5797 31.589 33.5593 31.8558 33.5342 32.1227C33.5122 32.3895 33.4856 32.6406 33.4542 32.8761C33.4259 33.1084 33.3914 33.3124 33.3506 33.4882C33.3035 33.7142 33.2517 33.9073 33.1952 34.0674C33.1418 34.2275 33.0602 34.3594 32.9503 34.463Z" fill="#8A8A8A"/>
                      <path d="M39.9019 35.1975C39.3902 35.1975 38.9569 35.083 38.6022 34.8538C38.2475 34.6246 37.9775 34.3091 37.7923 33.9073C37.6102 33.5023 37.516 33.0377 37.5098 32.5135C37.516 31.9798 37.6133 31.5121 37.8017 31.1102C37.9901 30.7053 38.2616 30.3914 38.6163 30.1685C38.9711 29.9424 39.4011 29.8294 39.9066 29.8294C40.4214 29.8294 40.8687 29.955 41.2486 30.2061C41.6316 30.4573 41.8937 30.801 42.035 31.2374L41.3569 31.454C41.2376 31.1495 41.0477 30.914 40.7871 30.7477C40.5297 30.5781 40.2346 30.4934 39.9019 30.4934C39.5283 30.4934 39.2191 30.5797 38.9742 30.7524C38.7293 30.9219 38.5473 31.1589 38.428 31.4634C38.3087 31.7679 38.2475 32.1179 38.2443 32.5135C38.2506 33.1225 38.3919 33.6122 38.6681 33.9827C38.9444 34.3499 39.3556 34.5336 39.9019 34.5336C40.2472 34.5336 40.5407 34.4551 40.7824 34.2981C41.0273 34.138 41.2125 33.9057 41.3381 33.6012L42.035 33.8084C41.8466 34.2605 41.5704 34.6058 41.2062 34.8444C40.8421 35.0798 40.4073 35.1975 39.9019 35.1975Z" fill="#8A8A8A"/>
                      <path d="M44.2671 35.0563V30.6111H42.4636V29.9707H46.7628V30.6111H44.9593V35.0563H44.2671Z" fill="#8A8A8A"/>
                      <path d="M47.656 35.0563V29.9707H49.7514C49.8581 29.9707 49.9868 29.977 50.1375 29.9895C50.2913 30.0021 50.4342 30.0256 50.566 30.0602C50.8517 30.1355 51.0809 30.2893 51.2535 30.5216C51.4293 30.7539 51.5172 31.0333 51.5172 31.3598C51.5172 31.5419 51.489 31.7051 51.4325 31.8495C51.3791 31.9908 51.3022 32.1132 51.2017 32.2168C51.1546 32.2702 51.1028 32.3173 51.0463 32.3581C50.9898 32.3958 50.9349 32.4272 50.8815 32.4523C50.982 32.4711 51.0903 32.5151 51.2064 32.5841C51.3885 32.6909 51.5266 32.8353 51.6208 33.0173C51.715 33.1963 51.7621 33.4144 51.7621 33.6719C51.7621 34.0203 51.6789 34.3044 51.5125 34.5242C51.3461 34.7439 51.1232 34.8946 50.8438 34.9762C50.7183 35.0107 50.5817 35.0327 50.4342 35.0421C50.2898 35.0516 50.1532 35.0563 50.0245 35.0563H47.656ZM48.3529 34.4677H49.9915C50.0575 34.4677 50.1407 34.463 50.2411 34.4535C50.3416 34.441 50.431 34.4253 50.5095 34.4064C50.6947 34.3594 50.8297 34.2652 50.9145 34.1239C51.0024 33.9795 51.0463 33.8225 51.0463 33.653C51.0463 33.4301 50.9804 33.2481 50.8486 33.1068C50.7199 32.9624 50.5472 32.8745 50.3306 32.8431C50.2584 32.8274 50.183 32.818 50.1046 32.8149C50.0261 32.8117 49.9554 32.8101 49.8927 32.8101H48.3529V34.4677ZM48.3529 32.2168H49.7749C49.8566 32.2168 49.9476 32.2121 50.0481 32.2027C50.1516 32.1901 50.2411 32.1697 50.3165 32.1415C50.4797 32.085 50.599 31.9877 50.6743 31.8495C50.7528 31.7114 50.7921 31.5607 50.7921 31.3975C50.7921 31.2185 50.7497 31.0616 50.6649 30.9266C50.5833 30.7916 50.4593 30.6974 50.2929 30.6441C50.1799 30.6033 50.0575 30.5797 49.9256 30.5734C49.7969 30.5672 49.7153 30.564 49.6808 30.564H48.3529V32.2168Z" fill="#8A8A8A"/>
                      <path d="M54.8243 35.1975C54.3189 35.1975 53.8872 35.083 53.5294 34.8538C53.1715 34.6246 52.8968 34.3076 52.7053 33.9026C52.5138 33.4976 52.4181 33.033 52.4181 32.5088C52.4181 31.9751 52.5154 31.5074 52.71 31.1055C52.9047 30.7037 53.1809 30.3914 53.5388 30.1685C53.8998 29.9424 54.3283 29.8294 54.8243 29.8294C55.3329 29.8294 55.7661 29.944 56.124 30.1732C56.485 30.3992 56.7597 30.7147 56.948 31.1197C57.1395 31.5215 57.2352 31.9845 57.2352 32.5088C57.2352 33.0424 57.1395 33.5118 56.948 33.9167C56.7565 34.3185 56.4803 34.6325 56.1192 34.8585C55.7582 35.0845 55.3266 35.1975 54.8243 35.1975ZM54.8243 34.5336C55.3894 34.5336 55.81 34.3468 56.0863 33.9732C56.3625 33.5965 56.5007 33.1084 56.5007 32.5088C56.5007 31.8935 56.361 31.4038 56.0816 31.0396C55.8053 30.6755 55.3862 30.4934 54.8243 30.4934C54.4445 30.4934 54.1305 30.5797 53.8825 30.7524C53.6377 30.9219 53.454 31.1589 53.3316 31.4634C53.2123 31.7648 53.1527 32.1132 53.1527 32.5088C53.1527 33.1209 53.2939 33.6122 53.5765 33.9827C53.859 34.3499 54.2749 34.5336 54.8243 34.5336Z" fill="#8A8A8A"/>
                    </svg>
                </a>
                
       
            	    
    	    <div class="hb_r">
    		    <div class="h_contacts">
    		        <a class=\'h_tel\' href="tel:+7 (343) 375-48-41">+7 (343) 375-48-41</a>
    		        <div class="h_mail">
        			    <a href="mailto:lp@lpubm.ru">lp@lpubm.ru</a>
                    </div>
                    <div class = "request-call-btn" data-request-call>Заказать звонок</div>
    		    </div>
    		    
    		    <div class="top-menu">
    		        <ul class=""><li><a  class="first active" href="produkcziya/" >Продукция</a></li><li><a  href="o-kompanii/" >О компании</a></li><li><a  href="novosti/" >Новости</a></li><li><a  class="last" href="contacts/" >Контакты</a></li></ul>
                    <div class="drop-down-menu">
            	        <div class="drop-down-menu-col drop-down-menu-nav">
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Литье по выплавляемым моделям</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	   </div>
            	        <div class="drop-down-menu-col">
            	                <a href="" class="go-to">
                            	    <div class="arrow-gold-right-45">
                            			<svg xmlns="http://www.w3.org/2000/svg" width="33" height="33" viewBox="0 0 33 33" fill="none">
                                          <path d="M33 3C33 1.34315 31.6569 0 30 0H3C1.34315 0 0 1.34315 0 3C0 4.65685 1.34315 6 3 6H27V30C27 31.6569 28.3431 33 30 33C31.6569 33 33 31.6569 33 30V3ZM8.12132 29.1213L32.1213 5.12132L27.8787 0.87868L3.87868 24.8787L8.12132 29.1213Z" fill="#535353"/>
                                        </svg>
                            		</div>
                            	    <span class="go-to-text">смотреть всю&nbsp;прдукцию</span>
                            	</a>
            	  </div>
            	    </div>
    		    </div>
    	</div>
    	     <div class="burger-menu" data-burger-menu>
                <span class="burger-item burger-1"></span>
                <span class="burger-item burger-2"></span>
                <span class="burger-item burger-3"></span>
            </div>
    </div>
    
       
	</div>
</div>



<div class="modal-request-acall">
    <div class="modal-dialog shadow-lg  mb-5 bg-white rounded">
        <div class="modal-content sub-bg">
            <div class="modal-header subs-header">
                <div class="modal-title-wrapper">
                    <div class=\'modal-title\'>Заказать звонок</div>
                    <div class=\'modal-subtitle\'>Наш менеджер свяжется с вами и проконсультирует</div>
                </div>
                    				    	    
                <button type="button" class="close" data-dismiss="modal" aria-hidden="true"> 
                    <svg xmlns="http://www.w3.org/2000/svg" width="26" height="26" viewBox="0 0 26 26" fill="none">
                        <path d="M1 1L25 25" stroke="white"/>
                        <path d="M25 1L1 25" stroke="white"/>
                    </svg>
                </button>
                    						     <!--<h4 class="modal-title"> Производство наплавочных прутков</h4>-->
            </div>
            <div class="modal-body">
                [[!AjaxForm?
                    &snippet=`FormIt`
                    &form=`Order_form`
                    &hooks=`email`
                    &emailSubject=`Сообщение с сайта lpubm.na4u.ru `
                    &emailTo=`lp@lpubm.ru`
                    &emailTpl=`tpl.contact_form`
                    &validate=`name:required,email:required,message:required`
                    &validationErrorMessage=`В форме содержатся ошибки!`
                    &successMessage=`Ваше сообщение отправлено!
                    Наши специалисты свяжутся с вами в ближайшее время.`
                ]]
            </div>
        </div>
    </div>
</div>






  





			<div class="content-wrapper inner-min">
			    
		        				<div class="bread"><a href="/">Главная/</a>
<a href="produkcziya/">Продукция/</a>
Производство наплавочных прутков</div>
		        
		        
		        <main>
		            <section class="product-page-top">
		                <div class="product-image">
		                     <script type="text/javascript">$(document).ready(function() { redyUSSfoto($(".uss_catalog_category a.enlarge_image_inside"), true, "eshop"); });</script>
		                            [[!ms2Gallery?
                                           
                                        	&tplRow=`GalleryTpl`
                                        	&tplOuter=`GalleryOuter`
                                        ]]
		                </div>
		                <div class="product-description">
		                    <h1>Производство наплавочных прутков</h1>
		                    <div class=\'product-description-content\'>  
                                      
                            </div> 
                            <div class="order-btn"><a data-toggle="modal" href=\'#susbc-form\'>Отправить заявку</a></div>
                            
                            
		                </div>
		            </section>
		            
		            <section class="about-product">
		                <div class="about-product-item">
		                    <div class="about-product-item-left">
		                         <div class="about-product-title">ХТС литьё применяется для изготовления:</div>
		                    </div>
		                    <div class="about-product-item-right">
		                        <ul>
                		           <li>жароупорных цепей и роликов</li>
                		           <li>элементов оборудования для термообработки металлов</li>
                		           <li>термонагруженных узлов и агрегатов</li>
                		        </ul>
		                    </div>
		                   
		                </div>
		                <div class="about-product-item about-product-item-mob">
		                    <div class="about-product-item-left">
		                        <div class="about-product-title">Технические характеристики ХТС</div>
    		                    <div class="about-product-subtitle">
    		                        Для деталей массового и серийного производства показатель 
    		                        прочности составляет не менее 5,88 Мпа.
                                    Отливки, получаемые из смесей ХТС, обладают 
                                    идеальной геометрической формой и не нуждаются в 
                                    чистовой механической обработке.
                                </div>
		                    </div>
                            <div class="about-product-item-right">
                                 <ul>
                		           <li>прочностью на сжатие до 180 кПа при приготовлении</li>
                		           <li>прочностью на сжатие до 180 кПа при приготовлении</li>
                		           <li>прочностью на сжатие до 3,92 атм через 24 часа с момента приготовления</li>
                		           <li>прочностью на сжатие до 180 кПа при приготовлении</li>
                		           <li>прочностью на сжатие до 3,92 атм через 24 часа с момента приготовления</li>
                		        </ul>
                            </div>
		                </div>
		            </section>
		            
		            <section class="request-section request-help">
    		           <form class=\'form inner-block-item\'>
            		      <div class="page-title about-page-section-title">
        		               нужна помощь?
        		          </div>
        		          <div class="about-page-section-subtitle">
        		              Оставьте свои контакты, наш менеджер свяжется с вами в ближайшее время
        		          </div>
            		                          
            		      <div class="form-inputs">
            		           <label>
            		                <input type="text"  placeholder=\'Имя\'>
            		           </label>
            		           <label >
            		                <input type="text"  placeholder=\'Номер телефона\'>
            		           </label>
            		      </div>
            		                      
            		      <button class=\'form-button\'>Отправить заявку</button>
            		                          
            		      <div class="agreement">
            		           <label >
            		               <span class=\'square\'></span>
            		               <input type="checkbox">
            		               <p>Согласие на обработку пероснальных данных</p>
            		           </label>
            		       </div>
            		                      
            		  </form>
    		        </section>
		            
		            <section class="completed-works gallery-section">
        		         <div class="gallery-section-top">
        		              <div class="page-title about-page-section-title">
        		                 наши выполненные работы
        		              </div>
        		              <span>{фотогалерея}</span>
        		         </div>
        		         <div class="gallery-section-content completed-works-slider" >
        		             <div class=slider-control>
        		                     <div class=\'slider-btn slide-to-right\'></div>
        		                     <div class=\'slider-btn right  slide-to-left\'></div>
        		                 </div>
        			         <div class=\'slider__wrapper\' id="completed-works">
        			           <div class="swiper-wrapper" >
                                    <div class="swiper-slide">
                                        <img src="/assets/ubm/img/product-page-images/completed-works-image.png" alt="">     
                                    </div>
                                    <div class="swiper-slide">
                                       <img src="/assets/ubm/img/product-page-images/completed-works-image.png" alt="">     
                                    </div>
                                    <div class="swiper-slide">
                                        <img src="/assets/ubm/img/product-page-images/completed-works-image.png" alt="">     
                                    </div>
                                    <div class="swiper-slide">
                                       <img src="/assets/ubm/img/product-page-images/completed-works-image.png" alt="">
                                    </div>
                                </div>
        			         </div>
        		         </div>
        		     </section>
		            
		            <section class="request-section ">
    
    		          <form class=\'form inner-block-item\'>
            		      <div class="page-title about-page-section-title">
        		               оставьте заявку
        		          </div>
        		          <div class="about-page-section-subtitle">
        		              и наш менеджер перезвонит вам
        		          </div>
            		                          
            		      <div class="form-inputs">
            		           <label>
            		                <input type="text"  placeholder=\'Имя\'>
            		           </label>
            		           <label >
            		                <input type="text"  placeholder=\'Номер телефона\'>
            		           </label>
            		      </div>
            		                      
            		      <button class=\'form-button\'>Отправить заявку</button>
            		                          
            		      <div class="agreement">
            		           <label >
            		               <span class=\'square\'></span>
            		               <input type="checkbox">
            		               <p>Согласие на обработку пероснальных данных</p>
            		           </label>
            		       </div>
            		                      
            		  </form>
                      <div class=\'take-contact inner-block-item\'>
            		       <div class="inner-block-title">или свяжитесь <br> с&nbspнаши любым <br> удобным способом</div>
            		          <div class=\'take-contact-bottom\'>
            		               <a href="">контакты</a>
            		          </div>
            		       </div>
            	
    		   </section>
		            
		            <section class="work-style-section">
        		      <div class="page-title about-page-section-title">
        		          как мы работаем
        		      </div>
        		      <div class="work-stages">
            		      <div class="work-stages-item" data-open-block-wrapper>
            		        
                		          <div class="stage-wrapper" data-openBlock-btn>
                		              <div class="stage">  </div>
                		          </div>
                		              
                		          <div class=\'work-content-wrapper\' >
                		              <div class="work-description-top" data-openBlock-btn>
                		                  <div class="section-min-title">сбор информации</div>
                            		          <div class=\'arrow-dark-right-top-45\'>
                            		            <svg xmlns="http://www.w3.org/2000/svg" width="34" height="33" viewBox="0 0 34 33" fill="none">
                                                    <path d="M33.5 3C33.5 1.34315 32.1569 0 30.5 0L3.5 0C1.84315 0 0.5 1.34315 0.5 3C0.5 4.65685 1.84315 6 3.5 6L27.5 6L27.5 30C27.5 31.6569 28.8431 33 30.5 33C32.1569 33 33.5 31.6569 33.5 30V3ZM8.12132 29.6213L32.6213 5.12132L28.3787 0.87868L3.87868 25.3787L8.12132 29.6213Z" fill="#535353"/>
                                                </svg>
                            		      </div>
                		              </div>
                		              <div class="work-description-content" data-opening-block>
                		                  <ul>
                		                      <li>Получаем документацию на изготовление изделий</li>
                		                      <li>Получаем данные для заключения договора</li>
                		                      <li>Уточняем необходимые данные для расчета</li>
                		                      <li>Получаем контактные данные для сотрудничества</li>
                		                  </ul>
                		                  
                		                  <div class=\'inner-block\'>
                		                      <form class=\'form inner-block-item\'>
                		                          <div class="inner-block-title">заполните и отправьте форму заявки</div>
                		                          
                		                          <div class="form-inputs">
                		                              <label >
                		                                  <input type="text"  placeholder=\'Имя\'>
                		                              </label>
                		                              <label>
                		                                  <input type="text"  placeholder=\'Номер телефона\'>
                		                              </label>
                		                          </div>
                		                      
                		                          <button class=\'form-button\'>Отправить заявку</button>
                		                          
                		                          <div class="agreement">
                		                              <label >
                		                                  <span class=\'square\'></span>
                		                                  <input type="checkbox">
                		                                  <p>Согласие на обработку пероснальных данных</p>
                		                              </label>
                		                          </div>
                		                      
                		                      </form>
                		                      
                		                      <div class=\'take-contact inner-block-item\'>
                		                          <div class="inner-block-title">или свяжитесь с&nbspнаши любым удобным способом</div>
                		                          
                		                          <div class=\'take-contact-bottom\'>
                		                              <a href="">контакты</a>
                		                          </div>
                		                          
                		                          
                		                      </div>
                		                      
                		                  </div>
                		                  
                		                  
                		                  
                    		          </div>    
                		              
                		          </div>
            
            		          
            
            		     </div>
            		      <div class="work-stages-item" data-open-block-wrapper>
                		      <div class="stage-wrapper" data-openBlock-btn>
                		              <div class="stage">  </div>
                		          </div>
                		      <div class=\'work-content-wrapper\'>
                		              <div class="work-description-top" data-openBlock-btn>
                		                  <div class="section-min-title">сбор информации</div>
                            		          <div class=\'arrow-dark-right-top-45\'>
                            		            <svg xmlns="http://www.w3.org/2000/svg" width="34" height="33" viewBox="0 0 34 33" fill="none">
                                                    <path d="M33.5 3C33.5 1.34315 32.1569 0 30.5 0L3.5 0C1.84315 0 0.5 1.34315 0.5 3C0.5 4.65685 1.84315 6 3.5 6L27.5 6L27.5 30C27.5 31.6569 28.8431 33 30.5 33C32.1569 33 33.5 31.6569 33.5 30V3ZM8.12132 29.6213L32.6213 5.12132L28.3787 0.87868L3.87868 25.3787L8.12132 29.6213Z" fill="#535353"/>
                                                </svg>
                            		      </div>
                		              </div>
                		              <div class="work-description-content" data-opening-block>
                		                  <p>
                		                      Lorem ipsum dolor sit amet, consectetur adipisicing elit. 
                		                      Fuga dolore ea repudiandae rem dicta odio quidem perspiciatis 
                		                      quaerat asperiores earum natus autem doloremque exercitationem 
                		                      reiciendis consequatur repellendus a numquam temporibus?
                		                  </p>
                		                  <p>
                		                      Lorem ipsum dolor sit amet, consectetur adipisicing elit. 
                		                      Fuga dolore ea repudiandae rem dicta odio quidem perspiciatis 
                		                      quaerat asperiores earum natus autem doloremque exercitationem 
                		                      reiciendis consequatur repellendus a numquam temporibus?
                		                  </p>
                    		          </div>   
                		              
                		          </div>
            		     </div>
            		      <div class="work-stages-item" data-open-block-wrapper>
                		      <div class="stage-wrapper" data-openBlock-btn>
                		              <div class="stage">  </div>
                		          </div>
                		      <div class=\'work-content-wrapper\'>
                		              <div class="work-description-top" data-openBlock-btn>
                		                  <div class="section-min-title">сбор информации</div>
                            		          <div class=\'arrow-dark-right-top-45\'>
                            		            <svg xmlns="http://www.w3.org/2000/svg" width="34" height="33" viewBox="0 0 34 33" fill="none">
                                                    <path d="M33.5 3C33.5 1.34315 32.1569 0 30.5 0L3.5 0C1.84315 0 0.5 1.34315 0.5 3C0.5 4.65685 1.84315 6 3.5 6L27.5 6L27.5 30C27.5 31.6569 28.8431 33 30.5 33C32.1569 33 33.5 31.6569 33.5 30V3ZM8.12132 29.6213L32.6213 5.12132L28.3787 0.87868L3.87868 25.3787L8.12132 29.6213Z" fill="#535353"/>
                                                </svg>
                            		      </div>
                		              </div>
                		              <div class="work-description-content" data-opening-block>
                		                  <p>
                		                      Lorem ipsum dolor sit amet, consectetur adipisicing elit. 
                		                      Fuga dolore ea repudiandae rem dicta odio quidem perspiciatis 
                		                      quaerat asperiores earum natus autem doloremque exercitationem 
                		                      reiciendis consequatur repellendus a numquam temporibus?
                		                  </p>
                		                  <p>
                		                      Lorem ipsum dolor sit amet, consectetur adipisicing elit. 
                		                      Fuga dolore ea repudiandae rem dicta odio quidem perspiciatis 
                		                      quaerat asperiores earum natus autem doloremque exercitationem 
                		                      reiciendis consequatur repellendus a numquam temporibus?
                		                  </p>
                    		          </div>   
                		              
                		          </div>
            		     </div>
            		      <div class="work-stages-item" data-open-block-wrapper>
                		      <div class="stage-wrapper" data-openBlock-btn>
                		              <div class="stage">  </div>
                		          </div>
                		      <div class=\'work-content-wrapper\'>
                		              <div class="work-description-top" data-openBlock-btn>
                		                  <div class="section-min-title">сбор информации</div>
                            		          <div class=\'arrow-dark-right-top-45\'>
                            		            <svg xmlns="http://www.w3.org/2000/svg" width="34" height="33" viewBox="0 0 34 33" fill="none">
                                                    <path d="M33.5 3C33.5 1.34315 32.1569 0 30.5 0L3.5 0C1.84315 0 0.5 1.34315 0.5 3C0.5 4.65685 1.84315 6 3.5 6L27.5 6L27.5 30C27.5 31.6569 28.8431 33 30.5 33C32.1569 33 33.5 31.6569 33.5 30V3ZM8.12132 29.6213L32.6213 5.12132L28.3787 0.87868L3.87868 25.3787L8.12132 29.6213Z" fill="#535353"/>
                                                </svg>
                            		      </div>
                		              </div>
                		              <div class="work-description-content" data-opening-block>
                		                  <p>
                		                      Lorem ipsum dolor sit amet, consectetur adipisicing elit. 
                		                      Fuga dolore ea repudiandae rem dicta odio quidem perspiciatis 
                		                      quaerat asperiores earum natus autem doloremque exercitationem 
                		                      reiciendis consequatur repellendus a numquam temporibus?
                		                  </p>
                		                  <p>
                		                      Lorem ipsum dolor sit amet, consectetur adipisicing elit. 
                		                      Fuga dolore ea repudiandae rem dicta odio quidem perspiciatis 
                		                      quaerat asperiores earum natus autem doloremque exercitationem 
                		                      reiciendis consequatur repellendus a numquam temporibus?
                		                  </p>
                    		          </div>   
                		              
                		          </div>
            		     </div>
              	      </div>
    		        </section>
    		        
    		        <section class="certification"> 
    		            <div class="page-title">
        		          сертификация
        		        </div>
        		     
        		            <div class=\'slider__wrapper certification-slider-wrapper\' id="certification">
        			           <div class="swiper-wrapper certification-content" >
                                    <div class="swiper-slide">
                                        <img src="/assets/ubm/img/product-page-images/certificate.png" alt="">
                                    </div>
                                    <div class="swiper-slide">
                                      <img src="/assets/ubm/img/product-page-images/certificate.png" alt="">
                                    </div>
                                    <div class="swiper-slide">
                                      <img src="/assets/ubm/img/product-page-images/certificate.png" alt="">
                                    </div>
                                    <div class="swiper-slide">
                                      <img src="/assets/ubm/img/product-page-images/certificate.png" alt="">
                                    </div>
                        
                                </div>
                                <div class="slider-control certification-slider-control">
        		                     <div class="slider-btn certification-slide-to-right"></div>
        		                     <div class="slider-btn right certification-slide-to-left"></div>
        		                 </div>
        			         </div>
    		        </section>
    		        
    		        <section class="question-answer">
    		            <div class="page-title">
    		                Ответы на&nbspвопросы
        		        </div>
        		        <div class="question-answer-content">
        		            <div class="question-answer-item" data-open-block-wrapper>
        		                <div class="question" data-openBlock-btn>
        		                    <div class="question-title">Производство точных отливок способом литья по выплавляемым моделям</div>
        		                    <div class="arrow-dark-right-top-45">
                            		    <svg xmlns="http://www.w3.org/2000/svg" width="34" height="33" viewBox="0 0 34 33" fill="none">
                                            <path d="M33.5 3C33.5 1.34315 32.1569 0 30.5 0L3.5 0C1.84315 0 0.5 1.34315 0.5 3C0.5 4.65685 1.84315 6 3.5 6L27.5 6L27.5 30C27.5 31.6569 28.8431 33 30.5 33C32.1569 33 33.5 31.6569 33.5 30V3ZM8.12132 29.6213L32.6213 5.12132L28.3787 0.87868L3.87868 25.3787L8.12132 29.6213Z" fill="#535353"></path>
                                        </svg>
                            		</div>
        		                </div>
        		                <div class="answer" data-opening-block>
        		                    Lorem ipsum dolor sit amet, consectetuer adipiscing elit. 
        		                    Aenean commodo ligula eget dolor. Aenean massa. 
        		                    Cum sociis natoque penatibuss
        		                </div>
        		            </div>
        		            <div class="question-answer-item" data-open-block-wrapper>
        		                <div class="question" data-openBlock-btn>
        		                    <div class="question-title">Производство точных отливок способом литья по выплавляемым моделям</div>
        		                    <div class="arrow-dark-right-top-45">
                            		    <svg xmlns="http://www.w3.org/2000/svg" width="34" height="33" viewBox="0 0 34 33" fill="none">
                                            <path d="M33.5 3C33.5 1.34315 32.1569 0 30.5 0L3.5 0C1.84315 0 0.5 1.34315 0.5 3C0.5 4.65685 1.84315 6 3.5 6L27.5 6L27.5 30C27.5 31.6569 28.8431 33 30.5 33C32.1569 33 33.5 31.6569 33.5 30V3ZM8.12132 29.6213L32.6213 5.12132L28.3787 0.87868L3.87868 25.3787L8.12132 29.6213Z" fill="#535353"></path>
                                        </svg>
                            		</div>
        		                </div>
        		                <div class="answer" data-opening-block>
        		                    Lorem ipsum dolor sit amet, consectetuer adipiscing elit. 
        		                    Aenean commodo ligula eget dolor. Aenean massa. 
        		                    Cum sociis natoque penatibuss
        		                    Lorem ipsum dolor sit amet, consectetur adipisicing elit. 
        		                    Fugit animi illum sequi dignissimos dicta cumque nisi voluptate 
        		                    minus ad illo velit aspernatur ea. Nobis maiores voluptatem cum 
        		                    soluta quo itaque.
        		                    Aenean commodo ligula eget dolor. Aenean massa. 
        		                    Cum sociis natoque penatibuss
        		                    Lorem ipsum dolor sit amet, consectetur adipisicing elit. 
        		                    Fugit animi illum sequi dignissimos dicta cumque nisi voluptate 
        		                    minus ad illo velit aspernatur ea. Nobis maiores voluptatem cum 
        		                    soluta quo itaque.
        		                </div>
        		            </div>
        		            <div class="question-answer-item" data-open-block-wrapper>
        		                <div class="question" data-openBlock-btn>
        		                    <div class="question-title">Производство точных отливок способом литья по выплавляемым моделям</div>
        		                    <div class="arrow-dark-right-top-45">
                            		    <svg xmlns="http://www.w3.org/2000/svg" width="34" height="33" viewBox="0 0 34 33" fill="none">
                                            <path d="M33.5 3C33.5 1.34315 32.1569 0 30.5 0L3.5 0C1.84315 0 0.5 1.34315 0.5 3C0.5 4.65685 1.84315 6 3.5 6L27.5 6L27.5 30C27.5 31.6569 28.8431 33 30.5 33C32.1569 33 33.5 31.6569 33.5 30V3ZM8.12132 29.6213L32.6213 5.12132L28.3787 0.87868L3.87868 25.3787L8.12132 29.6213Z" fill="#535353"></path>
                                        </svg>
                            		</div>
        		                </div>
        		                <div class="answer" data-opening-block>
        		                    Lorem ipsum dolor sit amet, consectetuer adipiscing elit. 
        		                </div>
        		            </div>
        		            <div class="question-answer-item" data-open-block-wrapper>
        		                <div class="question" data-openBlock-btn>
        		                    <div class="question-title">Производство точных отливок способом литья по выплавляемым моделям</div>
        		                    <div class="arrow-dark-right-top-45">
                            		    <svg xmlns="http://www.w3.org/2000/svg" width="34" height="33" viewBox="0 0 34 33" fill="none">
                                            <path d="M33.5 3C33.5 1.34315 32.1569 0 30.5 0L3.5 0C1.84315 0 0.5 1.34315 0.5 3C0.5 4.65685 1.84315 6 3.5 6L27.5 6L27.5 30C27.5 31.6569 28.8431 33 30.5 33C32.1569 33 33.5 31.6569 33.5 30V3ZM8.12132 29.6213L32.6213 5.12132L28.3787 0.87868L3.87868 25.3787L8.12132 29.6213Z" fill="#535353"></path>
                                        </svg>
                            		</div>
        		                </div>
        		                <div class="answer" data-opening-block>
        		                    Lorem ipsum dolor sit amet, consectetuer adipiscing elit. 
        		                    Aenean commodo ligula eget dolor. Aenean massa. 
        		                    Cum sociis natoque penatibuss
        		                    Lorem ipsum dolor sit amet, consectetuer adipiscing elit. 
        		                    Aenean commodo ligula eget dolor. Aenean massa. 
        		                    Cum sociis natoque penatibuss
        		                </div>
        		            </div>
        		        </div>
        		        
        		     
    		        </section>
		           
		        </main>
		        
                    
			</div>
			
			
			
			
			
			<div class="footer inner-min">
	<div class=" main-footer">
		<div class="fb_l">
			<div class="f-contacts">
				<div class="f-tel">
				    <a href="tel:+7 (343) 375-48-41">+7 (343) 375-48-41</a>
				</div>
				 <div class="f-mail">
					<a href="mailto:lp@lpubm.ru">lp@lpubm.ru</a>
                    <a href="mailto:snab@lpubm.ru">snab@lpubm.ru</a>
                </div>
			</div>
		</div>
		
		<div class="fb_r">
			<div class="footer-address">
				623070, Свердловская обл., Нижнесергиенский р-н, р.п. Верхние Серги, ул. Володарского 10
			</div>
			<a class="footer-in-map go-to" href="https://yandex.ru/maps/?um=constructor%3A0bd4c9a8cc4042947d03f8a6f60ca34712418f38da43f8fd81ec80519b519838&source=constructorLink" >
			    <div class=\'arrow-gold-right-45\'>
			        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 34 33" fill="none">
                      <path d="M33.5 3C33.5 1.34315 32.1569 0 30.5 0L3.5 0C1.84315 0 0.5 1.34315 0.5 3C0.5 4.65685 1.84315 6 3.5 6L27.5 6L27.5 30C27.5 31.6569 28.8431 33 30.5 33C32.1569 33 33.5 31.6569 33.5 30V3ZM8.12132 29.6213L32.6213 5.12132L28.3787 0.87868L3.87868 25.3787L8.12132 29.6213Z" fill="#F0A73C"/>
                    </svg>
			    </div>
			    <span class=\'footer-in-map-text\'>мы на карте</span>
			</a>
	</div>
	</div>

	<div class=" bottom-line">
		<div class="bottom-line-inner">
		    <div class="bottom-menu">
				<ul class=""><li class="first active"><a  class="first active" href="produkcziya/" >Продукция</a></li><li><a  href="o-kompanii/" >О компании</a></li><li><a  href="novosti/" >Новости</a></li><li class="last"><a  class="last" href="contacts/" >Контакты</a></li></ul>
			</div>
			<div class="privacy-policy-wrapper">
			    <div class="copy">
				    <div class="uss-site-copyright">©&nbsp;2009 - 2023 Литейное производство УБМ</div>						
			    </div>
			    <div class="privacy-block">
				    <a  href="politika-konfidenczialnosti/">Политика конфиденциальности</a>
			    </div>
			</div>
			
			
		</div>
	</div>
</div>





			       

		
 
			   
			       

			
			
			
	
		
		
		
		
		
		
		
		
<!-- Modal Structure -->
  <div id="modal1" class="modal">
    <div class="modal-content">
      <h4>Add an Image</h4>

      <div class="row">
        <form class="col s12">
          <div class="row modal-form-row">
            <div class="input-field col s12">
              <input id="image_url" type="text" class="validate">
              <label for="image_url">Image URL</label>
            </div>
          </div>
          <div class="row">
            <div class="input-field col s12">
              <input id="image_title" type="text" class="validate">
              <label for="image_title">Title</label>
            </div>
          </div>       
          <div class="row">
            <div class="input-field col s12">
              <textarea id="image_description" type="text" class="materialize-textarea validate"></textarea>
              <label for="image_description">Description</label>
            </div>
          </div>             
        </form>
      </div>
    </div>
    <div class="modal-footer">
      <a class=" modal-action modal-close waves-effect waves-green btn-flat">Submit</a>
    </div>
  </div>
  
  

		<script src="/assets/ubm/js/jquery.form.min.js" type="text/javascript"></script>
        <script src="/assets/ubm/js/jquery.autocomplete.min.js" type="text/javascript"></script>
        <script src="/assets/ubm/js/uss-script-8.1.0.min.js" type="text/javascript"></script>
		<script src="/assets/ubm/js/owl/owl.carousel.min.js" type="text/javascript"></script>
		<script src="/assets/ubm/js/main-v4.js"></script>
		<script src="/assets/ubm/js/flex.js"></script>
		
		<script src="/assets/ubm/js/swiper-bundle.min.js" type="text/javascript"></script>
		<script src="/assets/ubm/js/lpubm.js" type="text/javascript"></script>
<link rel=\'stylesheet\' href=\'/assets/bootstrap.css\'>

<script src=\'https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/4.1.3/js/bootstrap.min.js\'>


<script 
src="https://cdn.jsdelivr.net/npm/jquery@3.4.1/dist/jquery.min.js">
</script>

<script 
src="https://cdn.jsdelivr.net/gh/fancyapps/fancybox@3.5.7/dist/jquery.fancybox.min.js">
</script>


<script src="/assets/ubm/js/readmore.js"></script>

  <script>
    $(\'#info\').readmore({
      moreLink: \'<a href="#">Usage, examples, and options</a>\',
      collapsedHeight: 384,
      afterToggle: function(trigger, element, expanded) {
        if(! expanded) { // The "Close" link was clicked
          $(\'html, body\').animate({scrollTop: element.offset().top}, {duration: 100});
        }
      }
    });

    $(\'article\').readmore({speed: 500});
  </script>
	</body>
</html>



	



		            
		            
		            
		            ',
    '_isForward' => false,
    '_jscripts' => 
    array (
      0 => '<script src="/assets/components/sweetalert2/js/sweetalert2.all.min.js"></script>',
      1 => '<script src="/assets/components/sweetalert2/js/default.min.js"></script>',
      2 => '<script>document.addEventListener(\'DOMContentLoaded\', function(){ SweetAlert2.initialize({"position":"top-end","timer":3000,"showConfirmButton":false,"toast":true,"width":"19rem"},{"ajaxform":true,"minishop2":true,"office":true,"msoneclick":true}) })</script>',
    ),
    '_loadedjscripts' => 
    array (
      '/assets/components/sweetalert2/js/sweetalert2.all.min.js' => true,
      '/assets/components/sweetalert2/js/default.min.js' => true,
      '<script>document.addEventListener(\'DOMContentLoaded\', function(){ SweetAlert2.initialize({"position":"top-end","timer":3000,"showConfirmButton":false,"toast":true,"width":"19rem"},{"ajaxform":true,"minishop2":true,"office":true,"msoneclick":true}) })</script>' => true,
    ),
  ),
  'contentType' => 
  array (
    'id' => 1,
    'name' => 'HTML',
    'description' => 'HTML content',
    'mime_type' => 'text/html',
    'file_extensions' => '/',
    'headers' => NULL,
    'binary' => 0,
  ),
  'policyCache' => 
  array (
  ),
  'elementCache' => 
  array (
    '[[MetaX? tpl=`HeadProd`]]' => '<head>
	<base href="http://lpubm.na4u.ru/" />
	<meta name="robots" content="index, follow" />
	<link rel="canonical" href="http://lpubm.na4u.ru/produkcziya/proizvodstvo-naplavochnyix-prutkov/" />
		<meta http-equiv="Content-Type" content="text/html; charset=windows-1251" />
	<meta charset="UTF-8" />
	<meta name="viewport" content="width=device-width, initial-scale=1" />
    <title itemprop="name">Производство наплавочных прутков  на заказ по низкой цене в Екатеринбурге | УБМ</title>
	<meta name="description" itemprop="description" content="Производство наплавочных прутков любой сложности ⚙️ Низкие цены ✅ Гарантия качества ✅ Литейное производство УБМ в Екатеринбурге и Свердловской области" />
	<meta name="abstract" content="Производство наплавочных прутков  на заказ по низкой цене в Екатеринбурге | УБМ" />
	
	
    <link rel="shortcut icon" href="/favicon.png" type="image/png" />
    <meta name="copyright" content="Copyright (c) 2024 by Литейное производство">
    <link rel="schema.DC" href="http://purl.org/dc/elements/1.1/">
    <meta name="DC.contributor" content="Литейное производство">
    <meta name="DC.creator" content="Admin">
    <meta name="DC.date" content="2023-06-16">
    <meta name="DC.format" content="text/html">
    <meta name="DC.identifier" content="Производство наплавочных прутков - 34">
    <meta name="DC.language" content="ru">
    <meta name="DC.publisher" content="Литейное производство">
    <meta name="DC.rights" content="Copyright (c) 2024 by Литейное производство">
    <meta name="DC.rightsHolder" content="Литейное производство">
    <meta name="DC.title" content="Производство наплавочных прутков">

    <link href="/assets/ubm/css/uss-style-8.1.0.min.css" rel="stylesheet" type="text/css" />
    <link href="/assets/ubm/css/style-d=1578909180.css" rel="stylesheet" type="text/css" />
    <script src="/assets/ubm/js/jquery-1.9.1.min.js" type="text/javascript"></script>
    <script src="/assets/ubm/js/jquery.formstyler.min.js" type="text/javascript"></script>
    <link rel="preload" href="/assets/ubm/js/jquery.form.min.js" as="script"/>
    <link rel="preload" href="/assets/ubm/js/jquery.autocomplete.min.js" as="script"/>
    <link rel="preload" href="/assets/ubm/js/uss-script-8.1.0.min.js" as="script"/>
	
	<link rel="stylesheet" href="/assets/ubm/css/swiper-bundle.min.css" />


<link rel="stylesheet"
href="https://cdn.jsdelivr.net/gh/fancyapps/fancybox@3.5.7/dist/jquery.fancybox.min.css"
/>
</head>',
    '[[pdoMenu?
                        &parents=`0`
                        &tpl=`@INLINE <li><a [[+classes]] href="[[+link]]" [[+attributes]]>[[+menutitle]]</a>[[+wrapper]]</li>`
                    ]]' => '<ul class=""><li><a  class="first active" href="produkcziya/" >Продукция</a></li><li><a  href="o-kompanii/" >О компании</a></li><li><a  href="novosti/" >Новости</a></li><li><a  class="last" href="contacts/" >Контакты</a></li></ul>',
    '[[$Header]]' => '<!-- Yandex.Metrika counter -->
<script type="text/javascript" >
   (function(m,e,t,r,i,k,a){m[i]=m[i]||function(){(m[i].a=m[i].a||[]).push(arguments)};
   m[i].l=1*new Date();
   for (var j = 0; j < document.scripts.length; j++) {if (document.scripts[j].src === r) { return; }}
   k=e.createElement(t),a=e.getElementsByTagName(t)[0],k.async=1,k.src=r,a.parentNode.insertBefore(k,a)})
   (window, document, "script", "https://mc.yandex.ru/metrika/tag.js", "ym");
   ym(92489463, "init", {
        clickmap:true,
        trackLinks:true,
        accurateTrackBounce:true
   });
</script>
<noscript><div><img src="https://mc.yandex.ru/watch/92489463" style="position:absolute; left:-9999px;" alt="" /></div></noscript>
<!-- /Yandex.Metrika counter -->

<script src="//code.jivo.ru/widget/VTHqXXTq3m" async></script>

<div class="header">
	<div class="inner-min mobile-menu">
    	<div class=" main-header">
    		<a href="/" class="hb_l header-logo-pc">
                <div class="header-logo">ЛП УБМ</div>
                <div class="logo_sitename"> Литейное производство  </div>
    	    </a>
        	<a href="/" class="header-logo-mobile">
        	        <svg xmlns="http://www.w3.org/2000/svg" width="61" height="37" viewBox="0 0 61 37" fill="none">
                      <path d="M0.141266 11.8663V10.3913C0.421443 10.4187 0.652177 10.405 0.833468 10.3501C1.02025 10.2896 1.17682 10.1743 1.30318 10.004C1.42953 9.82818 1.53666 9.57547 1.62456 9.24585C1.71795 8.91623 1.8086 8.49047 1.89649 7.96857C2.01735 7.30384 2.11899 6.61987 2.20139 5.91668C2.2838 5.21349 2.35247 4.5158 2.40741 3.82359C2.46784 3.1259 2.51728 2.45292 2.55573 1.80467C2.59419 1.15642 2.6244 0.55486 2.64638 0H10.4337V11.8663H8.71139V1.62338H4.26152C4.23405 2.06287 4.20109 2.55456 4.16263 3.09843C4.12418 3.6423 4.07748 4.21914 4.02254 4.82894C3.96761 5.43873 3.89894 6.06776 3.81653 6.71601C3.73962 7.36427 3.64073 8.01527 3.51987 8.66901C3.42099 9.22937 3.30013 9.73478 3.15729 10.1853C3.01446 10.6357 2.82218 11.0121 2.58046 11.3142C2.33873 11.6109 2.02285 11.8086 1.6328 11.9075C1.24275 12.0119 0.74557 11.9982 0.141266 11.8663Z" fill="white"/>
                      <path d="M12.7467 11.8663V0H22.182V11.8663H20.4598V1.62338H14.4689V11.8663H12.7467Z" fill="white"/>
                      <path d="M29.501 11.8663L31.0008 8.79262L26.8641 0H28.8006L31.899 6.96323L35.0799 0H36.9175L31.3634 11.8663H29.501Z" fill="white"/>
                      <path d="M38.2085 11.8663V0H45.9464V1.62338H39.9308V4.48284H43.0045C43.1144 4.48284 43.2545 4.48833 43.4248 4.49932C43.6006 4.50481 43.7654 4.51854 43.9192 4.54052C44.562 4.61743 45.1031 4.82619 45.5426 5.1668C45.9876 5.50741 46.3227 5.93866 46.5479 6.46056C46.7787 6.98246 46.894 7.5538 46.894 8.17458C46.894 8.79537 46.7814 9.36671 46.5562 9.88861C46.3309 10.4105 45.9958 10.8418 45.5508 11.1824C45.1113 11.523 44.5675 11.7317 43.9192 11.8086C43.7654 11.8306 43.6033 11.8471 43.433 11.8581C43.2627 11.8636 43.1199 11.8663 43.0045 11.8663H38.2085ZM39.9308 10.2429H42.9386C43.0485 10.2429 43.1693 10.2375 43.3012 10.2265C43.4385 10.2155 43.5676 10.199 43.6885 10.177C44.2214 10.0672 44.5949 9.81444 44.8092 9.4189C45.0289 9.02335 45.1388 8.60858 45.1388 8.17458C45.1388 7.73509 45.0289 7.32032 44.8092 6.93027C44.5949 6.53472 44.2214 6.28201 43.6885 6.17214C43.5676 6.14467 43.4385 6.12819 43.3012 6.1227C43.1693 6.11171 43.0485 6.10622 42.9386 6.10622H39.9308V10.2429Z" fill="white"/>
                      <path d="M48.5414 11.8663V0H50.0988L54.4004 8.92447L58.6772 0H60.2511V11.8581H58.6195V3.74119L54.7877 11.8663H54.0048L50.1647 3.74119V11.8663H48.5414Z" fill="white"/>
                      <path d="M0 25.0563V24.4394C0.172658 24.4551 0.315494 24.4488 0.428506 24.4206C0.541519 24.3892 0.632557 24.3201 0.70162 24.2134C0.773823 24.1067 0.836608 23.9481 0.889975 23.7378C0.943342 23.5243 0.996709 23.2465 1.05008 22.9043C1.10972 22.5339 1.15995 22.165 1.20076 21.7977C1.24471 21.4304 1.28238 21.0584 1.31377 20.6817C1.3483 20.3019 1.37656 19.9126 1.39853 19.5139C1.42051 19.1153 1.44091 18.7024 1.45975 18.2755H5.7401V25.0563H5.0479V18.9395H2.12841C2.10643 19.2628 2.08446 19.594 2.06248 19.933C2.04365 20.2721 2.01853 20.619 1.98714 20.9737C1.95889 21.3284 1.92278 21.6941 1.87884 22.0709C1.83803 22.4444 1.78623 22.8305 1.72344 23.2292C1.67322 23.5306 1.61357 23.81 1.54451 24.0674C1.47858 24.3248 1.38441 24.5414 1.26197 24.7172C1.14268 24.893 0.981013 25.0139 0.776962 25.0798C0.576051 25.1457 0.317063 25.1379 0 25.0563Z" fill="#8A8A8A"/>
                      <path d="M11.0961 19.9707V25.0563H10.4228V21.0961L7.63512 25.0563H7.05123V19.9707H7.72459V23.8979L10.5169 19.9707H11.0961Z" fill="#8A8A8A"/>
                      <path d="M13.7975 25.0563V20.6111H11.994V19.9707H16.2932V20.6111H14.4897V25.0563H13.7975Z" fill="#8A8A8A"/>
                      <path d="M19.343 25.1975C18.847 25.1975 18.4169 25.0877 18.0527 24.8679C17.6917 24.6482 17.4108 24.339 17.2099 23.9403C17.0089 23.5416 16.9085 23.0738 16.9085 22.537C16.9085 21.9814 17.0074 21.5011 17.2051 21.0961C17.4029 20.6912 17.6807 20.3788 18.0386 20.1591C18.3996 19.9393 18.825 19.8294 19.3147 19.8294C19.817 19.8294 20.2455 19.9456 20.6002 20.1779C20.955 20.4071 21.2234 20.7367 21.4055 21.1668C21.5875 21.5968 21.6707 22.1101 21.655 22.7065H20.9487V22.4617C20.9361 21.8024 20.7933 21.3049 20.5202 20.969C20.2502 20.6331 19.8547 20.4651 19.3336 20.4651C18.7873 20.4651 18.3682 20.6425 18.0763 20.9972C17.7875 21.352 17.6431 21.8574 17.6431 22.5135C17.6431 23.1539 17.7875 23.6515 18.0763 24.0062C18.3682 24.3578 18.781 24.5336 19.3147 24.5336C19.6789 24.5336 19.9959 24.4504 20.2659 24.284C20.539 24.1145 20.7541 23.8712 20.911 23.5541L21.5561 23.8037C21.3552 24.2463 21.0586 24.5901 20.6662 24.835C20.2769 25.0767 19.8358 25.1975 19.343 25.1975ZM17.3982 22.7065V22.1274H21.283V22.7065H17.3982Z" fill="#8A8A8A"/>
                      <path d="M24.8096 19.368C24.5867 19.368 24.3827 19.313 24.1974 19.2032C24.0122 19.0933 23.8647 18.9473 23.7548 18.7652C23.6481 18.58 23.5947 18.376 23.5947 18.1531H24.1692C24.1692 18.3289 24.232 18.4796 24.3575 18.6051C24.4831 18.7307 24.6338 18.7935 24.8096 18.7935C24.9885 18.7935 25.1392 18.7307 25.2616 18.6051C25.3872 18.4796 25.45 18.3289 25.45 18.1531H26.0245C26.0245 18.376 25.9695 18.58 25.8597 18.7652C25.7529 18.9473 25.607 19.0933 25.4217 19.2032C25.2365 19.313 25.0325 19.368 24.8096 19.368ZM26.7402 19.9707V25.0563H26.0669V21.0961L23.2792 25.0563H22.6953V19.9707H23.3687V23.8979L26.161 19.9707H26.7402Z" fill="#8A8A8A"/>
                      <path d="M28.0572 25.0563V19.9707H28.7494V22.1792H31.6171V19.9707H32.3093V25.0563H31.6171V22.8431H28.7494V25.0563H28.0572Z" fill="#8A8A8A"/>
                      <path d="M35.7497 25.1975C35.2443 25.1975 34.8127 25.083 34.4548 24.8538C34.0969 24.6246 33.8223 24.3076 33.6308 23.9026C33.4393 23.4976 33.3435 23.033 33.3435 22.5088C33.3435 21.9751 33.4408 21.5074 33.6355 21.1055C33.8301 20.7037 34.1064 20.3914 34.4642 20.1685C34.8252 19.9424 35.2537 19.8294 35.7497 19.8294C36.2583 19.8294 36.6915 19.944 37.0494 20.1732C37.4104 20.3992 37.6851 20.7147 37.8734 21.1197C38.0649 21.5215 38.1607 21.9845 38.1607 22.5088C38.1607 23.0424 38.0649 23.5118 37.8734 23.9167C37.6819 24.3186 37.4057 24.6325 37.0447 24.8585C36.6837 25.0845 36.252 25.1975 35.7497 25.1975ZM35.7497 24.5336C36.3148 24.5336 36.7355 24.3468 37.0117 23.9732C37.288 23.5965 37.4261 23.1084 37.4261 22.5088C37.4261 21.8935 37.2864 21.4038 37.007 21.0396C36.7308 20.6755 36.3117 20.4934 35.7497 20.4934C35.3699 20.4934 35.056 20.5797 34.808 20.7524C34.5631 20.9219 34.3795 21.1589 34.257 21.4634C34.1377 21.7648 34.0781 22.1132 34.0781 22.5088C34.0781 23.1209 34.2194 23.6122 34.5019 23.9827C34.7844 24.3499 35.2004 24.5336 35.7497 24.5336Z" fill="#8A8A8A"/>
                      <path d="M41.3514 25.1975C40.8554 25.1975 40.4253 25.0877 40.0611 24.8679C39.7001 24.6482 39.4192 24.339 39.2183 23.9403C39.0174 23.5416 38.9169 23.0738 38.9169 22.537C38.9169 21.9814 39.0158 21.5011 39.2136 21.0961C39.4113 20.6912 39.6892 20.3788 40.047 20.1591C40.408 19.9393 40.8334 19.8294 41.3231 19.8294C41.8254 19.8294 42.2539 19.9456 42.6086 20.1779C42.9634 20.4071 43.2318 20.7367 43.4139 21.1668C43.5959 21.5968 43.6791 22.1101 43.6634 22.7065H42.9571V22.4617C42.9445 21.8024 42.8017 21.3049 42.5286 20.969C42.2586 20.6331 41.8631 20.4651 41.342 20.4651C40.7957 20.4651 40.3766 20.6425 40.0847 20.9972C39.7959 21.352 39.6515 21.8574 39.6515 22.5135C39.6515 23.1539 39.7959 23.6515 40.0847 24.0062C40.3766 24.3578 40.7895 24.5336 41.3231 24.5336C41.6873 24.5336 42.0043 24.4504 42.2743 24.284C42.5474 24.1145 42.7625 23.8712 42.9194 23.5541L43.5645 23.8037C43.3636 24.2463 43.067 24.5901 42.6746 24.835C42.2853 25.0767 41.8442 25.1975 41.3514 25.1975ZM39.4066 22.7065V22.1274H43.2914V22.7065H39.4066Z" fill="#8A8A8A"/>
                      <path d="M0.466177 35.0563V29.9707H4.51109V35.0563H3.81889V30.6346H1.15838V35.0563H0.466177Z" fill="#8A8A8A"/>
                      <path d="M7.95643 35.1975C7.45101 35.1975 7.01937 35.083 6.66149 34.8538C6.30362 34.6246 6.02894 34.3076 5.83744 33.9026C5.64595 33.4976 5.5502 33.033 5.5502 32.5088C5.5502 31.9751 5.64752 31.5074 5.84215 31.1055C6.03678 30.7037 6.31304 30.3914 6.67091 30.1685C7.03192 29.9424 7.46043 29.8294 7.95643 29.8294C8.46499 29.8294 8.8982 29.944 9.25608 30.1732C9.61709 30.3992 9.89177 30.7147 10.0801 31.1197C10.2716 31.5215 10.3674 31.9845 10.3674 32.5088C10.3674 33.0424 10.2716 33.5118 10.0801 33.9167C9.88863 34.3185 9.61238 34.6325 9.25137 34.8585C8.89035 35.0845 8.45871 35.1975 7.95643 35.1975ZM7.95643 34.5336C8.52149 34.5336 8.94215 34.3468 9.2184 33.9732C9.49466 33.5965 9.63278 33.1084 9.63278 32.5088C9.63278 31.8935 9.49309 31.4038 9.2137 31.0396C8.93744 30.6755 8.51835 30.4934 7.95643 30.4934C7.57658 30.4934 7.26266 30.5797 7.01466 30.7524C6.7698 30.9219 6.58615 31.1589 6.46372 31.4634C6.34443 31.7648 6.28478 32.1132 6.28478 32.5088C6.28478 33.1209 6.42605 33.6122 6.70858 33.9827C6.99111 34.3499 7.40706 34.5336 7.95643 34.5336Z" fill="#8A8A8A"/>
                      <path d="M15.4463 29.9707V35.0563H14.7729V31.0961L11.9853 35.0563H11.4014V29.9707H12.0748V33.8979L14.8671 29.9707H15.4463Z" fill="#8A8A8A"/>
                      <path d="M18.5997 35.1975C18.088 35.1975 17.6407 35.0861 17.2577 34.8632C16.8778 34.6372 16.578 34.3248 16.3583 33.9261L16.9139 33.573C17.0991 33.8869 17.3299 34.1255 17.6061 34.2887C17.8824 34.452 18.1995 34.5336 18.5573 34.5336C18.9309 34.5336 19.2307 34.4473 19.4567 34.2746C19.6827 34.1019 19.7958 33.8649 19.7958 33.5636C19.7958 33.3564 19.7471 33.1916 19.6498 33.0691C19.5556 32.9467 19.4112 32.8588 19.2166 32.8054C19.0251 32.7521 18.7849 32.7254 18.4961 32.7254H17.8934V32.1321H18.4867C18.8383 32.1321 19.1208 32.0693 19.3343 31.9437C19.5509 31.815 19.6592 31.6141 19.6592 31.341C19.6592 31.0522 19.5509 30.8387 19.3343 30.7006C19.1208 30.5593 18.865 30.4887 18.5667 30.4887C18.2654 30.4887 17.9797 30.5515 17.7097 30.677C17.4429 30.7995 17.2184 30.958 17.0364 31.1526L16.5937 30.6864C16.848 30.4071 17.1447 30.1952 17.4837 30.0508C17.8259 29.9032 18.2042 29.8294 18.6185 29.8294C18.945 29.8294 19.2401 29.8875 19.5038 30.0037C19.7706 30.1167 19.981 30.2831 20.1348 30.5028C20.2918 30.7225 20.3702 30.9862 20.3702 31.2939C20.3702 31.5827 20.2996 31.8323 20.1583 32.0426C20.0202 32.2529 19.824 32.4272 19.5697 32.5653L19.5321 32.3063C19.7518 32.3471 19.9339 32.435 20.0783 32.57C20.2227 32.705 20.3294 32.8666 20.3985 33.055C20.4676 33.2434 20.5021 33.4349 20.5021 33.6295C20.5021 33.9528 20.4173 34.2322 20.2478 34.4677C20.0814 34.7 19.8538 34.8805 19.565 35.0092C19.2794 35.1348 18.9576 35.1975 18.5997 35.1975Z" fill="#8A8A8A"/>
                      <path d="M21.5365 35.0563V29.9707H23.6319C23.7387 29.9707 23.8674 29.977 24.0181 29.9895C24.1719 30.0021 24.3147 30.0256 24.4466 30.0602C24.7322 30.1355 24.9614 30.2893 25.1341 30.5216C25.3099 30.7539 25.3978 31.0333 25.3978 31.3598C25.3978 31.5419 25.3695 31.7051 25.313 31.8495C25.2596 31.9908 25.1827 32.1132 25.0823 32.2168C25.0352 32.2702 24.9834 32.3173 24.9269 32.3581C24.8704 32.3958 24.8154 32.4272 24.7621 32.4523C24.8625 32.4711 24.9708 32.5151 25.087 32.5841C25.269 32.6909 25.4072 32.8353 25.5014 33.0173C25.5955 33.1963 25.6426 33.4144 25.6426 33.6719C25.6426 34.0203 25.5594 34.3044 25.393 34.5242C25.2267 34.7439 25.0038 34.8946 24.7244 34.9762C24.5988 35.0107 24.4623 35.0327 24.3147 35.0421C24.1703 35.0516 24.0338 35.0563 23.905 35.0563H21.5365ZM22.2334 34.4677H23.8721C23.938 34.4677 24.0212 34.463 24.1217 34.4535C24.2221 34.441 24.3116 34.4253 24.3901 34.4064C24.5753 34.3594 24.7103 34.2652 24.795 34.1239C24.8829 33.9795 24.9269 33.8225 24.9269 33.653C24.9269 33.4301 24.8609 33.2481 24.7291 33.1068C24.6004 32.9624 24.4277 32.8745 24.2111 32.8431C24.1389 32.8274 24.0636 32.818 23.9851 32.8149C23.9066 32.8117 23.836 32.8101 23.7732 32.8101H22.2334V34.4677ZM22.2334 32.2168H23.6555C23.7371 32.2168 23.8281 32.2121 23.9286 32.2027C24.0322 32.1901 24.1217 32.1697 24.197 32.1415C24.3602 32.085 24.4795 31.9877 24.5549 31.8495C24.6334 31.7114 24.6726 31.5607 24.6726 31.3975C24.6726 31.2185 24.6302 31.0616 24.5455 30.9266C24.4638 30.7916 24.3398 30.6974 24.1735 30.6441C24.0604 30.6033 23.938 30.5797 23.8062 30.5734C23.6775 30.5672 23.5958 30.564 23.5613 30.564H22.2334V32.2168Z" fill="#8A8A8A"/>
                      <path d="M28.7048 35.1975C28.1994 35.1975 27.7678 35.083 27.4099 34.8538C27.052 34.6246 26.7774 34.3076 26.5859 33.9026C26.3944 33.4976 26.2986 33.033 26.2986 32.5088C26.2986 31.9751 26.3959 31.5074 26.5906 31.1055C26.7852 30.7037 27.0615 30.3914 27.4193 30.1685C27.7803 29.9424 28.2088 29.8294 28.7048 29.8294C29.2134 29.8294 29.6466 29.944 30.0045 30.1732C30.3655 30.3992 30.6402 30.7147 30.8285 31.1197C31.02 31.5215 31.1158 31.9845 31.1158 32.5088C31.1158 33.0424 31.02 33.5118 30.8285 33.9167C30.6371 34.3185 30.3608 34.6325 29.9998 34.8585C29.6388 35.0845 29.2071 35.1975 28.7048 35.1975ZM28.7048 34.5336C29.2699 34.5336 29.6906 34.3468 29.9668 33.9732C30.2431 33.5965 30.3812 33.1084 30.3812 32.5088C30.3812 31.8935 30.2415 31.4038 29.9621 31.0396C29.6859 30.6755 29.2668 30.4934 28.7048 30.4934C28.325 30.4934 28.0111 30.5797 27.7631 30.7524C27.5182 30.9219 27.3346 31.1589 27.2121 31.4634C27.0928 31.7648 27.0332 32.1132 27.0332 32.5088C27.0332 33.1209 27.1745 33.6122 27.457 33.9827C27.7395 34.3499 28.1555 34.5336 28.7048 34.5336Z" fill="#8A8A8A"/>
                      <path d="M31.7778 36.1864V34.463C32.0666 34.463 32.2738 34.3703 32.3994 34.1851C32.525 33.9968 32.627 33.697 32.7055 33.2857C32.7588 33.0189 32.8028 32.7317 32.8373 32.424C32.8718 32.1164 32.9017 31.7648 32.9268 31.3692C32.9519 30.9705 32.9754 30.5044 32.9974 29.9707H36.3595V34.463H36.8493V36.1864H36.1806V35.0563H32.4418V36.1864H31.7778ZM32.9503 34.463H35.6721V30.564H33.6378C33.6284 30.8026 33.6143 31.0553 33.5954 31.3221C33.5797 31.589 33.5593 31.8558 33.5342 32.1227C33.5122 32.3895 33.4856 32.6406 33.4542 32.8761C33.4259 33.1084 33.3914 33.3124 33.3506 33.4882C33.3035 33.7142 33.2517 33.9073 33.1952 34.0674C33.1418 34.2275 33.0602 34.3594 32.9503 34.463Z" fill="#8A8A8A"/>
                      <path d="M39.9019 35.1975C39.3902 35.1975 38.9569 35.083 38.6022 34.8538C38.2475 34.6246 37.9775 34.3091 37.7923 33.9073C37.6102 33.5023 37.516 33.0377 37.5098 32.5135C37.516 31.9798 37.6133 31.5121 37.8017 31.1102C37.9901 30.7053 38.2616 30.3914 38.6163 30.1685C38.9711 29.9424 39.4011 29.8294 39.9066 29.8294C40.4214 29.8294 40.8687 29.955 41.2486 30.2061C41.6316 30.4573 41.8937 30.801 42.035 31.2374L41.3569 31.454C41.2376 31.1495 41.0477 30.914 40.7871 30.7477C40.5297 30.5781 40.2346 30.4934 39.9019 30.4934C39.5283 30.4934 39.2191 30.5797 38.9742 30.7524C38.7293 30.9219 38.5473 31.1589 38.428 31.4634C38.3087 31.7679 38.2475 32.1179 38.2443 32.5135C38.2506 33.1225 38.3919 33.6122 38.6681 33.9827C38.9444 34.3499 39.3556 34.5336 39.9019 34.5336C40.2472 34.5336 40.5407 34.4551 40.7824 34.2981C41.0273 34.138 41.2125 33.9057 41.3381 33.6012L42.035 33.8084C41.8466 34.2605 41.5704 34.6058 41.2062 34.8444C40.8421 35.0798 40.4073 35.1975 39.9019 35.1975Z" fill="#8A8A8A"/>
                      <path d="M44.2671 35.0563V30.6111H42.4636V29.9707H46.7628V30.6111H44.9593V35.0563H44.2671Z" fill="#8A8A8A"/>
                      <path d="M47.656 35.0563V29.9707H49.7514C49.8581 29.9707 49.9868 29.977 50.1375 29.9895C50.2913 30.0021 50.4342 30.0256 50.566 30.0602C50.8517 30.1355 51.0809 30.2893 51.2535 30.5216C51.4293 30.7539 51.5172 31.0333 51.5172 31.3598C51.5172 31.5419 51.489 31.7051 51.4325 31.8495C51.3791 31.9908 51.3022 32.1132 51.2017 32.2168C51.1546 32.2702 51.1028 32.3173 51.0463 32.3581C50.9898 32.3958 50.9349 32.4272 50.8815 32.4523C50.982 32.4711 51.0903 32.5151 51.2064 32.5841C51.3885 32.6909 51.5266 32.8353 51.6208 33.0173C51.715 33.1963 51.7621 33.4144 51.7621 33.6719C51.7621 34.0203 51.6789 34.3044 51.5125 34.5242C51.3461 34.7439 51.1232 34.8946 50.8438 34.9762C50.7183 35.0107 50.5817 35.0327 50.4342 35.0421C50.2898 35.0516 50.1532 35.0563 50.0245 35.0563H47.656ZM48.3529 34.4677H49.9915C50.0575 34.4677 50.1407 34.463 50.2411 34.4535C50.3416 34.441 50.431 34.4253 50.5095 34.4064C50.6947 34.3594 50.8297 34.2652 50.9145 34.1239C51.0024 33.9795 51.0463 33.8225 51.0463 33.653C51.0463 33.4301 50.9804 33.2481 50.8486 33.1068C50.7199 32.9624 50.5472 32.8745 50.3306 32.8431C50.2584 32.8274 50.183 32.818 50.1046 32.8149C50.0261 32.8117 49.9554 32.8101 49.8927 32.8101H48.3529V34.4677ZM48.3529 32.2168H49.7749C49.8566 32.2168 49.9476 32.2121 50.0481 32.2027C50.1516 32.1901 50.2411 32.1697 50.3165 32.1415C50.4797 32.085 50.599 31.9877 50.6743 31.8495C50.7528 31.7114 50.7921 31.5607 50.7921 31.3975C50.7921 31.2185 50.7497 31.0616 50.6649 30.9266C50.5833 30.7916 50.4593 30.6974 50.2929 30.6441C50.1799 30.6033 50.0575 30.5797 49.9256 30.5734C49.7969 30.5672 49.7153 30.564 49.6808 30.564H48.3529V32.2168Z" fill="#8A8A8A"/>
                      <path d="M54.8243 35.1975C54.3189 35.1975 53.8872 35.083 53.5294 34.8538C53.1715 34.6246 52.8968 34.3076 52.7053 33.9026C52.5138 33.4976 52.4181 33.033 52.4181 32.5088C52.4181 31.9751 52.5154 31.5074 52.71 31.1055C52.9047 30.7037 53.1809 30.3914 53.5388 30.1685C53.8998 29.9424 54.3283 29.8294 54.8243 29.8294C55.3329 29.8294 55.7661 29.944 56.124 30.1732C56.485 30.3992 56.7597 30.7147 56.948 31.1197C57.1395 31.5215 57.2352 31.9845 57.2352 32.5088C57.2352 33.0424 57.1395 33.5118 56.948 33.9167C56.7565 34.3185 56.4803 34.6325 56.1192 34.8585C55.7582 35.0845 55.3266 35.1975 54.8243 35.1975ZM54.8243 34.5336C55.3894 34.5336 55.81 34.3468 56.0863 33.9732C56.3625 33.5965 56.5007 33.1084 56.5007 32.5088C56.5007 31.8935 56.361 31.4038 56.0816 31.0396C55.8053 30.6755 55.3862 30.4934 54.8243 30.4934C54.4445 30.4934 54.1305 30.5797 53.8825 30.7524C53.6377 30.9219 53.454 31.1589 53.3316 31.4634C53.2123 31.7648 53.1527 32.1132 53.1527 32.5088C53.1527 33.1209 53.2939 33.6122 53.5765 33.9827C53.859 34.3499 54.2749 34.5336 54.8243 34.5336Z" fill="#8A8A8A"/>
                    </svg>
                </a>
                
       
            	    
    	    <div class="hb_r">
    		    <div class="h_contacts">
    		        <a class=\'h_tel\' href="tel:+7 (343) 375-48-41">+7 (343) 375-48-41</a>
    		        <div class="h_mail">
        			    <a href="mailto:lp@lpubm.ru">lp@lpubm.ru</a>
                    </div>
                    <div class = "request-call-btn" data-request-call>Заказать звонок</div>
    		    </div>
    		    
    		    <div class="top-menu">
    		        <ul class=""><li><a  class="first active" href="produkcziya/" >Продукция</a></li><li><a  href="o-kompanii/" >О компании</a></li><li><a  href="novosti/" >Новости</a></li><li><a  class="last" href="contacts/" >Контакты</a></li></ul>
                    <div class="drop-down-menu">
            	        <div class="drop-down-menu-col drop-down-menu-nav">
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Литье по выплавляемым моделям</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	   </div>
            	        <div class="drop-down-menu-col">
            	                <a href="" class="go-to">
                            	    <div class="arrow-gold-right-45">
                            			<svg xmlns="http://www.w3.org/2000/svg" width="33" height="33" viewBox="0 0 33 33" fill="none">
                                          <path d="M33 3C33 1.34315 31.6569 0 30 0H3C1.34315 0 0 1.34315 0 3C0 4.65685 1.34315 6 3 6H27V30C27 31.6569 28.3431 33 30 33C31.6569 33 33 31.6569 33 30V3ZM8.12132 29.1213L32.1213 5.12132L27.8787 0.87868L3.87868 24.8787L8.12132 29.1213Z" fill="#535353"/>
                                        </svg>
                            		</div>
                            	    <span class="go-to-text">смотреть всю&nbsp;прдукцию</span>
                            	</a>
            	  </div>
            	    </div>
    		    </div>
    	</div>
    	     <div class="burger-menu" data-burger-menu>
                <span class="burger-item burger-1"></span>
                <span class="burger-item burger-2"></span>
                <span class="burger-item burger-3"></span>
            </div>
    </div>
    
       
	</div>
</div>



<div class="modal-request-acall">
    <div class="modal-dialog shadow-lg  mb-5 bg-white rounded">
        <div class="modal-content sub-bg">
            <div class="modal-header subs-header">
                <div class="modal-title-wrapper">
                    <div class=\'modal-title\'>Заказать звонок</div>
                    <div class=\'modal-subtitle\'>Наш менеджер свяжется с вами и проконсультирует</div>
                </div>
                    				    	    
                <button type="button" class="close" data-dismiss="modal" aria-hidden="true"> 
                    <svg xmlns="http://www.w3.org/2000/svg" width="26" height="26" viewBox="0 0 26 26" fill="none">
                        <path d="M1 1L25 25" stroke="white"/>
                        <path d="M25 1L1 25" stroke="white"/>
                    </svg>
                </button>
                    						     <!--<h4 class="modal-title"> Производство наплавочных прутков</h4>-->
            </div>
            <div class="modal-body">
                [[!AjaxForm?
                    &snippet=`FormIt`
                    &form=`Order_form`
                    &hooks=`email`
                    &emailSubject=`Сообщение с сайта lpubm.na4u.ru `
                    &emailTo=`lp@lpubm.ru`
                    &emailTpl=`tpl.contact_form`
                    &validate=`name:required,email:required,message:required`
                    &validationErrorMessage=`В форме содержатся ошибки!`
                    &successMessage=`Ваше сообщение отправлено!
                    Наши специалисты свяжутся с вами в ближайшее время.`
                ]]
            </div>
        </div>
    </div>
</div>






  




',
    '[[pdoCrumbs?
				    &showHome=`1`
                	&tplWrapper=`@INLINE <div class="bread">[[+output]]</div>`
                	&tplCurrent=`@INLINE   [[+menutitle]]`
                	&tpl=`@INLINE <a href="[[+link]]">[[+menutitle]]/</a>`
                ]]' => '<div class="bread"><a href="/">Главная/</a>
<a href="produkcziya/">Продукция/</a>
Производство наплавочных прутков</div>',
    '[[$Crumbs]]' => '				<div class="bread"><a href="/">Главная/</a>
<a href="produkcziya/">Продукция/</a>
Производство наплавочных прутков</div>',
    '[[pdoMenu?
                    &tpl=`@INLINE <li[[+classes]]><a [[+classes]] href="[[+link]]" [[+attributes]]>[[+menutitle]]</a>[[+wrapper]]</li>`
                    &parents=`0`
                ]]' => '<ul class=""><li class="first active"><a  class="first active" href="produkcziya/" >Продукция</a></li><li><a  href="o-kompanii/" >О компании</a></li><li><a  href="novosti/" >Новости</a></li><li class="last"><a  class="last" href="contacts/" >Контакты</a></li></ul>',
    '[[$Footer]]' => '<div class="footer inner-min">
	<div class=" main-footer">
		<div class="fb_l">
			<div class="f-contacts">
				<div class="f-tel">
				    <a href="tel:+7 (343) 375-48-41">+7 (343) 375-48-41</a>
				</div>
				 <div class="f-mail">
					<a href="mailto:lp@lpubm.ru">lp@lpubm.ru</a>
                    <a href="mailto:snab@lpubm.ru">snab@lpubm.ru</a>
                </div>
			</div>
		</div>
		
		<div class="fb_r">
			<div class="footer-address">
				623070, Свердловская обл., Нижнесергиенский р-н, р.п. Верхние Серги, ул. Володарского 10
			</div>
			<a class="footer-in-map go-to" href="https://yandex.ru/maps/?um=constructor%3A0bd4c9a8cc4042947d03f8a6f60ca34712418f38da43f8fd81ec80519b519838&source=constructorLink" >
			    <div class=\'arrow-gold-right-45\'>
			        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 34 33" fill="none">
                      <path d="M33.5 3C33.5 1.34315 32.1569 0 30.5 0L3.5 0C1.84315 0 0.5 1.34315 0.5 3C0.5 4.65685 1.84315 6 3.5 6L27.5 6L27.5 30C27.5 31.6569 28.8431 33 30.5 33C32.1569 33 33.5 31.6569 33.5 30V3ZM8.12132 29.6213L32.6213 5.12132L28.3787 0.87868L3.87868 25.3787L8.12132 29.6213Z" fill="#F0A73C"/>
                    </svg>
			    </div>
			    <span class=\'footer-in-map-text\'>мы на карте</span>
			</a>
	</div>
	</div>

	<div class=" bottom-line">
		<div class="bottom-line-inner">
		    <div class="bottom-menu">
				<ul class=""><li class="first active"><a  class="first active" href="produkcziya/" >Продукция</a></li><li><a  href="o-kompanii/" >О компании</a></li><li><a  href="novosti/" >Новости</a></li><li class="last"><a  class="last" href="contacts/" >Контакты</a></li></ul>
			</div>
			<div class="privacy-policy-wrapper">
			    <div class="copy">
				    <div class="uss-site-copyright">©&nbsp;2009 - 2023 Литейное производство УБМ</div>						
			    </div>
			    <div class="privacy-block">
				    <a  href="politika-konfidenczialnosti/">Политика конфиденциальности</a>
			    </div>
			</div>
			
			
		</div>
	</div>
</div>





			       

		
 
			   
			       
',
  ),
  'sourceCache' => 
  array (
    'modChunk' => 
    array (
      'HeadProd' => 
      array (
        'fields' => 
        array (
          'id' => 116,
          'source' => 0,
          'property_preprocess' => false,
          'name' => 'HeadProd',
          'description' => '',
          'editor_type' => 0,
          'category' => 29,
          'cache_type' => 0,
          'snippet' => '<head>
	<base href="[[++site_url]]" />
	<meta name="robots" content="[[+metax.robots]]" />
	<link rel="canonical" href="[[+metax.canonical]]" />
		<meta http-equiv="Content-Type" content="text/html; charset=windows-1251" />
	<meta charset="[[++modx_charset]]" />
	<meta name="viewport" content="width=device-width, initial-scale=1" />
    <title itemprop="name">[[*longtitle:ifempty=`[[*pagetitle]]`]]</title>
	[[*description:notempty=`<meta name="description" itemprop="description" content="[[*description:strip]]" />`]]
	[[*longtitle:notempty=`<meta name="abstract" content="[[*longtitle:replace=`<br />== `:replace=`<br>== `:striptags]]" />`]]
	[[+metax.favicon:notempty=`<link rel="shortcut icon" type="image/x-icon" href="[[+metax.favicon]]" />`]]
	[[+metax.mobile:notempty=`<link rel="apple-touch-icon" href="[[+metax.mobile]]" />`]]
    <link rel="shortcut icon" href="/favicon.png" type="image/png" />
    <meta name="copyright" content="Copyright (c) [[+metax.copyyears]] by [[++site_name]]">
    <link rel="schema.DC" href="http://purl.org/dc/elements/1.1/">
    <meta name="DC.contributor" content="[[++site_name]]">
    <meta name="DC.creator" content="[[+metax.editedby]]">
    <meta name="DC.date" content="[[*editedon:strtotime:date=`%Y-%m-%d`]]">
    <meta name="DC.format" content="[[*contentType:lcase]]">
    <meta name="DC.identifier" content="[[*pagetitle]] - [[*id]]">
    <meta name="DC.language" content="[[++cultureKey:ifempty=`en`]]">
    <meta name="DC.publisher" content="[[++site_name]]">
    <meta name="DC.rights" content="Copyright (c) [[+metax.copyyears]] by [[++site_name]]">
    <meta name="DC.rightsHolder" content="[[++site_name]]">
    <meta name="DC.title" content="[[*pagetitle]]">

    <link href="/assets/ubm/css/uss-style-8.1.0.min.css" rel="stylesheet" type="text/css" />
    <link href="/assets/ubm/css/style-d=1578909180.css" rel="stylesheet" type="text/css" />
    <script src="/assets/ubm/js/jquery-1.9.1.min.js" type="text/javascript"></script>
    <script src="/assets/ubm/js/jquery.formstyler.min.js" type="text/javascript"></script>
    <link rel="preload" href="/assets/ubm/js/jquery.form.min.js" as="script"/>
    <link rel="preload" href="/assets/ubm/js/jquery.autocomplete.min.js" as="script"/>
    <link rel="preload" href="/assets/ubm/js/uss-script-8.1.0.min.js" as="script"/>
	[[--<link rel="stylesheet" href="/assets/ubm/js/owl/owl.carousel.min.css" />--]]
	<link rel="stylesheet" href="/assets/ubm/css/swiper-bundle.min.css" />


<link rel="stylesheet"
href="https://cdn.jsdelivr.net/gh/fancyapps/fancybox@3.5.7/dist/jquery.fancybox.min.css"
/>
</head>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<head>
	<base href="[[++site_url]]" />
	<meta name="robots" content="[[+metax.robots]]" />
	<link rel="canonical" href="[[+metax.canonical]]" />
		<meta http-equiv="Content-Type" content="text/html; charset=windows-1251" />
	<meta charset="[[++modx_charset]]" />
	<meta name="viewport" content="width=device-width, initial-scale=1" />
    <title itemprop="name">[[*longtitle:ifempty=`[[*pagetitle]]`]]</title>
	[[*description:notempty=`<meta name="description" itemprop="description" content="[[*description:strip]]" />`]]
	[[*longtitle:notempty=`<meta name="abstract" content="[[*longtitle:replace=`<br />== `:replace=`<br>== `:striptags]]" />`]]
	[[+metax.favicon:notempty=`<link rel="shortcut icon" type="image/x-icon" href="[[+metax.favicon]]" />`]]
	[[+metax.mobile:notempty=`<link rel="apple-touch-icon" href="[[+metax.mobile]]" />`]]
    <link rel="shortcut icon" href="/favicon.png" type="image/png" />
    <meta name="copyright" content="Copyright (c) [[+metax.copyyears]] by [[++site_name]]">
    <link rel="schema.DC" href="http://purl.org/dc/elements/1.1/">
    <meta name="DC.contributor" content="[[++site_name]]">
    <meta name="DC.creator" content="[[+metax.editedby]]">
    <meta name="DC.date" content="[[*editedon:strtotime:date=`%Y-%m-%d`]]">
    <meta name="DC.format" content="[[*contentType:lcase]]">
    <meta name="DC.identifier" content="[[*pagetitle]] - [[*id]]">
    <meta name="DC.language" content="[[++cultureKey:ifempty=`en`]]">
    <meta name="DC.publisher" content="[[++site_name]]">
    <meta name="DC.rights" content="Copyright (c) [[+metax.copyyears]] by [[++site_name]]">
    <meta name="DC.rightsHolder" content="[[++site_name]]">
    <meta name="DC.title" content="[[*pagetitle]]">

    <link href="/assets/ubm/css/uss-style-8.1.0.min.css" rel="stylesheet" type="text/css" />
    <link href="/assets/ubm/css/style-d=1578909180.css" rel="stylesheet" type="text/css" />
    <script src="/assets/ubm/js/jquery-1.9.1.min.js" type="text/javascript"></script>
    <script src="/assets/ubm/js/jquery.formstyler.min.js" type="text/javascript"></script>
    <link rel="preload" href="/assets/ubm/js/jquery.form.min.js" as="script"/>
    <link rel="preload" href="/assets/ubm/js/jquery.autocomplete.min.js" as="script"/>
    <link rel="preload" href="/assets/ubm/js/uss-script-8.1.0.min.js" as="script"/>
	[[--<link rel="stylesheet" href="/assets/ubm/js/owl/owl.carousel.min.css" />--]]
	<link rel="stylesheet" href="/assets/ubm/css/swiper-bundle.min.css" />


<link rel="stylesheet"
href="https://cdn.jsdelivr.net/gh/fancyapps/fancybox@3.5.7/dist/jquery.fancybox.min.css"
/>
</head>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
        ),
      ),
      'Header' => 
      array (
        'fields' => 
        array (
          'id' => 15,
          'source' => 0,
          'property_preprocess' => false,
          'name' => 'Header',
          'description' => 'Чанк для шапки сайта',
          'editor_type' => 0,
          'category' => 29,
          'cache_type' => 0,
          'snippet' => '<!-- Yandex.Metrika counter -->
<script type="text/javascript" >
   (function(m,e,t,r,i,k,a){m[i]=m[i]||function(){(m[i].a=m[i].a||[]).push(arguments)};
   m[i].l=1*new Date();
   for (var j = 0; j < document.scripts.length; j++) {if (document.scripts[j].src === r) { return; }}
   k=e.createElement(t),a=e.getElementsByTagName(t)[0],k.async=1,k.src=r,a.parentNode.insertBefore(k,a)})
   (window, document, "script", "https://mc.yandex.ru/metrika/tag.js", "ym");
   ym(92489463, "init", {
        clickmap:true,
        trackLinks:true,
        accurateTrackBounce:true
   });
</script>
<noscript><div><img src="https://mc.yandex.ru/watch/92489463" style="position:absolute; left:-9999px;" alt="" /></div></noscript>
<!-- /Yandex.Metrika counter -->

<script src="//code.jivo.ru/widget/VTHqXXTq3m" async></script>

<div class="header">
	<div class="inner-min mobile-menu">
    	<div class=" main-header">
    		<a href="/" class="hb_l header-logo-pc">
                <div class="header-logo">ЛП УБМ</div>
                <div class="logo_sitename"> [[++site_name]]  </div>
    	    </a>
        	<a href="/" class="header-logo-mobile">
        	        <svg xmlns="http://www.w3.org/2000/svg" width="61" height="37" viewBox="0 0 61 37" fill="none">
                      <path d="M0.141266 11.8663V10.3913C0.421443 10.4187 0.652177 10.405 0.833468 10.3501C1.02025 10.2896 1.17682 10.1743 1.30318 10.004C1.42953 9.82818 1.53666 9.57547 1.62456 9.24585C1.71795 8.91623 1.8086 8.49047 1.89649 7.96857C2.01735 7.30384 2.11899 6.61987 2.20139 5.91668C2.2838 5.21349 2.35247 4.5158 2.40741 3.82359C2.46784 3.1259 2.51728 2.45292 2.55573 1.80467C2.59419 1.15642 2.6244 0.55486 2.64638 0H10.4337V11.8663H8.71139V1.62338H4.26152C4.23405 2.06287 4.20109 2.55456 4.16263 3.09843C4.12418 3.6423 4.07748 4.21914 4.02254 4.82894C3.96761 5.43873 3.89894 6.06776 3.81653 6.71601C3.73962 7.36427 3.64073 8.01527 3.51987 8.66901C3.42099 9.22937 3.30013 9.73478 3.15729 10.1853C3.01446 10.6357 2.82218 11.0121 2.58046 11.3142C2.33873 11.6109 2.02285 11.8086 1.6328 11.9075C1.24275 12.0119 0.74557 11.9982 0.141266 11.8663Z" fill="white"/>
                      <path d="M12.7467 11.8663V0H22.182V11.8663H20.4598V1.62338H14.4689V11.8663H12.7467Z" fill="white"/>
                      <path d="M29.501 11.8663L31.0008 8.79262L26.8641 0H28.8006L31.899 6.96323L35.0799 0H36.9175L31.3634 11.8663H29.501Z" fill="white"/>
                      <path d="M38.2085 11.8663V0H45.9464V1.62338H39.9308V4.48284H43.0045C43.1144 4.48284 43.2545 4.48833 43.4248 4.49932C43.6006 4.50481 43.7654 4.51854 43.9192 4.54052C44.562 4.61743 45.1031 4.82619 45.5426 5.1668C45.9876 5.50741 46.3227 5.93866 46.5479 6.46056C46.7787 6.98246 46.894 7.5538 46.894 8.17458C46.894 8.79537 46.7814 9.36671 46.5562 9.88861C46.3309 10.4105 45.9958 10.8418 45.5508 11.1824C45.1113 11.523 44.5675 11.7317 43.9192 11.8086C43.7654 11.8306 43.6033 11.8471 43.433 11.8581C43.2627 11.8636 43.1199 11.8663 43.0045 11.8663H38.2085ZM39.9308 10.2429H42.9386C43.0485 10.2429 43.1693 10.2375 43.3012 10.2265C43.4385 10.2155 43.5676 10.199 43.6885 10.177C44.2214 10.0672 44.5949 9.81444 44.8092 9.4189C45.0289 9.02335 45.1388 8.60858 45.1388 8.17458C45.1388 7.73509 45.0289 7.32032 44.8092 6.93027C44.5949 6.53472 44.2214 6.28201 43.6885 6.17214C43.5676 6.14467 43.4385 6.12819 43.3012 6.1227C43.1693 6.11171 43.0485 6.10622 42.9386 6.10622H39.9308V10.2429Z" fill="white"/>
                      <path d="M48.5414 11.8663V0H50.0988L54.4004 8.92447L58.6772 0H60.2511V11.8581H58.6195V3.74119L54.7877 11.8663H54.0048L50.1647 3.74119V11.8663H48.5414Z" fill="white"/>
                      <path d="M0 25.0563V24.4394C0.172658 24.4551 0.315494 24.4488 0.428506 24.4206C0.541519 24.3892 0.632557 24.3201 0.70162 24.2134C0.773823 24.1067 0.836608 23.9481 0.889975 23.7378C0.943342 23.5243 0.996709 23.2465 1.05008 22.9043C1.10972 22.5339 1.15995 22.165 1.20076 21.7977C1.24471 21.4304 1.28238 21.0584 1.31377 20.6817C1.3483 20.3019 1.37656 19.9126 1.39853 19.5139C1.42051 19.1153 1.44091 18.7024 1.45975 18.2755H5.7401V25.0563H5.0479V18.9395H2.12841C2.10643 19.2628 2.08446 19.594 2.06248 19.933C2.04365 20.2721 2.01853 20.619 1.98714 20.9737C1.95889 21.3284 1.92278 21.6941 1.87884 22.0709C1.83803 22.4444 1.78623 22.8305 1.72344 23.2292C1.67322 23.5306 1.61357 23.81 1.54451 24.0674C1.47858 24.3248 1.38441 24.5414 1.26197 24.7172C1.14268 24.893 0.981013 25.0139 0.776962 25.0798C0.576051 25.1457 0.317063 25.1379 0 25.0563Z" fill="#8A8A8A"/>
                      <path d="M11.0961 19.9707V25.0563H10.4228V21.0961L7.63512 25.0563H7.05123V19.9707H7.72459V23.8979L10.5169 19.9707H11.0961Z" fill="#8A8A8A"/>
                      <path d="M13.7975 25.0563V20.6111H11.994V19.9707H16.2932V20.6111H14.4897V25.0563H13.7975Z" fill="#8A8A8A"/>
                      <path d="M19.343 25.1975C18.847 25.1975 18.4169 25.0877 18.0527 24.8679C17.6917 24.6482 17.4108 24.339 17.2099 23.9403C17.0089 23.5416 16.9085 23.0738 16.9085 22.537C16.9085 21.9814 17.0074 21.5011 17.2051 21.0961C17.4029 20.6912 17.6807 20.3788 18.0386 20.1591C18.3996 19.9393 18.825 19.8294 19.3147 19.8294C19.817 19.8294 20.2455 19.9456 20.6002 20.1779C20.955 20.4071 21.2234 20.7367 21.4055 21.1668C21.5875 21.5968 21.6707 22.1101 21.655 22.7065H20.9487V22.4617C20.9361 21.8024 20.7933 21.3049 20.5202 20.969C20.2502 20.6331 19.8547 20.4651 19.3336 20.4651C18.7873 20.4651 18.3682 20.6425 18.0763 20.9972C17.7875 21.352 17.6431 21.8574 17.6431 22.5135C17.6431 23.1539 17.7875 23.6515 18.0763 24.0062C18.3682 24.3578 18.781 24.5336 19.3147 24.5336C19.6789 24.5336 19.9959 24.4504 20.2659 24.284C20.539 24.1145 20.7541 23.8712 20.911 23.5541L21.5561 23.8037C21.3552 24.2463 21.0586 24.5901 20.6662 24.835C20.2769 25.0767 19.8358 25.1975 19.343 25.1975ZM17.3982 22.7065V22.1274H21.283V22.7065H17.3982Z" fill="#8A8A8A"/>
                      <path d="M24.8096 19.368C24.5867 19.368 24.3827 19.313 24.1974 19.2032C24.0122 19.0933 23.8647 18.9473 23.7548 18.7652C23.6481 18.58 23.5947 18.376 23.5947 18.1531H24.1692C24.1692 18.3289 24.232 18.4796 24.3575 18.6051C24.4831 18.7307 24.6338 18.7935 24.8096 18.7935C24.9885 18.7935 25.1392 18.7307 25.2616 18.6051C25.3872 18.4796 25.45 18.3289 25.45 18.1531H26.0245C26.0245 18.376 25.9695 18.58 25.8597 18.7652C25.7529 18.9473 25.607 19.0933 25.4217 19.2032C25.2365 19.313 25.0325 19.368 24.8096 19.368ZM26.7402 19.9707V25.0563H26.0669V21.0961L23.2792 25.0563H22.6953V19.9707H23.3687V23.8979L26.161 19.9707H26.7402Z" fill="#8A8A8A"/>
                      <path d="M28.0572 25.0563V19.9707H28.7494V22.1792H31.6171V19.9707H32.3093V25.0563H31.6171V22.8431H28.7494V25.0563H28.0572Z" fill="#8A8A8A"/>
                      <path d="M35.7497 25.1975C35.2443 25.1975 34.8127 25.083 34.4548 24.8538C34.0969 24.6246 33.8223 24.3076 33.6308 23.9026C33.4393 23.4976 33.3435 23.033 33.3435 22.5088C33.3435 21.9751 33.4408 21.5074 33.6355 21.1055C33.8301 20.7037 34.1064 20.3914 34.4642 20.1685C34.8252 19.9424 35.2537 19.8294 35.7497 19.8294C36.2583 19.8294 36.6915 19.944 37.0494 20.1732C37.4104 20.3992 37.6851 20.7147 37.8734 21.1197C38.0649 21.5215 38.1607 21.9845 38.1607 22.5088C38.1607 23.0424 38.0649 23.5118 37.8734 23.9167C37.6819 24.3186 37.4057 24.6325 37.0447 24.8585C36.6837 25.0845 36.252 25.1975 35.7497 25.1975ZM35.7497 24.5336C36.3148 24.5336 36.7355 24.3468 37.0117 23.9732C37.288 23.5965 37.4261 23.1084 37.4261 22.5088C37.4261 21.8935 37.2864 21.4038 37.007 21.0396C36.7308 20.6755 36.3117 20.4934 35.7497 20.4934C35.3699 20.4934 35.056 20.5797 34.808 20.7524C34.5631 20.9219 34.3795 21.1589 34.257 21.4634C34.1377 21.7648 34.0781 22.1132 34.0781 22.5088C34.0781 23.1209 34.2194 23.6122 34.5019 23.9827C34.7844 24.3499 35.2004 24.5336 35.7497 24.5336Z" fill="#8A8A8A"/>
                      <path d="M41.3514 25.1975C40.8554 25.1975 40.4253 25.0877 40.0611 24.8679C39.7001 24.6482 39.4192 24.339 39.2183 23.9403C39.0174 23.5416 38.9169 23.0738 38.9169 22.537C38.9169 21.9814 39.0158 21.5011 39.2136 21.0961C39.4113 20.6912 39.6892 20.3788 40.047 20.1591C40.408 19.9393 40.8334 19.8294 41.3231 19.8294C41.8254 19.8294 42.2539 19.9456 42.6086 20.1779C42.9634 20.4071 43.2318 20.7367 43.4139 21.1668C43.5959 21.5968 43.6791 22.1101 43.6634 22.7065H42.9571V22.4617C42.9445 21.8024 42.8017 21.3049 42.5286 20.969C42.2586 20.6331 41.8631 20.4651 41.342 20.4651C40.7957 20.4651 40.3766 20.6425 40.0847 20.9972C39.7959 21.352 39.6515 21.8574 39.6515 22.5135C39.6515 23.1539 39.7959 23.6515 40.0847 24.0062C40.3766 24.3578 40.7895 24.5336 41.3231 24.5336C41.6873 24.5336 42.0043 24.4504 42.2743 24.284C42.5474 24.1145 42.7625 23.8712 42.9194 23.5541L43.5645 23.8037C43.3636 24.2463 43.067 24.5901 42.6746 24.835C42.2853 25.0767 41.8442 25.1975 41.3514 25.1975ZM39.4066 22.7065V22.1274H43.2914V22.7065H39.4066Z" fill="#8A8A8A"/>
                      <path d="M0.466177 35.0563V29.9707H4.51109V35.0563H3.81889V30.6346H1.15838V35.0563H0.466177Z" fill="#8A8A8A"/>
                      <path d="M7.95643 35.1975C7.45101 35.1975 7.01937 35.083 6.66149 34.8538C6.30362 34.6246 6.02894 34.3076 5.83744 33.9026C5.64595 33.4976 5.5502 33.033 5.5502 32.5088C5.5502 31.9751 5.64752 31.5074 5.84215 31.1055C6.03678 30.7037 6.31304 30.3914 6.67091 30.1685C7.03192 29.9424 7.46043 29.8294 7.95643 29.8294C8.46499 29.8294 8.8982 29.944 9.25608 30.1732C9.61709 30.3992 9.89177 30.7147 10.0801 31.1197C10.2716 31.5215 10.3674 31.9845 10.3674 32.5088C10.3674 33.0424 10.2716 33.5118 10.0801 33.9167C9.88863 34.3185 9.61238 34.6325 9.25137 34.8585C8.89035 35.0845 8.45871 35.1975 7.95643 35.1975ZM7.95643 34.5336C8.52149 34.5336 8.94215 34.3468 9.2184 33.9732C9.49466 33.5965 9.63278 33.1084 9.63278 32.5088C9.63278 31.8935 9.49309 31.4038 9.2137 31.0396C8.93744 30.6755 8.51835 30.4934 7.95643 30.4934C7.57658 30.4934 7.26266 30.5797 7.01466 30.7524C6.7698 30.9219 6.58615 31.1589 6.46372 31.4634C6.34443 31.7648 6.28478 32.1132 6.28478 32.5088C6.28478 33.1209 6.42605 33.6122 6.70858 33.9827C6.99111 34.3499 7.40706 34.5336 7.95643 34.5336Z" fill="#8A8A8A"/>
                      <path d="M15.4463 29.9707V35.0563H14.7729V31.0961L11.9853 35.0563H11.4014V29.9707H12.0748V33.8979L14.8671 29.9707H15.4463Z" fill="#8A8A8A"/>
                      <path d="M18.5997 35.1975C18.088 35.1975 17.6407 35.0861 17.2577 34.8632C16.8778 34.6372 16.578 34.3248 16.3583 33.9261L16.9139 33.573C17.0991 33.8869 17.3299 34.1255 17.6061 34.2887C17.8824 34.452 18.1995 34.5336 18.5573 34.5336C18.9309 34.5336 19.2307 34.4473 19.4567 34.2746C19.6827 34.1019 19.7958 33.8649 19.7958 33.5636C19.7958 33.3564 19.7471 33.1916 19.6498 33.0691C19.5556 32.9467 19.4112 32.8588 19.2166 32.8054C19.0251 32.7521 18.7849 32.7254 18.4961 32.7254H17.8934V32.1321H18.4867C18.8383 32.1321 19.1208 32.0693 19.3343 31.9437C19.5509 31.815 19.6592 31.6141 19.6592 31.341C19.6592 31.0522 19.5509 30.8387 19.3343 30.7006C19.1208 30.5593 18.865 30.4887 18.5667 30.4887C18.2654 30.4887 17.9797 30.5515 17.7097 30.677C17.4429 30.7995 17.2184 30.958 17.0364 31.1526L16.5937 30.6864C16.848 30.4071 17.1447 30.1952 17.4837 30.0508C17.8259 29.9032 18.2042 29.8294 18.6185 29.8294C18.945 29.8294 19.2401 29.8875 19.5038 30.0037C19.7706 30.1167 19.981 30.2831 20.1348 30.5028C20.2918 30.7225 20.3702 30.9862 20.3702 31.2939C20.3702 31.5827 20.2996 31.8323 20.1583 32.0426C20.0202 32.2529 19.824 32.4272 19.5697 32.5653L19.5321 32.3063C19.7518 32.3471 19.9339 32.435 20.0783 32.57C20.2227 32.705 20.3294 32.8666 20.3985 33.055C20.4676 33.2434 20.5021 33.4349 20.5021 33.6295C20.5021 33.9528 20.4173 34.2322 20.2478 34.4677C20.0814 34.7 19.8538 34.8805 19.565 35.0092C19.2794 35.1348 18.9576 35.1975 18.5997 35.1975Z" fill="#8A8A8A"/>
                      <path d="M21.5365 35.0563V29.9707H23.6319C23.7387 29.9707 23.8674 29.977 24.0181 29.9895C24.1719 30.0021 24.3147 30.0256 24.4466 30.0602C24.7322 30.1355 24.9614 30.2893 25.1341 30.5216C25.3099 30.7539 25.3978 31.0333 25.3978 31.3598C25.3978 31.5419 25.3695 31.7051 25.313 31.8495C25.2596 31.9908 25.1827 32.1132 25.0823 32.2168C25.0352 32.2702 24.9834 32.3173 24.9269 32.3581C24.8704 32.3958 24.8154 32.4272 24.7621 32.4523C24.8625 32.4711 24.9708 32.5151 25.087 32.5841C25.269 32.6909 25.4072 32.8353 25.5014 33.0173C25.5955 33.1963 25.6426 33.4144 25.6426 33.6719C25.6426 34.0203 25.5594 34.3044 25.393 34.5242C25.2267 34.7439 25.0038 34.8946 24.7244 34.9762C24.5988 35.0107 24.4623 35.0327 24.3147 35.0421C24.1703 35.0516 24.0338 35.0563 23.905 35.0563H21.5365ZM22.2334 34.4677H23.8721C23.938 34.4677 24.0212 34.463 24.1217 34.4535C24.2221 34.441 24.3116 34.4253 24.3901 34.4064C24.5753 34.3594 24.7103 34.2652 24.795 34.1239C24.8829 33.9795 24.9269 33.8225 24.9269 33.653C24.9269 33.4301 24.8609 33.2481 24.7291 33.1068C24.6004 32.9624 24.4277 32.8745 24.2111 32.8431C24.1389 32.8274 24.0636 32.818 23.9851 32.8149C23.9066 32.8117 23.836 32.8101 23.7732 32.8101H22.2334V34.4677ZM22.2334 32.2168H23.6555C23.7371 32.2168 23.8281 32.2121 23.9286 32.2027C24.0322 32.1901 24.1217 32.1697 24.197 32.1415C24.3602 32.085 24.4795 31.9877 24.5549 31.8495C24.6334 31.7114 24.6726 31.5607 24.6726 31.3975C24.6726 31.2185 24.6302 31.0616 24.5455 30.9266C24.4638 30.7916 24.3398 30.6974 24.1735 30.6441C24.0604 30.6033 23.938 30.5797 23.8062 30.5734C23.6775 30.5672 23.5958 30.564 23.5613 30.564H22.2334V32.2168Z" fill="#8A8A8A"/>
                      <path d="M28.7048 35.1975C28.1994 35.1975 27.7678 35.083 27.4099 34.8538C27.052 34.6246 26.7774 34.3076 26.5859 33.9026C26.3944 33.4976 26.2986 33.033 26.2986 32.5088C26.2986 31.9751 26.3959 31.5074 26.5906 31.1055C26.7852 30.7037 27.0615 30.3914 27.4193 30.1685C27.7803 29.9424 28.2088 29.8294 28.7048 29.8294C29.2134 29.8294 29.6466 29.944 30.0045 30.1732C30.3655 30.3992 30.6402 30.7147 30.8285 31.1197C31.02 31.5215 31.1158 31.9845 31.1158 32.5088C31.1158 33.0424 31.02 33.5118 30.8285 33.9167C30.6371 34.3185 30.3608 34.6325 29.9998 34.8585C29.6388 35.0845 29.2071 35.1975 28.7048 35.1975ZM28.7048 34.5336C29.2699 34.5336 29.6906 34.3468 29.9668 33.9732C30.2431 33.5965 30.3812 33.1084 30.3812 32.5088C30.3812 31.8935 30.2415 31.4038 29.9621 31.0396C29.6859 30.6755 29.2668 30.4934 28.7048 30.4934C28.325 30.4934 28.0111 30.5797 27.7631 30.7524C27.5182 30.9219 27.3346 31.1589 27.2121 31.4634C27.0928 31.7648 27.0332 32.1132 27.0332 32.5088C27.0332 33.1209 27.1745 33.6122 27.457 33.9827C27.7395 34.3499 28.1555 34.5336 28.7048 34.5336Z" fill="#8A8A8A"/>
                      <path d="M31.7778 36.1864V34.463C32.0666 34.463 32.2738 34.3703 32.3994 34.1851C32.525 33.9968 32.627 33.697 32.7055 33.2857C32.7588 33.0189 32.8028 32.7317 32.8373 32.424C32.8718 32.1164 32.9017 31.7648 32.9268 31.3692C32.9519 30.9705 32.9754 30.5044 32.9974 29.9707H36.3595V34.463H36.8493V36.1864H36.1806V35.0563H32.4418V36.1864H31.7778ZM32.9503 34.463H35.6721V30.564H33.6378C33.6284 30.8026 33.6143 31.0553 33.5954 31.3221C33.5797 31.589 33.5593 31.8558 33.5342 32.1227C33.5122 32.3895 33.4856 32.6406 33.4542 32.8761C33.4259 33.1084 33.3914 33.3124 33.3506 33.4882C33.3035 33.7142 33.2517 33.9073 33.1952 34.0674C33.1418 34.2275 33.0602 34.3594 32.9503 34.463Z" fill="#8A8A8A"/>
                      <path d="M39.9019 35.1975C39.3902 35.1975 38.9569 35.083 38.6022 34.8538C38.2475 34.6246 37.9775 34.3091 37.7923 33.9073C37.6102 33.5023 37.516 33.0377 37.5098 32.5135C37.516 31.9798 37.6133 31.5121 37.8017 31.1102C37.9901 30.7053 38.2616 30.3914 38.6163 30.1685C38.9711 29.9424 39.4011 29.8294 39.9066 29.8294C40.4214 29.8294 40.8687 29.955 41.2486 30.2061C41.6316 30.4573 41.8937 30.801 42.035 31.2374L41.3569 31.454C41.2376 31.1495 41.0477 30.914 40.7871 30.7477C40.5297 30.5781 40.2346 30.4934 39.9019 30.4934C39.5283 30.4934 39.2191 30.5797 38.9742 30.7524C38.7293 30.9219 38.5473 31.1589 38.428 31.4634C38.3087 31.7679 38.2475 32.1179 38.2443 32.5135C38.2506 33.1225 38.3919 33.6122 38.6681 33.9827C38.9444 34.3499 39.3556 34.5336 39.9019 34.5336C40.2472 34.5336 40.5407 34.4551 40.7824 34.2981C41.0273 34.138 41.2125 33.9057 41.3381 33.6012L42.035 33.8084C41.8466 34.2605 41.5704 34.6058 41.2062 34.8444C40.8421 35.0798 40.4073 35.1975 39.9019 35.1975Z" fill="#8A8A8A"/>
                      <path d="M44.2671 35.0563V30.6111H42.4636V29.9707H46.7628V30.6111H44.9593V35.0563H44.2671Z" fill="#8A8A8A"/>
                      <path d="M47.656 35.0563V29.9707H49.7514C49.8581 29.9707 49.9868 29.977 50.1375 29.9895C50.2913 30.0021 50.4342 30.0256 50.566 30.0602C50.8517 30.1355 51.0809 30.2893 51.2535 30.5216C51.4293 30.7539 51.5172 31.0333 51.5172 31.3598C51.5172 31.5419 51.489 31.7051 51.4325 31.8495C51.3791 31.9908 51.3022 32.1132 51.2017 32.2168C51.1546 32.2702 51.1028 32.3173 51.0463 32.3581C50.9898 32.3958 50.9349 32.4272 50.8815 32.4523C50.982 32.4711 51.0903 32.5151 51.2064 32.5841C51.3885 32.6909 51.5266 32.8353 51.6208 33.0173C51.715 33.1963 51.7621 33.4144 51.7621 33.6719C51.7621 34.0203 51.6789 34.3044 51.5125 34.5242C51.3461 34.7439 51.1232 34.8946 50.8438 34.9762C50.7183 35.0107 50.5817 35.0327 50.4342 35.0421C50.2898 35.0516 50.1532 35.0563 50.0245 35.0563H47.656ZM48.3529 34.4677H49.9915C50.0575 34.4677 50.1407 34.463 50.2411 34.4535C50.3416 34.441 50.431 34.4253 50.5095 34.4064C50.6947 34.3594 50.8297 34.2652 50.9145 34.1239C51.0024 33.9795 51.0463 33.8225 51.0463 33.653C51.0463 33.4301 50.9804 33.2481 50.8486 33.1068C50.7199 32.9624 50.5472 32.8745 50.3306 32.8431C50.2584 32.8274 50.183 32.818 50.1046 32.8149C50.0261 32.8117 49.9554 32.8101 49.8927 32.8101H48.3529V34.4677ZM48.3529 32.2168H49.7749C49.8566 32.2168 49.9476 32.2121 50.0481 32.2027C50.1516 32.1901 50.2411 32.1697 50.3165 32.1415C50.4797 32.085 50.599 31.9877 50.6743 31.8495C50.7528 31.7114 50.7921 31.5607 50.7921 31.3975C50.7921 31.2185 50.7497 31.0616 50.6649 30.9266C50.5833 30.7916 50.4593 30.6974 50.2929 30.6441C50.1799 30.6033 50.0575 30.5797 49.9256 30.5734C49.7969 30.5672 49.7153 30.564 49.6808 30.564H48.3529V32.2168Z" fill="#8A8A8A"/>
                      <path d="M54.8243 35.1975C54.3189 35.1975 53.8872 35.083 53.5294 34.8538C53.1715 34.6246 52.8968 34.3076 52.7053 33.9026C52.5138 33.4976 52.4181 33.033 52.4181 32.5088C52.4181 31.9751 52.5154 31.5074 52.71 31.1055C52.9047 30.7037 53.1809 30.3914 53.5388 30.1685C53.8998 29.9424 54.3283 29.8294 54.8243 29.8294C55.3329 29.8294 55.7661 29.944 56.124 30.1732C56.485 30.3992 56.7597 30.7147 56.948 31.1197C57.1395 31.5215 57.2352 31.9845 57.2352 32.5088C57.2352 33.0424 57.1395 33.5118 56.948 33.9167C56.7565 34.3185 56.4803 34.6325 56.1192 34.8585C55.7582 35.0845 55.3266 35.1975 54.8243 35.1975ZM54.8243 34.5336C55.3894 34.5336 55.81 34.3468 56.0863 33.9732C56.3625 33.5965 56.5007 33.1084 56.5007 32.5088C56.5007 31.8935 56.361 31.4038 56.0816 31.0396C55.8053 30.6755 55.3862 30.4934 54.8243 30.4934C54.4445 30.4934 54.1305 30.5797 53.8825 30.7524C53.6377 30.9219 53.454 31.1589 53.3316 31.4634C53.2123 31.7648 53.1527 32.1132 53.1527 32.5088C53.1527 33.1209 53.2939 33.6122 53.5765 33.9827C53.859 34.3499 54.2749 34.5336 54.8243 34.5336Z" fill="#8A8A8A"/>
                    </svg>
                </a>
                
       
            	    
    	    <div class="hb_r">
    		    <div class="h_contacts">
    		        <a class=\'h_tel\' href="tel:[[++phone]]">[[++phone]]</a>
    		        <div class="h_mail">
        			    <a href="mailto:[[++mail]]">[[++mail]]</a>
                    </div>
                    <div class = "request-call-btn" data-request-call>Заказать звонок</div>
    		    </div>
    		    
    		    <div class="top-menu">
    		        [[pdoMenu?
                        &parents=`0`
                        &tpl=`@INLINE <li[[--+classes--]]><a [[+classes]] href="[[+link]]" [[+attributes]]>[[+menutitle]]</a>[[+wrapper]]</li>`
                    ]]
                    <div class="drop-down-menu">
            	        <div class="drop-down-menu-col drop-down-menu-nav">
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Литье по выплавляемым моделям</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	   </div>
            	        <div class="drop-down-menu-col">
            	                <a href="" class="go-to">
                            	    <div class="arrow-gold-right-45">
                            			<svg xmlns="http://www.w3.org/2000/svg" width="33" height="33" viewBox="0 0 33 33" fill="none">
                                          <path d="M33 3C33 1.34315 31.6569 0 30 0H3C1.34315 0 0 1.34315 0 3C0 4.65685 1.34315 6 3 6H27V30C27 31.6569 28.3431 33 30 33C31.6569 33 33 31.6569 33 30V3ZM8.12132 29.1213L32.1213 5.12132L27.8787 0.87868L3.87868 24.8787L8.12132 29.1213Z" fill="#535353"/>
                                        </svg>
                            		</div>
                            	    <span class="go-to-text">смотреть всю&nbsp;прдукцию</span>
                            	</a>
            	  </div>
            	    </div>
    		    </div>
    	</div>
    	     <div class="burger-menu" data-burger-menu>
                <span class="burger-item burger-1"></span>
                <span class="burger-item burger-2"></span>
                <span class="burger-item burger-3"></span>
            </div>
    </div>
    
       
	</div>
</div>



<div class="modal-request-acall">
    <div class="modal-dialog shadow-lg  mb-5 bg-white rounded">
        <div class="modal-content sub-bg">
            <div class="modal-header subs-header">
                <div class="modal-title-wrapper">
                    <div class=\'modal-title\'>Заказать звонок</div>
                    <div class=\'modal-subtitle\'>Наш менеджер свяжется с вами и проконсультирует</div>
                </div>
                    				    	    
                <button type="button" class="close" data-dismiss="modal" aria-hidden="true"> [[--&times;--]]
                    <svg xmlns="http://www.w3.org/2000/svg" width="26" height="26" viewBox="0 0 26 26" fill="none">
                        <path d="M1 1L25 25" stroke="white"/>
                        <path d="M25 1L1 25" stroke="white"/>
                    </svg>
                </button>
                    						     <!--<h4 class="modal-title"> [[*pagetitle]]</h4>-->
            </div>
            <div class="modal-body">
                [[!AjaxForm?
                    &snippet=`FormIt`
                    &form=`Order_form`
                    &hooks=`email`
                    &emailSubject=`Сообщение с сайта [[++site_url:replace=`http://== `:replace=`https://== `:replace=`/== `]]`
                    &emailTo=`[[++mail]]`
                    &emailTpl=`tpl.contact_form`
                    &validate=`name:required,email:required,message:required`
                    &validationErrorMessage=`В форме содержатся ошибки!`
                    &successMessage=`Ваше сообщение отправлено!
                    Наши специалисты свяжутся с вами в ближайшее время.`
                ]]
            </div>
        </div>
    </div>
</div>


[[--<div class="modal fade" id="susbc-form">
                    			    <div class="modal-dialog shadow-lg p-3 mb-5 bg-white rounded">
                    				    <div class="modal-content sub-bg">
                    				    	<div class="modal-header subs-header">
                    				    	    <div class="modal-title-wrapper">
                    				    	        <div class=\'modal-title\'>ОСтавьте заявку</div>
                    				    	        <div class=\'modal-subtitle\'>Наш менеджер свяжется с вами и проконсультирует</div>
                    				    	    </div>
                    				    	    
                    						    <button type="button" class="close" data-dismiss="modal" aria-hidden="true"> [[--&times;--]]
                    						        <svg xmlns="http://www.w3.org/2000/svg" width="26" height="26" viewBox="0 0 26 26" fill="none">
                                                  <path d="M1 1L25 25" stroke="white"/>
                                                  <path d="M25 1L1 25" stroke="white"/>
                                                </svg>
                    						    </button>
                    						     <!--<h4 class="modal-title"> [[*pagetitle]]</h4>-->
                    					    </div>
                        					    <div class="modal-body">
                        					        [[!AjaxForm?
                                                        &snippet=`FormIt`
                                                        &form=`Order_form`
                                                        &hooks=`email`
                                                        &emailSubject=`Сообщение с сайта [[++site_url:replace=`http://== `:replace=`https://== `:replace=`/== `]]`
                                                        &emailTo=`[[++mail]]`
                                                        &emailTpl=`tpl.contact_form`
                                                        &validate=`name:required,email:required,message:required`
                                                        &validationErrorMessage=`В форме содержатся ошибки!`
                                                        &successMessage=`Ваше сообщение отправлено!
                                                        Наши специалисты свяжутся с вами в ближайшее время.`
                                                        ]]
                        						</div>
                    					    </div>
                    				    </div>
                    			    </div>--]]



 [[--<a href="mailto:[[--++mail2--]]">[[--++mail2--]]</a>--]] 

[[-- <div class="inner-min "></div>--]]


[[--<div class="hb_c">
            <a href=""> 
            <div class="logo_sitename"> [[--++site_name--]]  </div>
                    		
        </a>
        </div>--]]',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<!-- Yandex.Metrika counter -->
<script type="text/javascript" >
   (function(m,e,t,r,i,k,a){m[i]=m[i]||function(){(m[i].a=m[i].a||[]).push(arguments)};
   m[i].l=1*new Date();
   for (var j = 0; j < document.scripts.length; j++) {if (document.scripts[j].src === r) { return; }}
   k=e.createElement(t),a=e.getElementsByTagName(t)[0],k.async=1,k.src=r,a.parentNode.insertBefore(k,a)})
   (window, document, "script", "https://mc.yandex.ru/metrika/tag.js", "ym");
   ym(92489463, "init", {
        clickmap:true,
        trackLinks:true,
        accurateTrackBounce:true
   });
</script>
<noscript><div><img src="https://mc.yandex.ru/watch/92489463" style="position:absolute; left:-9999px;" alt="" /></div></noscript>
<!-- /Yandex.Metrika counter -->

<script src="//code.jivo.ru/widget/VTHqXXTq3m" async></script>

<div class="header">
	<div class="inner-min mobile-menu">
    	<div class=" main-header">
    		<a href="/" class="hb_l header-logo-pc">
                <div class="header-logo">ЛП УБМ</div>
                <div class="logo_sitename"> [[++site_name]]  </div>
    	    </a>
        	<a href="/" class="header-logo-mobile">
        	        <svg xmlns="http://www.w3.org/2000/svg" width="61" height="37" viewBox="0 0 61 37" fill="none">
                      <path d="M0.141266 11.8663V10.3913C0.421443 10.4187 0.652177 10.405 0.833468 10.3501C1.02025 10.2896 1.17682 10.1743 1.30318 10.004C1.42953 9.82818 1.53666 9.57547 1.62456 9.24585C1.71795 8.91623 1.8086 8.49047 1.89649 7.96857C2.01735 7.30384 2.11899 6.61987 2.20139 5.91668C2.2838 5.21349 2.35247 4.5158 2.40741 3.82359C2.46784 3.1259 2.51728 2.45292 2.55573 1.80467C2.59419 1.15642 2.6244 0.55486 2.64638 0H10.4337V11.8663H8.71139V1.62338H4.26152C4.23405 2.06287 4.20109 2.55456 4.16263 3.09843C4.12418 3.6423 4.07748 4.21914 4.02254 4.82894C3.96761 5.43873 3.89894 6.06776 3.81653 6.71601C3.73962 7.36427 3.64073 8.01527 3.51987 8.66901C3.42099 9.22937 3.30013 9.73478 3.15729 10.1853C3.01446 10.6357 2.82218 11.0121 2.58046 11.3142C2.33873 11.6109 2.02285 11.8086 1.6328 11.9075C1.24275 12.0119 0.74557 11.9982 0.141266 11.8663Z" fill="white"/>
                      <path d="M12.7467 11.8663V0H22.182V11.8663H20.4598V1.62338H14.4689V11.8663H12.7467Z" fill="white"/>
                      <path d="M29.501 11.8663L31.0008 8.79262L26.8641 0H28.8006L31.899 6.96323L35.0799 0H36.9175L31.3634 11.8663H29.501Z" fill="white"/>
                      <path d="M38.2085 11.8663V0H45.9464V1.62338H39.9308V4.48284H43.0045C43.1144 4.48284 43.2545 4.48833 43.4248 4.49932C43.6006 4.50481 43.7654 4.51854 43.9192 4.54052C44.562 4.61743 45.1031 4.82619 45.5426 5.1668C45.9876 5.50741 46.3227 5.93866 46.5479 6.46056C46.7787 6.98246 46.894 7.5538 46.894 8.17458C46.894 8.79537 46.7814 9.36671 46.5562 9.88861C46.3309 10.4105 45.9958 10.8418 45.5508 11.1824C45.1113 11.523 44.5675 11.7317 43.9192 11.8086C43.7654 11.8306 43.6033 11.8471 43.433 11.8581C43.2627 11.8636 43.1199 11.8663 43.0045 11.8663H38.2085ZM39.9308 10.2429H42.9386C43.0485 10.2429 43.1693 10.2375 43.3012 10.2265C43.4385 10.2155 43.5676 10.199 43.6885 10.177C44.2214 10.0672 44.5949 9.81444 44.8092 9.4189C45.0289 9.02335 45.1388 8.60858 45.1388 8.17458C45.1388 7.73509 45.0289 7.32032 44.8092 6.93027C44.5949 6.53472 44.2214 6.28201 43.6885 6.17214C43.5676 6.14467 43.4385 6.12819 43.3012 6.1227C43.1693 6.11171 43.0485 6.10622 42.9386 6.10622H39.9308V10.2429Z" fill="white"/>
                      <path d="M48.5414 11.8663V0H50.0988L54.4004 8.92447L58.6772 0H60.2511V11.8581H58.6195V3.74119L54.7877 11.8663H54.0048L50.1647 3.74119V11.8663H48.5414Z" fill="white"/>
                      <path d="M0 25.0563V24.4394C0.172658 24.4551 0.315494 24.4488 0.428506 24.4206C0.541519 24.3892 0.632557 24.3201 0.70162 24.2134C0.773823 24.1067 0.836608 23.9481 0.889975 23.7378C0.943342 23.5243 0.996709 23.2465 1.05008 22.9043C1.10972 22.5339 1.15995 22.165 1.20076 21.7977C1.24471 21.4304 1.28238 21.0584 1.31377 20.6817C1.3483 20.3019 1.37656 19.9126 1.39853 19.5139C1.42051 19.1153 1.44091 18.7024 1.45975 18.2755H5.7401V25.0563H5.0479V18.9395H2.12841C2.10643 19.2628 2.08446 19.594 2.06248 19.933C2.04365 20.2721 2.01853 20.619 1.98714 20.9737C1.95889 21.3284 1.92278 21.6941 1.87884 22.0709C1.83803 22.4444 1.78623 22.8305 1.72344 23.2292C1.67322 23.5306 1.61357 23.81 1.54451 24.0674C1.47858 24.3248 1.38441 24.5414 1.26197 24.7172C1.14268 24.893 0.981013 25.0139 0.776962 25.0798C0.576051 25.1457 0.317063 25.1379 0 25.0563Z" fill="#8A8A8A"/>
                      <path d="M11.0961 19.9707V25.0563H10.4228V21.0961L7.63512 25.0563H7.05123V19.9707H7.72459V23.8979L10.5169 19.9707H11.0961Z" fill="#8A8A8A"/>
                      <path d="M13.7975 25.0563V20.6111H11.994V19.9707H16.2932V20.6111H14.4897V25.0563H13.7975Z" fill="#8A8A8A"/>
                      <path d="M19.343 25.1975C18.847 25.1975 18.4169 25.0877 18.0527 24.8679C17.6917 24.6482 17.4108 24.339 17.2099 23.9403C17.0089 23.5416 16.9085 23.0738 16.9085 22.537C16.9085 21.9814 17.0074 21.5011 17.2051 21.0961C17.4029 20.6912 17.6807 20.3788 18.0386 20.1591C18.3996 19.9393 18.825 19.8294 19.3147 19.8294C19.817 19.8294 20.2455 19.9456 20.6002 20.1779C20.955 20.4071 21.2234 20.7367 21.4055 21.1668C21.5875 21.5968 21.6707 22.1101 21.655 22.7065H20.9487V22.4617C20.9361 21.8024 20.7933 21.3049 20.5202 20.969C20.2502 20.6331 19.8547 20.4651 19.3336 20.4651C18.7873 20.4651 18.3682 20.6425 18.0763 20.9972C17.7875 21.352 17.6431 21.8574 17.6431 22.5135C17.6431 23.1539 17.7875 23.6515 18.0763 24.0062C18.3682 24.3578 18.781 24.5336 19.3147 24.5336C19.6789 24.5336 19.9959 24.4504 20.2659 24.284C20.539 24.1145 20.7541 23.8712 20.911 23.5541L21.5561 23.8037C21.3552 24.2463 21.0586 24.5901 20.6662 24.835C20.2769 25.0767 19.8358 25.1975 19.343 25.1975ZM17.3982 22.7065V22.1274H21.283V22.7065H17.3982Z" fill="#8A8A8A"/>
                      <path d="M24.8096 19.368C24.5867 19.368 24.3827 19.313 24.1974 19.2032C24.0122 19.0933 23.8647 18.9473 23.7548 18.7652C23.6481 18.58 23.5947 18.376 23.5947 18.1531H24.1692C24.1692 18.3289 24.232 18.4796 24.3575 18.6051C24.4831 18.7307 24.6338 18.7935 24.8096 18.7935C24.9885 18.7935 25.1392 18.7307 25.2616 18.6051C25.3872 18.4796 25.45 18.3289 25.45 18.1531H26.0245C26.0245 18.376 25.9695 18.58 25.8597 18.7652C25.7529 18.9473 25.607 19.0933 25.4217 19.2032C25.2365 19.313 25.0325 19.368 24.8096 19.368ZM26.7402 19.9707V25.0563H26.0669V21.0961L23.2792 25.0563H22.6953V19.9707H23.3687V23.8979L26.161 19.9707H26.7402Z" fill="#8A8A8A"/>
                      <path d="M28.0572 25.0563V19.9707H28.7494V22.1792H31.6171V19.9707H32.3093V25.0563H31.6171V22.8431H28.7494V25.0563H28.0572Z" fill="#8A8A8A"/>
                      <path d="M35.7497 25.1975C35.2443 25.1975 34.8127 25.083 34.4548 24.8538C34.0969 24.6246 33.8223 24.3076 33.6308 23.9026C33.4393 23.4976 33.3435 23.033 33.3435 22.5088C33.3435 21.9751 33.4408 21.5074 33.6355 21.1055C33.8301 20.7037 34.1064 20.3914 34.4642 20.1685C34.8252 19.9424 35.2537 19.8294 35.7497 19.8294C36.2583 19.8294 36.6915 19.944 37.0494 20.1732C37.4104 20.3992 37.6851 20.7147 37.8734 21.1197C38.0649 21.5215 38.1607 21.9845 38.1607 22.5088C38.1607 23.0424 38.0649 23.5118 37.8734 23.9167C37.6819 24.3186 37.4057 24.6325 37.0447 24.8585C36.6837 25.0845 36.252 25.1975 35.7497 25.1975ZM35.7497 24.5336C36.3148 24.5336 36.7355 24.3468 37.0117 23.9732C37.288 23.5965 37.4261 23.1084 37.4261 22.5088C37.4261 21.8935 37.2864 21.4038 37.007 21.0396C36.7308 20.6755 36.3117 20.4934 35.7497 20.4934C35.3699 20.4934 35.056 20.5797 34.808 20.7524C34.5631 20.9219 34.3795 21.1589 34.257 21.4634C34.1377 21.7648 34.0781 22.1132 34.0781 22.5088C34.0781 23.1209 34.2194 23.6122 34.5019 23.9827C34.7844 24.3499 35.2004 24.5336 35.7497 24.5336Z" fill="#8A8A8A"/>
                      <path d="M41.3514 25.1975C40.8554 25.1975 40.4253 25.0877 40.0611 24.8679C39.7001 24.6482 39.4192 24.339 39.2183 23.9403C39.0174 23.5416 38.9169 23.0738 38.9169 22.537C38.9169 21.9814 39.0158 21.5011 39.2136 21.0961C39.4113 20.6912 39.6892 20.3788 40.047 20.1591C40.408 19.9393 40.8334 19.8294 41.3231 19.8294C41.8254 19.8294 42.2539 19.9456 42.6086 20.1779C42.9634 20.4071 43.2318 20.7367 43.4139 21.1668C43.5959 21.5968 43.6791 22.1101 43.6634 22.7065H42.9571V22.4617C42.9445 21.8024 42.8017 21.3049 42.5286 20.969C42.2586 20.6331 41.8631 20.4651 41.342 20.4651C40.7957 20.4651 40.3766 20.6425 40.0847 20.9972C39.7959 21.352 39.6515 21.8574 39.6515 22.5135C39.6515 23.1539 39.7959 23.6515 40.0847 24.0062C40.3766 24.3578 40.7895 24.5336 41.3231 24.5336C41.6873 24.5336 42.0043 24.4504 42.2743 24.284C42.5474 24.1145 42.7625 23.8712 42.9194 23.5541L43.5645 23.8037C43.3636 24.2463 43.067 24.5901 42.6746 24.835C42.2853 25.0767 41.8442 25.1975 41.3514 25.1975ZM39.4066 22.7065V22.1274H43.2914V22.7065H39.4066Z" fill="#8A8A8A"/>
                      <path d="M0.466177 35.0563V29.9707H4.51109V35.0563H3.81889V30.6346H1.15838V35.0563H0.466177Z" fill="#8A8A8A"/>
                      <path d="M7.95643 35.1975C7.45101 35.1975 7.01937 35.083 6.66149 34.8538C6.30362 34.6246 6.02894 34.3076 5.83744 33.9026C5.64595 33.4976 5.5502 33.033 5.5502 32.5088C5.5502 31.9751 5.64752 31.5074 5.84215 31.1055C6.03678 30.7037 6.31304 30.3914 6.67091 30.1685C7.03192 29.9424 7.46043 29.8294 7.95643 29.8294C8.46499 29.8294 8.8982 29.944 9.25608 30.1732C9.61709 30.3992 9.89177 30.7147 10.0801 31.1197C10.2716 31.5215 10.3674 31.9845 10.3674 32.5088C10.3674 33.0424 10.2716 33.5118 10.0801 33.9167C9.88863 34.3185 9.61238 34.6325 9.25137 34.8585C8.89035 35.0845 8.45871 35.1975 7.95643 35.1975ZM7.95643 34.5336C8.52149 34.5336 8.94215 34.3468 9.2184 33.9732C9.49466 33.5965 9.63278 33.1084 9.63278 32.5088C9.63278 31.8935 9.49309 31.4038 9.2137 31.0396C8.93744 30.6755 8.51835 30.4934 7.95643 30.4934C7.57658 30.4934 7.26266 30.5797 7.01466 30.7524C6.7698 30.9219 6.58615 31.1589 6.46372 31.4634C6.34443 31.7648 6.28478 32.1132 6.28478 32.5088C6.28478 33.1209 6.42605 33.6122 6.70858 33.9827C6.99111 34.3499 7.40706 34.5336 7.95643 34.5336Z" fill="#8A8A8A"/>
                      <path d="M15.4463 29.9707V35.0563H14.7729V31.0961L11.9853 35.0563H11.4014V29.9707H12.0748V33.8979L14.8671 29.9707H15.4463Z" fill="#8A8A8A"/>
                      <path d="M18.5997 35.1975C18.088 35.1975 17.6407 35.0861 17.2577 34.8632C16.8778 34.6372 16.578 34.3248 16.3583 33.9261L16.9139 33.573C17.0991 33.8869 17.3299 34.1255 17.6061 34.2887C17.8824 34.452 18.1995 34.5336 18.5573 34.5336C18.9309 34.5336 19.2307 34.4473 19.4567 34.2746C19.6827 34.1019 19.7958 33.8649 19.7958 33.5636C19.7958 33.3564 19.7471 33.1916 19.6498 33.0691C19.5556 32.9467 19.4112 32.8588 19.2166 32.8054C19.0251 32.7521 18.7849 32.7254 18.4961 32.7254H17.8934V32.1321H18.4867C18.8383 32.1321 19.1208 32.0693 19.3343 31.9437C19.5509 31.815 19.6592 31.6141 19.6592 31.341C19.6592 31.0522 19.5509 30.8387 19.3343 30.7006C19.1208 30.5593 18.865 30.4887 18.5667 30.4887C18.2654 30.4887 17.9797 30.5515 17.7097 30.677C17.4429 30.7995 17.2184 30.958 17.0364 31.1526L16.5937 30.6864C16.848 30.4071 17.1447 30.1952 17.4837 30.0508C17.8259 29.9032 18.2042 29.8294 18.6185 29.8294C18.945 29.8294 19.2401 29.8875 19.5038 30.0037C19.7706 30.1167 19.981 30.2831 20.1348 30.5028C20.2918 30.7225 20.3702 30.9862 20.3702 31.2939C20.3702 31.5827 20.2996 31.8323 20.1583 32.0426C20.0202 32.2529 19.824 32.4272 19.5697 32.5653L19.5321 32.3063C19.7518 32.3471 19.9339 32.435 20.0783 32.57C20.2227 32.705 20.3294 32.8666 20.3985 33.055C20.4676 33.2434 20.5021 33.4349 20.5021 33.6295C20.5021 33.9528 20.4173 34.2322 20.2478 34.4677C20.0814 34.7 19.8538 34.8805 19.565 35.0092C19.2794 35.1348 18.9576 35.1975 18.5997 35.1975Z" fill="#8A8A8A"/>
                      <path d="M21.5365 35.0563V29.9707H23.6319C23.7387 29.9707 23.8674 29.977 24.0181 29.9895C24.1719 30.0021 24.3147 30.0256 24.4466 30.0602C24.7322 30.1355 24.9614 30.2893 25.1341 30.5216C25.3099 30.7539 25.3978 31.0333 25.3978 31.3598C25.3978 31.5419 25.3695 31.7051 25.313 31.8495C25.2596 31.9908 25.1827 32.1132 25.0823 32.2168C25.0352 32.2702 24.9834 32.3173 24.9269 32.3581C24.8704 32.3958 24.8154 32.4272 24.7621 32.4523C24.8625 32.4711 24.9708 32.5151 25.087 32.5841C25.269 32.6909 25.4072 32.8353 25.5014 33.0173C25.5955 33.1963 25.6426 33.4144 25.6426 33.6719C25.6426 34.0203 25.5594 34.3044 25.393 34.5242C25.2267 34.7439 25.0038 34.8946 24.7244 34.9762C24.5988 35.0107 24.4623 35.0327 24.3147 35.0421C24.1703 35.0516 24.0338 35.0563 23.905 35.0563H21.5365ZM22.2334 34.4677H23.8721C23.938 34.4677 24.0212 34.463 24.1217 34.4535C24.2221 34.441 24.3116 34.4253 24.3901 34.4064C24.5753 34.3594 24.7103 34.2652 24.795 34.1239C24.8829 33.9795 24.9269 33.8225 24.9269 33.653C24.9269 33.4301 24.8609 33.2481 24.7291 33.1068C24.6004 32.9624 24.4277 32.8745 24.2111 32.8431C24.1389 32.8274 24.0636 32.818 23.9851 32.8149C23.9066 32.8117 23.836 32.8101 23.7732 32.8101H22.2334V34.4677ZM22.2334 32.2168H23.6555C23.7371 32.2168 23.8281 32.2121 23.9286 32.2027C24.0322 32.1901 24.1217 32.1697 24.197 32.1415C24.3602 32.085 24.4795 31.9877 24.5549 31.8495C24.6334 31.7114 24.6726 31.5607 24.6726 31.3975C24.6726 31.2185 24.6302 31.0616 24.5455 30.9266C24.4638 30.7916 24.3398 30.6974 24.1735 30.6441C24.0604 30.6033 23.938 30.5797 23.8062 30.5734C23.6775 30.5672 23.5958 30.564 23.5613 30.564H22.2334V32.2168Z" fill="#8A8A8A"/>
                      <path d="M28.7048 35.1975C28.1994 35.1975 27.7678 35.083 27.4099 34.8538C27.052 34.6246 26.7774 34.3076 26.5859 33.9026C26.3944 33.4976 26.2986 33.033 26.2986 32.5088C26.2986 31.9751 26.3959 31.5074 26.5906 31.1055C26.7852 30.7037 27.0615 30.3914 27.4193 30.1685C27.7803 29.9424 28.2088 29.8294 28.7048 29.8294C29.2134 29.8294 29.6466 29.944 30.0045 30.1732C30.3655 30.3992 30.6402 30.7147 30.8285 31.1197C31.02 31.5215 31.1158 31.9845 31.1158 32.5088C31.1158 33.0424 31.02 33.5118 30.8285 33.9167C30.6371 34.3185 30.3608 34.6325 29.9998 34.8585C29.6388 35.0845 29.2071 35.1975 28.7048 35.1975ZM28.7048 34.5336C29.2699 34.5336 29.6906 34.3468 29.9668 33.9732C30.2431 33.5965 30.3812 33.1084 30.3812 32.5088C30.3812 31.8935 30.2415 31.4038 29.9621 31.0396C29.6859 30.6755 29.2668 30.4934 28.7048 30.4934C28.325 30.4934 28.0111 30.5797 27.7631 30.7524C27.5182 30.9219 27.3346 31.1589 27.2121 31.4634C27.0928 31.7648 27.0332 32.1132 27.0332 32.5088C27.0332 33.1209 27.1745 33.6122 27.457 33.9827C27.7395 34.3499 28.1555 34.5336 28.7048 34.5336Z" fill="#8A8A8A"/>
                      <path d="M31.7778 36.1864V34.463C32.0666 34.463 32.2738 34.3703 32.3994 34.1851C32.525 33.9968 32.627 33.697 32.7055 33.2857C32.7588 33.0189 32.8028 32.7317 32.8373 32.424C32.8718 32.1164 32.9017 31.7648 32.9268 31.3692C32.9519 30.9705 32.9754 30.5044 32.9974 29.9707H36.3595V34.463H36.8493V36.1864H36.1806V35.0563H32.4418V36.1864H31.7778ZM32.9503 34.463H35.6721V30.564H33.6378C33.6284 30.8026 33.6143 31.0553 33.5954 31.3221C33.5797 31.589 33.5593 31.8558 33.5342 32.1227C33.5122 32.3895 33.4856 32.6406 33.4542 32.8761C33.4259 33.1084 33.3914 33.3124 33.3506 33.4882C33.3035 33.7142 33.2517 33.9073 33.1952 34.0674C33.1418 34.2275 33.0602 34.3594 32.9503 34.463Z" fill="#8A8A8A"/>
                      <path d="M39.9019 35.1975C39.3902 35.1975 38.9569 35.083 38.6022 34.8538C38.2475 34.6246 37.9775 34.3091 37.7923 33.9073C37.6102 33.5023 37.516 33.0377 37.5098 32.5135C37.516 31.9798 37.6133 31.5121 37.8017 31.1102C37.9901 30.7053 38.2616 30.3914 38.6163 30.1685C38.9711 29.9424 39.4011 29.8294 39.9066 29.8294C40.4214 29.8294 40.8687 29.955 41.2486 30.2061C41.6316 30.4573 41.8937 30.801 42.035 31.2374L41.3569 31.454C41.2376 31.1495 41.0477 30.914 40.7871 30.7477C40.5297 30.5781 40.2346 30.4934 39.9019 30.4934C39.5283 30.4934 39.2191 30.5797 38.9742 30.7524C38.7293 30.9219 38.5473 31.1589 38.428 31.4634C38.3087 31.7679 38.2475 32.1179 38.2443 32.5135C38.2506 33.1225 38.3919 33.6122 38.6681 33.9827C38.9444 34.3499 39.3556 34.5336 39.9019 34.5336C40.2472 34.5336 40.5407 34.4551 40.7824 34.2981C41.0273 34.138 41.2125 33.9057 41.3381 33.6012L42.035 33.8084C41.8466 34.2605 41.5704 34.6058 41.2062 34.8444C40.8421 35.0798 40.4073 35.1975 39.9019 35.1975Z" fill="#8A8A8A"/>
                      <path d="M44.2671 35.0563V30.6111H42.4636V29.9707H46.7628V30.6111H44.9593V35.0563H44.2671Z" fill="#8A8A8A"/>
                      <path d="M47.656 35.0563V29.9707H49.7514C49.8581 29.9707 49.9868 29.977 50.1375 29.9895C50.2913 30.0021 50.4342 30.0256 50.566 30.0602C50.8517 30.1355 51.0809 30.2893 51.2535 30.5216C51.4293 30.7539 51.5172 31.0333 51.5172 31.3598C51.5172 31.5419 51.489 31.7051 51.4325 31.8495C51.3791 31.9908 51.3022 32.1132 51.2017 32.2168C51.1546 32.2702 51.1028 32.3173 51.0463 32.3581C50.9898 32.3958 50.9349 32.4272 50.8815 32.4523C50.982 32.4711 51.0903 32.5151 51.2064 32.5841C51.3885 32.6909 51.5266 32.8353 51.6208 33.0173C51.715 33.1963 51.7621 33.4144 51.7621 33.6719C51.7621 34.0203 51.6789 34.3044 51.5125 34.5242C51.3461 34.7439 51.1232 34.8946 50.8438 34.9762C50.7183 35.0107 50.5817 35.0327 50.4342 35.0421C50.2898 35.0516 50.1532 35.0563 50.0245 35.0563H47.656ZM48.3529 34.4677H49.9915C50.0575 34.4677 50.1407 34.463 50.2411 34.4535C50.3416 34.441 50.431 34.4253 50.5095 34.4064C50.6947 34.3594 50.8297 34.2652 50.9145 34.1239C51.0024 33.9795 51.0463 33.8225 51.0463 33.653C51.0463 33.4301 50.9804 33.2481 50.8486 33.1068C50.7199 32.9624 50.5472 32.8745 50.3306 32.8431C50.2584 32.8274 50.183 32.818 50.1046 32.8149C50.0261 32.8117 49.9554 32.8101 49.8927 32.8101H48.3529V34.4677ZM48.3529 32.2168H49.7749C49.8566 32.2168 49.9476 32.2121 50.0481 32.2027C50.1516 32.1901 50.2411 32.1697 50.3165 32.1415C50.4797 32.085 50.599 31.9877 50.6743 31.8495C50.7528 31.7114 50.7921 31.5607 50.7921 31.3975C50.7921 31.2185 50.7497 31.0616 50.6649 30.9266C50.5833 30.7916 50.4593 30.6974 50.2929 30.6441C50.1799 30.6033 50.0575 30.5797 49.9256 30.5734C49.7969 30.5672 49.7153 30.564 49.6808 30.564H48.3529V32.2168Z" fill="#8A8A8A"/>
                      <path d="M54.8243 35.1975C54.3189 35.1975 53.8872 35.083 53.5294 34.8538C53.1715 34.6246 52.8968 34.3076 52.7053 33.9026C52.5138 33.4976 52.4181 33.033 52.4181 32.5088C52.4181 31.9751 52.5154 31.5074 52.71 31.1055C52.9047 30.7037 53.1809 30.3914 53.5388 30.1685C53.8998 29.9424 54.3283 29.8294 54.8243 29.8294C55.3329 29.8294 55.7661 29.944 56.124 30.1732C56.485 30.3992 56.7597 30.7147 56.948 31.1197C57.1395 31.5215 57.2352 31.9845 57.2352 32.5088C57.2352 33.0424 57.1395 33.5118 56.948 33.9167C56.7565 34.3185 56.4803 34.6325 56.1192 34.8585C55.7582 35.0845 55.3266 35.1975 54.8243 35.1975ZM54.8243 34.5336C55.3894 34.5336 55.81 34.3468 56.0863 33.9732C56.3625 33.5965 56.5007 33.1084 56.5007 32.5088C56.5007 31.8935 56.361 31.4038 56.0816 31.0396C55.8053 30.6755 55.3862 30.4934 54.8243 30.4934C54.4445 30.4934 54.1305 30.5797 53.8825 30.7524C53.6377 30.9219 53.454 31.1589 53.3316 31.4634C53.2123 31.7648 53.1527 32.1132 53.1527 32.5088C53.1527 33.1209 53.2939 33.6122 53.5765 33.9827C53.859 34.3499 54.2749 34.5336 54.8243 34.5336Z" fill="#8A8A8A"/>
                    </svg>
                </a>
                
       
            	    
    	    <div class="hb_r">
    		    <div class="h_contacts">
    		        <a class=\'h_tel\' href="tel:[[++phone]]">[[++phone]]</a>
    		        <div class="h_mail">
        			    <a href="mailto:[[++mail]]">[[++mail]]</a>
                    </div>
                    <div class = "request-call-btn" data-request-call>Заказать звонок</div>
    		    </div>
    		    
    		    <div class="top-menu">
    		        [[pdoMenu?
                        &parents=`0`
                        &tpl=`@INLINE <li[[--+classes--]]><a [[+classes]] href="[[+link]]" [[+attributes]]>[[+menutitle]]</a>[[+wrapper]]</li>`
                    ]]
                    <div class="drop-down-menu">
            	        <div class="drop-down-menu-col drop-down-menu-nav">
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Литье по выплавляемым моделям</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	                <div class="drop-down-menu-nav-item">
            	                    <div class="drop-down-nav-img">
            	                        <img src="/assets/ubm/img/drop-down-nav-img.png" alt="">
            	                    </div>
            	                    <div class="drop-down-nav-title">Лазерная обработка</div>
            	                </div>
            	   </div>
            	        <div class="drop-down-menu-col">
            	                <a href="" class="go-to">
                            	    <div class="arrow-gold-right-45">
                            			<svg xmlns="http://www.w3.org/2000/svg" width="33" height="33" viewBox="0 0 33 33" fill="none">
                                          <path d="M33 3C33 1.34315 31.6569 0 30 0H3C1.34315 0 0 1.34315 0 3C0 4.65685 1.34315 6 3 6H27V30C27 31.6569 28.3431 33 30 33C31.6569 33 33 31.6569 33 30V3ZM8.12132 29.1213L32.1213 5.12132L27.8787 0.87868L3.87868 24.8787L8.12132 29.1213Z" fill="#535353"/>
                                        </svg>
                            		</div>
                            	    <span class="go-to-text">смотреть всю&nbsp;прдукцию</span>
                            	</a>
            	  </div>
            	    </div>
    		    </div>
    	</div>
    	     <div class="burger-menu" data-burger-menu>
                <span class="burger-item burger-1"></span>
                <span class="burger-item burger-2"></span>
                <span class="burger-item burger-3"></span>
            </div>
    </div>
    
       
	</div>
</div>



<div class="modal-request-acall">
    <div class="modal-dialog shadow-lg  mb-5 bg-white rounded">
        <div class="modal-content sub-bg">
            <div class="modal-header subs-header">
                <div class="modal-title-wrapper">
                    <div class=\'modal-title\'>Заказать звонок</div>
                    <div class=\'modal-subtitle\'>Наш менеджер свяжется с вами и проконсультирует</div>
                </div>
                    				    	    
                <button type="button" class="close" data-dismiss="modal" aria-hidden="true"> [[--&times;--]]
                    <svg xmlns="http://www.w3.org/2000/svg" width="26" height="26" viewBox="0 0 26 26" fill="none">
                        <path d="M1 1L25 25" stroke="white"/>
                        <path d="M25 1L1 25" stroke="white"/>
                    </svg>
                </button>
                    						     <!--<h4 class="modal-title"> [[*pagetitle]]</h4>-->
            </div>
            <div class="modal-body">
                [[!AjaxForm?
                    &snippet=`FormIt`
                    &form=`Order_form`
                    &hooks=`email`
                    &emailSubject=`Сообщение с сайта [[++site_url:replace=`http://== `:replace=`https://== `:replace=`/== `]]`
                    &emailTo=`[[++mail]]`
                    &emailTpl=`tpl.contact_form`
                    &validate=`name:required,email:required,message:required`
                    &validationErrorMessage=`В форме содержатся ошибки!`
                    &successMessage=`Ваше сообщение отправлено!
                    Наши специалисты свяжутся с вами в ближайшее время.`
                ]]
            </div>
        </div>
    </div>
</div>


[[--<div class="modal fade" id="susbc-form">
                    			    <div class="modal-dialog shadow-lg p-3 mb-5 bg-white rounded">
                    				    <div class="modal-content sub-bg">
                    				    	<div class="modal-header subs-header">
                    				    	    <div class="modal-title-wrapper">
                    				    	        <div class=\'modal-title\'>ОСтавьте заявку</div>
                    				    	        <div class=\'modal-subtitle\'>Наш менеджер свяжется с вами и проконсультирует</div>
                    				    	    </div>
                    				    	    
                    						    <button type="button" class="close" data-dismiss="modal" aria-hidden="true"> [[--&times;--]]
                    						        <svg xmlns="http://www.w3.org/2000/svg" width="26" height="26" viewBox="0 0 26 26" fill="none">
                                                  <path d="M1 1L25 25" stroke="white"/>
                                                  <path d="M25 1L1 25" stroke="white"/>
                                                </svg>
                    						    </button>
                    						     <!--<h4 class="modal-title"> [[*pagetitle]]</h4>-->
                    					    </div>
                        					    <div class="modal-body">
                        					        [[!AjaxForm?
                                                        &snippet=`FormIt`
                                                        &form=`Order_form`
                                                        &hooks=`email`
                                                        &emailSubject=`Сообщение с сайта [[++site_url:replace=`http://== `:replace=`https://== `:replace=`/== `]]`
                                                        &emailTo=`[[++mail]]`
                                                        &emailTpl=`tpl.contact_form`
                                                        &validate=`name:required,email:required,message:required`
                                                        &validationErrorMessage=`В форме содержатся ошибки!`
                                                        &successMessage=`Ваше сообщение отправлено!
                                                        Наши специалисты свяжутся с вами в ближайшее время.`
                                                        ]]
                        						</div>
                    					    </div>
                    				    </div>
                    			    </div>--]]



 [[--<a href="mailto:[[--++mail2--]]">[[--++mail2--]]</a>--]] 

[[-- <div class="inner-min "></div>--]]


[[--<div class="hb_c">
            <a href=""> 
            <div class="logo_sitename"> [[--++site_name--]]  </div>
                    		
        </a>
        </div>--]]',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
        ),
      ),
      'Crumbs' => 
      array (
        'fields' => 
        array (
          'id' => 106,
          'source' => 0,
          'property_preprocess' => false,
          'name' => 'Crumbs',
          'description' => '',
          'editor_type' => 0,
          'category' => 29,
          'cache_type' => 0,
          'snippet' => '				[[pdoCrumbs?
				    &showHome=`1`
                	&tplWrapper=`@INLINE <div class="bread">[[+output]]</div>`
                	&tplCurrent=`@INLINE   [[+menutitle]]`
                	&tpl=`@INLINE <a href="[[+link]]">[[+menutitle]]/</a>`
                ]]',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '				[[pdoCrumbs?
				    &showHome=`1`
                	&tplWrapper=`@INLINE <div class="bread">[[+output]]</div>`
                	&tplCurrent=`@INLINE   [[+menutitle]]`
                	&tpl=`@INLINE <a href="[[+link]]">[[+menutitle]]/</a>`
                ]]',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
        ),
      ),
      'Footer' => 
      array (
        'fields' => 
        array (
          'id' => 17,
          'source' => 0,
          'property_preprocess' => false,
          'name' => 'Footer',
          'description' => 'Чанк для подвала сайта',
          'editor_type' => 0,
          'category' => 29,
          'cache_type' => 0,
          'snippet' => '<div class="footer inner-min">
	<div class=" main-footer">
		<div class="fb_l">
			<div class="f-contacts">
				<div class="f-tel">
				    <a href="tel:[[++phone]]">[[++phone]]</a>
				</div>
				 <div class="f-mail">
					<a href="mailto:[[++mail]]">[[++mail]]</a>
                    <a href="mailto:[[++mail2]]">[[++mail2]]</a>
                </div>
			</div>
		</div>
		
		<div class="fb_r">
			<div class="footer-address">
				[[++add]]
			</div>
			<a class="footer-in-map go-to" href="https://yandex.ru/maps/?um=constructor%3A0bd4c9a8cc4042947d03f8a6f60ca34712418f38da43f8fd81ec80519b519838&source=constructorLink" >
			    <div class=\'arrow-gold-right-45\'>
			        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 34 33" fill="none">
                      <path d="M33.5 3C33.5 1.34315 32.1569 0 30.5 0L3.5 0C1.84315 0 0.5 1.34315 0.5 3C0.5 4.65685 1.84315 6 3.5 6L27.5 6L27.5 30C27.5 31.6569 28.8431 33 30.5 33C32.1569 33 33.5 31.6569 33.5 30V3ZM8.12132 29.6213L32.6213 5.12132L28.3787 0.87868L3.87868 25.3787L8.12132 29.6213Z" fill="#F0A73C"/>
                    </svg>
			    </div>
			    <span class=\'footer-in-map-text\'>мы на карте</span>
			</a>
	</div>
	</div>

	<div class=" bottom-line">
		<div class="bottom-line-inner">
		    <div class="bottom-menu">
				[[pdoMenu?
                    &tpl=`@INLINE <li[[+classes]]><a [[+classes]] href="[[+link]]" [[+attributes]]>[[+menutitle]]</a>[[+wrapper]]</li>`
                    &parents=`0`
                ]]
			</div>
			<div class="privacy-policy-wrapper">
			    <div class="copy">
				    <div class="uss-site-copyright">[[++copyright]]</div>						
			    </div>
			    <div class="privacy-block">
				    <a  href="[[~16]]">Политика конфиденциальности</a>
			    </div>
			</div>
			
			[[--
			<div class="bottom-line-copyright">
				<div class="uss-copyright uralsoft"></div>					
			</div>
			--]]
		</div>
	</div>
</div>





			       
[[--<div class="fb_r-inner"></div>--]]
		
 [[-- <div class="f-sitename">
	        <a href="/">[[++site_name]]</a>
</div>--]]
			   
			       
[[--<div class="copyright">
		   <div class="uss-copyright uralsoft" hidden>
				        <a class="poweredby-img" href="https://ur66.ru/" target="_blank" title="Ur66.ru  - создание и продвижение сайтов">
					           <span class="uss-logo" style="background:#828b99;-webkit-mask:url(//s1.uralcms.com/uss-img/logo-uralsoft.svg)  no-repeat 50% 50%;mask:url(//s1.uralcms.com/uss-img/logo-uralsoft.svg)  no-repeat 50% 50%;" title="Ur66.ru  - создание и продвижение сайтов"></span>
					    </a>
            			<a class="poweredby-text" href="https://ur66.ru/" target="_blank" title="Ur66.ru  - создание и продвижение сайтов">
            				<div class="line1" style="color:#828b99">создание сайтов</div>
            				<div class="line2" style="color:#828b99">URALSOFT</div>
            			</a>
			         </div>						
			       </div>--]]',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="footer inner-min">
	<div class=" main-footer">
		<div class="fb_l">
			<div class="f-contacts">
				<div class="f-tel">
				    <a href="tel:[[++phone]]">[[++phone]]</a>
				</div>
				 <div class="f-mail">
					<a href="mailto:[[++mail]]">[[++mail]]</a>
                    <a href="mailto:[[++mail2]]">[[++mail2]]</a>
                </div>
			</div>
		</div>
		
		<div class="fb_r">
			<div class="footer-address">
				[[++add]]
			</div>
			<a class="footer-in-map go-to" href="https://yandex.ru/maps/?um=constructor%3A0bd4c9a8cc4042947d03f8a6f60ca34712418f38da43f8fd81ec80519b519838&source=constructorLink" >
			    <div class=\'arrow-gold-right-45\'>
			        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 34 33" fill="none">
                      <path d="M33.5 3C33.5 1.34315 32.1569 0 30.5 0L3.5 0C1.84315 0 0.5 1.34315 0.5 3C0.5 4.65685 1.84315 6 3.5 6L27.5 6L27.5 30C27.5 31.6569 28.8431 33 30.5 33C32.1569 33 33.5 31.6569 33.5 30V3ZM8.12132 29.6213L32.6213 5.12132L28.3787 0.87868L3.87868 25.3787L8.12132 29.6213Z" fill="#F0A73C"/>
                    </svg>
			    </div>
			    <span class=\'footer-in-map-text\'>мы на карте</span>
			</a>
	</div>
	</div>

	<div class=" bottom-line">
		<div class="bottom-line-inner">
		    <div class="bottom-menu">
				[[pdoMenu?
                    &tpl=`@INLINE <li[[+classes]]><a [[+classes]] href="[[+link]]" [[+attributes]]>[[+menutitle]]</a>[[+wrapper]]</li>`
                    &parents=`0`
                ]]
			</div>
			<div class="privacy-policy-wrapper">
			    <div class="copy">
				    <div class="uss-site-copyright">[[++copyright]]</div>						
			    </div>
			    <div class="privacy-block">
				    <a  href="[[~16]]">Политика конфиденциальности</a>
			    </div>
			</div>
			
			[[--
			<div class="bottom-line-copyright">
				<div class="uss-copyright uralsoft"></div>					
			</div>
			--]]
		</div>
	</div>
</div>





			       
[[--<div class="fb_r-inner"></div>--]]
		
 [[-- <div class="f-sitename">
	        <a href="/">[[++site_name]]</a>
</div>--]]
			   
			       
[[--<div class="copyright">
		   <div class="uss-copyright uralsoft" hidden>
				        <a class="poweredby-img" href="https://ur66.ru/" target="_blank" title="Ur66.ru  - создание и продвижение сайтов">
					           <span class="uss-logo" style="background:#828b99;-webkit-mask:url(//s1.uralcms.com/uss-img/logo-uralsoft.svg)  no-repeat 50% 50%;mask:url(//s1.uralcms.com/uss-img/logo-uralsoft.svg)  no-repeat 50% 50%;" title="Ur66.ru  - создание и продвижение сайтов"></span>
					    </a>
            			<a class="poweredby-text" href="https://ur66.ru/" target="_blank" title="Ur66.ru  - создание и продвижение сайтов">
            				<div class="line1" style="color:#828b99">создание сайтов</div>
            				<div class="line2" style="color:#828b99">URALSOFT</div>
            			</a>
			         </div>						
			       </div>--]]',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
        ),
      ),
    ),
    'modSnippet' => 
    array (
      'MetaX' => 
      array (
        'fields' => 
        array (
          'id' => 94,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'MetaX',
          'description' => 'Automatically generates Meta tags for your pages, along with a base and a couple link tags.',
          'editor_type' => 0,
          'category' => 49,
          'cache_type' => 0,
          'snippet' => '/*
	MetaX (Meta Tags Extended) for Revolution
	Version: 2.0.2
	Author: Salvatore Sodano - http://salscode.com
	Other Contributors:
		Mike Stop Continues - http://mikestopcontinues.com
		Jakob Class - http://www.class-zec.de <jakob.class@class-zec.de>
		Stefan Rochlitzer - icebear-solutions.com <Stefan.Rochlitzer@icebear-solutions.com>
	Support Page: http://salscode.com/index.php?id=93

	Description: Automatically generates Meta tags for your pages, along with a base and a couple link tags.
	For a full description visit http://rtfm.modx.com/extras/revo/metax.

	MODx Versions:
	Evolution - This is the Revo version, visit http://modx.com/extras/package/metax-evo for Evo.
	Revolution - All versions, tested up to 2.3.

	Parameters:
	http://rtfm.modx.com/extras/revo/metax
*/
/**********Variables***********/
$configs = $modx->getConfig();
$sitename = trim($configs[\'site_name\']);
$sitestart = trim($configs[\'site_start\']);
 
//HTML
$html = empty($html) ? 0 : $html;
$html5 = empty($html5) ? 0 : $html5;
 
//Favicon Relative Path - Default is set to the site root, shown below.
//If the code for your favicon does not display, then the below path may be incorrect.
$favicon = empty($favicon) ? \'favicon.ico\' : $favicon;
$mobile = empty($mobile) ? \'mobile.png\' : $mobile;

//Copyrighted until - Blank defaults to current year.
$copytill = empty($copytill) ? \'\' : $copytill;

//Copyrighted since - Blank omits this from view.
$copyfrom = empty($copyfrom) ? \'\' : $copyfrom;

//RSS & CSS
$rss = empty($rss) ? \'\' : $rss;
$css = empty($css) ? \'\' : $css;

$id = $modx->resource->get(\'id\');
$siteurl = $configs[\'site_url\'];

/*----------End Variables----------*/

if($html5 == 1) {$html = 2;}
switch ($html)
{
	default:
	case 0:
		$tagend = " />";
		$tpl = empty($tpl) ? \'metax-xhtml4\' : $tpl;
		break;
	case 1:
		$tagend = " >";
		$tpl = empty($tpl) ? \'metax-html4\' : $tpl;
		break;
	case 2:
		$tagend = " />";
		$tpl = empty($tpl) ? \'metax-html5\' : $tpl;
		break;
}
/*--------------------*/

/**Robots**/
$tmp = $modx->resource->get(\'searchable\');
if ($tmp == 1) {$output["metax.robots"] = "index, follow";}
else {$output["metax.robots"] = "noindex, nofollow";}
/*--------------------*/

/**Creator/Editor**/
$created = $modx->resource->get(\'createdby\');
if ($created != \'\')
{
	$user = $modx->getObject("modUser", $created);
	if($user != NULL) {$output["metax.createdby"] = $user->getOne("Profile")->get("fullname");}
	else {$output["metax.createdby"] = $sitename;}
}
$edited = $modx->resource->get(\'editedby\');
if ($edited != \'\')
{
	$user = $modx->getObject("modUser", $edited);
	if($user != NULL) {$output["metax.editedby"] = $user->getOne("Profile")->get("fullname");}
	else {$output["metax.editedby"] = $sitename;}
}
/*--------------------*/

/**Copyright**/
if ($copyfrom != \'\' && $copytill != \'\' && $copyfrom != $copytill) {$copyyears = $copyfrom." - ".$copytill;}
elseif (($copyfrom == \'\' && $copytill != \'\') || ($copytill != \'\' && $copytill == $copyfrom)) {$copyyears = $copytill;}
elseif ($copyfrom != \'\' && $copytill == \'\') {$copyyears = $copyfrom." - ".date(\'Y\');}
elseif ($copyfrom == \'\' && $copytill == \'\') {$copyyears = date(\'Y\');}
$output["metax.copyyears"] = $copyyears;
/*--------------------*/

/**Pragma & Cache-Control**/
$pragma = $modx->resource->get(\'cacheable\');
if ($pragma == 1)
{
	if($html5 != 1) {$output["metax.cache"] = "cache";}
	else {$output["metax.cache"] = "public";}
}
else {$output["metax.cache"] = "no-cache";}

/**Canonical Link**/
if (!isset($urlExtension))
{
	$urlExtension = \'\';
}

if ($id == $sitestart) {$output["metax.canonical"] = $siteurl.$urlExtension;}
else
{
	$urlExtension = \'\';
	try
	{
		if($modx->getObject(\'modSnippet\', array(\'name\' => \'Archivist\')) != NULL)
		{
			/* Support for FURLs created by Archivist: append year and month to canonical url */
			$archivistFilterPrefix = $modx->getOption(\'archivistFilterPrefix\',$scriptProperties,\'arc_\');
			$archivist = $modx->getService(\'archivist\',\'Archivist\',$modx->getOption(\'archivist.core_path\',null,$modx->getOption(\'core_path\').\'components/archivist/\').\'model/archivist/\',array(\'filterPrefix\' => $archivistFilterPrefix));
			if (($archivist instanceof Archivist))
			{
				// Archivist is installed...
				$year = $modx->getOption($archivistFilterPrefix.\'year\',$_REQUEST,$modx->getOption(\'year\',$scriptProperties,\'\'));
				$year = (int)$archivist->sanitize($year);
				if(!empty($year)) {$urlExtension = $year;}
				$month = $modx->getOption($archivistFilterPrefix.\'month\',$_REQUEST,$modx->getOption(\'month\',$scriptProperties,\'\'));
				$month = (int)$archivist->sanitize($month);
				if (!empty($month))
				{
					if (strlen($month) == 1) $month = \'0\'.$month;
					$urlExtension .= \'/\'.$month;
				}
			}
		}
	}
	catch (Exception $e) {/*No Archivist, do nothing.*/}
	$output["metax.canonical"] = $modx->makeUrl($id, \'\', \'\', \'full\').$urlExtension;
}
/*--------------------*/

/**Favicon**/
if (is_file($favicon)) {$favicon = $siteurl.$favicon;}
else {$favicon = \'\';}
$output["metax.favicon"] = $favicon;

/**Mobile icon**/
if (is_file($mobile)) {$mobile = $siteurl.$mobile;}
else {$mobile = \'\';}
$output["metax.mobile"] = $mobile;
/*--------------------*/

/**RSS Feed**/
$rss = explode(",", $rss);
$count = count($rss);
$i = 0;
$output["metax.rss"] = "";
while ($i < $count)
{
	$rss[$i] = trim($rss[$i]);
	$tmpdoc = $modx->getObject(\'modResource\',array(\'id\' => $rss[$i]));
	if ($tmpdoc != NULL)
	{
		$output["metax.rss"] .= "<link href=\\"".$modx->makeUrl($rss[$i], \'\', \'\', \'full\')."\\" rel=\\"alternate\\" type=\\"application/rss+xml\\" title=\\"".$tmpdoc->get(\'pagetitle\')."\\"".$tagend;
	}
	$i++;
	if($i < $count) {$output["metax.rss"] .= "\\n";}
}
/*--------------------*/

/**CSS Links**/
$css = explode(",", $css);
$count = count($css);
$i = 0;
while ($i < $count)
{
	$temp = $css[$i];
	$temp = explode(":", $temp);
	$countt = count($temp);
	$temp[0] = trim($temp[0]);
	if (is_file($temp[0]))
	{
		if ($countt == 1) {$output["metax.css"] .= "<link rel=\\"stylesheet\\" href=\\"".$temp[0]."\\" type=\\"text/css\\"".$tagend;}
		else
		{
			$temp[1] = trim($temp[1]);
			$output["metax.css"] .= "<!--[if ".$temp[1]."]><link rel=\\"stylesheet\\" href=\\"".$temp[0]."\\" type=\\"text/css\\"".$tagend."<![endif]-->";
		}
	}
	$i++;
	if($i < $count) {$output["metax.css"] .= "\\n";}
}
/*--------------------*/

return $modx->getChunk($tpl, $output);',
          'locked' => false,
          'properties' => 
          array (
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => '',
          'content' => '/*
	MetaX (Meta Tags Extended) for Revolution
	Version: 2.0.2
	Author: Salvatore Sodano - http://salscode.com
	Other Contributors:
		Mike Stop Continues - http://mikestopcontinues.com
		Jakob Class - http://www.class-zec.de <jakob.class@class-zec.de>
		Stefan Rochlitzer - icebear-solutions.com <Stefan.Rochlitzer@icebear-solutions.com>
	Support Page: http://salscode.com/index.php?id=93

	Description: Automatically generates Meta tags for your pages, along with a base and a couple link tags.
	For a full description visit http://rtfm.modx.com/extras/revo/metax.

	MODx Versions:
	Evolution - This is the Revo version, visit http://modx.com/extras/package/metax-evo for Evo.
	Revolution - All versions, tested up to 2.3.

	Parameters:
	http://rtfm.modx.com/extras/revo/metax
*/
/**********Variables***********/
$configs = $modx->getConfig();
$sitename = trim($configs[\'site_name\']);
$sitestart = trim($configs[\'site_start\']);
 
//HTML
$html = empty($html) ? 0 : $html;
$html5 = empty($html5) ? 0 : $html5;
 
//Favicon Relative Path - Default is set to the site root, shown below.
//If the code for your favicon does not display, then the below path may be incorrect.
$favicon = empty($favicon) ? \'favicon.ico\' : $favicon;
$mobile = empty($mobile) ? \'mobile.png\' : $mobile;

//Copyrighted until - Blank defaults to current year.
$copytill = empty($copytill) ? \'\' : $copytill;

//Copyrighted since - Blank omits this from view.
$copyfrom = empty($copyfrom) ? \'\' : $copyfrom;

//RSS & CSS
$rss = empty($rss) ? \'\' : $rss;
$css = empty($css) ? \'\' : $css;

$id = $modx->resource->get(\'id\');
$siteurl = $configs[\'site_url\'];

/*----------End Variables----------*/

if($html5 == 1) {$html = 2;}
switch ($html)
{
	default:
	case 0:
		$tagend = " />";
		$tpl = empty($tpl) ? \'metax-xhtml4\' : $tpl;
		break;
	case 1:
		$tagend = " >";
		$tpl = empty($tpl) ? \'metax-html4\' : $tpl;
		break;
	case 2:
		$tagend = " />";
		$tpl = empty($tpl) ? \'metax-html5\' : $tpl;
		break;
}
/*--------------------*/

/**Robots**/
$tmp = $modx->resource->get(\'searchable\');
if ($tmp == 1) {$output["metax.robots"] = "index, follow";}
else {$output["metax.robots"] = "noindex, nofollow";}
/*--------------------*/

/**Creator/Editor**/
$created = $modx->resource->get(\'createdby\');
if ($created != \'\')
{
	$user = $modx->getObject("modUser", $created);
	if($user != NULL) {$output["metax.createdby"] = $user->getOne("Profile")->get("fullname");}
	else {$output["metax.createdby"] = $sitename;}
}
$edited = $modx->resource->get(\'editedby\');
if ($edited != \'\')
{
	$user = $modx->getObject("modUser", $edited);
	if($user != NULL) {$output["metax.editedby"] = $user->getOne("Profile")->get("fullname");}
	else {$output["metax.editedby"] = $sitename;}
}
/*--------------------*/

/**Copyright**/
if ($copyfrom != \'\' && $copytill != \'\' && $copyfrom != $copytill) {$copyyears = $copyfrom." - ".$copytill;}
elseif (($copyfrom == \'\' && $copytill != \'\') || ($copytill != \'\' && $copytill == $copyfrom)) {$copyyears = $copytill;}
elseif ($copyfrom != \'\' && $copytill == \'\') {$copyyears = $copyfrom." - ".date(\'Y\');}
elseif ($copyfrom == \'\' && $copytill == \'\') {$copyyears = date(\'Y\');}
$output["metax.copyyears"] = $copyyears;
/*--------------------*/

/**Pragma & Cache-Control**/
$pragma = $modx->resource->get(\'cacheable\');
if ($pragma == 1)
{
	if($html5 != 1) {$output["metax.cache"] = "cache";}
	else {$output["metax.cache"] = "public";}
}
else {$output["metax.cache"] = "no-cache";}

/**Canonical Link**/
if (!isset($urlExtension))
{
	$urlExtension = \'\';
}

if ($id == $sitestart) {$output["metax.canonical"] = $siteurl.$urlExtension;}
else
{
	$urlExtension = \'\';
	try
	{
		if($modx->getObject(\'modSnippet\', array(\'name\' => \'Archivist\')) != NULL)
		{
			/* Support for FURLs created by Archivist: append year and month to canonical url */
			$archivistFilterPrefix = $modx->getOption(\'archivistFilterPrefix\',$scriptProperties,\'arc_\');
			$archivist = $modx->getService(\'archivist\',\'Archivist\',$modx->getOption(\'archivist.core_path\',null,$modx->getOption(\'core_path\').\'components/archivist/\').\'model/archivist/\',array(\'filterPrefix\' => $archivistFilterPrefix));
			if (($archivist instanceof Archivist))
			{
				// Archivist is installed...
				$year = $modx->getOption($archivistFilterPrefix.\'year\',$_REQUEST,$modx->getOption(\'year\',$scriptProperties,\'\'));
				$year = (int)$archivist->sanitize($year);
				if(!empty($year)) {$urlExtension = $year;}
				$month = $modx->getOption($archivistFilterPrefix.\'month\',$_REQUEST,$modx->getOption(\'month\',$scriptProperties,\'\'));
				$month = (int)$archivist->sanitize($month);
				if (!empty($month))
				{
					if (strlen($month) == 1) $month = \'0\'.$month;
					$urlExtension .= \'/\'.$month;
				}
			}
		}
	}
	catch (Exception $e) {/*No Archivist, do nothing.*/}
	$output["metax.canonical"] = $modx->makeUrl($id, \'\', \'\', \'full\').$urlExtension;
}
/*--------------------*/

/**Favicon**/
if (is_file($favicon)) {$favicon = $siteurl.$favicon;}
else {$favicon = \'\';}
$output["metax.favicon"] = $favicon;

/**Mobile icon**/
if (is_file($mobile)) {$mobile = $siteurl.$mobile;}
else {$mobile = \'\';}
$output["metax.mobile"] = $mobile;
/*--------------------*/

/**RSS Feed**/
$rss = explode(",", $rss);
$count = count($rss);
$i = 0;
$output["metax.rss"] = "";
while ($i < $count)
{
	$rss[$i] = trim($rss[$i]);
	$tmpdoc = $modx->getObject(\'modResource\',array(\'id\' => $rss[$i]));
	if ($tmpdoc != NULL)
	{
		$output["metax.rss"] .= "<link href=\\"".$modx->makeUrl($rss[$i], \'\', \'\', \'full\')."\\" rel=\\"alternate\\" type=\\"application/rss+xml\\" title=\\"".$tmpdoc->get(\'pagetitle\')."\\"".$tagend;
	}
	$i++;
	if($i < $count) {$output["metax.rss"] .= "\\n";}
}
/*--------------------*/

/**CSS Links**/
$css = explode(",", $css);
$count = count($css);
$i = 0;
while ($i < $count)
{
	$temp = $css[$i];
	$temp = explode(":", $temp);
	$countt = count($temp);
	$temp[0] = trim($temp[0]);
	if (is_file($temp[0]))
	{
		if ($countt == 1) {$output["metax.css"] .= "<link rel=\\"stylesheet\\" href=\\"".$temp[0]."\\" type=\\"text/css\\"".$tagend;}
		else
		{
			$temp[1] = trim($temp[1]);
			$output["metax.css"] .= "<!--[if ".$temp[1]."]><link rel=\\"stylesheet\\" href=\\"".$temp[0]."\\" type=\\"text/css\\"".$tagend."<![endif]-->";
		}
	}
	$i++;
	if($i < $count) {$output["metax.css"] .= "\\n";}
}
/*--------------------*/

return $modx->getChunk($tpl, $output);',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'pdoMenu' => 
      array (
        'fields' => 
        array (
          'id' => 15,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'pdoMenu',
          'description' => '',
          'editor_type' => 0,
          'category' => 4,
          'cache_type' => 0,
          'snippet' => '/** @var array $scriptProperties */
/** @var modX $modx */

// Convert parameters from Wayfinder if exists
if (isset($startId)) {
    $scriptProperties[\'parents\'] = $startId;
}
if (!empty($includeDocs)) {
    $tmp = array_map(\'trim\', explode(\',\', $includeDocs));
    foreach ($tmp as $v) {
        if (!empty($scriptProperties[\'resources\'])) {
            $scriptProperties[\'resources\'] .= \',\' . $v;
        } else {
            $scriptProperties[\'resources\'] = $v;
        }
    }
}
if (!empty($excludeDocs)) {
    $tmp = array_map(\'trim\', explode(\',\', $excludeDocs));
    foreach ($tmp as $v) {
        if (!empty($scriptProperties[\'resources\'])) {
            $scriptProperties[\'resources\'] .= \',-\' . $v;
        } else {
            $scriptProperties[\'resources\'] = \'-\' . $v;
        }
    }
}

if (!empty($previewUnpublished) && $modx->hasPermission(\'view_unpublished\')) {
    $scriptProperties[\'showUnpublished\'] = 1;
}

$scriptProperties[\'depth\'] = empty($level) ? 100 : abs($level) - 1;
if (!empty($contexts)) {
    $scriptProperties[\'context\'] = $contexts;
}
if (empty($scriptProperties[\'context\'])) {
    $scriptProperties[\'context\'] = $modx->resource->context_key;
}

// Save original parents specified by user
$specified_parents = array_map(\'trim\', explode(\',\', $scriptProperties[\'parents\']));

if ($scriptProperties[\'parents\'] === \'\') {
    $scriptProperties[\'parents\'] = $modx->resource->id;
} elseif ($scriptProperties[\'parents\'] === 0 || $scriptProperties[\'parents\'] === \'0\') {
    if ($scriptProperties[\'depth\'] !== \'\' && $scriptProperties[\'depth\'] !== 100) {
        $contexts = array_map(\'trim\', explode(\',\', $scriptProperties[\'context\']));
        $parents = array();
        if (!empty($scriptProperties[\'showDeleted\'])) {
            /** @var pdoFetch $pdoFetch */
            $pdoFetch = $modx->getService(\'pdoFetch\');
            foreach ($contexts as $ctx) {
                $parents = array_merge($parents, $pdoFetch->getChildIds(\'modResource\', 0, $scriptProperties[\'depth\'], array(\'context\' => $ctx)));
            }
        } else {
            foreach ($contexts as $ctx) {
                $parents = array_merge($parents, $modx->getChildIds(0, $scriptProperties[\'depth\'], array(\'context\' => $ctx)));
            }
        }
        $scriptProperties[\'parents\'] = !empty($parents) ? implode(\',\', $parents) : \'+0\';
        $scriptProperties[\'depth\'] = 0;
    }
    $scriptProperties[\'includeParents\'] = 1;
    $scriptProperties[\'displayStart\'] = 0;
} else {
    $parents = array_map(\'trim\', explode(\',\', $scriptProperties[\'parents\']));
    $parents_in = $parents_out = array();
    foreach ($parents as $v) {
        if (!is_numeric($v)) {
            continue;
        }
        if ($v[0] == \'-\') {
            $parents_out[] = abs($v);
        } else {
            $parents_in[] = abs($v);
        }
    }

    if (empty($parents_in)) {
        $scriptProperties[\'includeParents\'] = 1;
        $scriptProperties[\'displayStart\'] = 0;
    }
}

if (!empty($displayStart)) {
    $scriptProperties[\'includeParents\'] = 1;
}
if (!empty($ph)) {
    $toPlaceholder = $ph;
}
if (!empty($sortOrder)) {
    $scriptProperties[\'sortdir\'] = $sortOrder;
}
if (!empty($sortBy)) {
    $scriptProperties[\'sortby\'] = $sortBy;
}
if (!empty($permissions)) {
    $scriptProperties[\'checkPermissions\'] = $permissions;
}
if (!empty($cacheResults)) {
    $scriptProperties[\'cache\'] = $cacheResults;
}
if (!empty($ignoreHidden)) {
    $scriptProperties[\'showHidden\'] = $ignoreHidden;
}

$wfTemplates = array(
    \'outerTpl\' => \'tplOuter\',
    \'rowTpl\' => \'tpl\',
    \'parentRowTpl\' => \'tplParentRow\',
    \'parentRowHereTpl\' => \'tplParentRowHere\',
    \'hereTpl\' => \'tplHere\',
    \'innerTpl\' => \'tplInner\',
    \'innerRowTpl\' => \'tplInnerRow\',
    \'innerHereTpl\' => \'tplInnerHere\',
    \'activeParentRowTpl\' => \'tplParentRowActive\',
    \'categoryFoldersTpl\' => \'tplCategoryFolder\',
    \'startItemTpl\' => \'tplStart\',
);
foreach ($wfTemplates as $k => $v) {
    if (isset(${$k})) {
        $scriptProperties[$v] = ${$k};
    }
}
//---

/** @var pdoMenu $pdoMenu */
$fqn = $modx->getOption(\'pdoMenu.class\', null, \'pdotools.pdomenu\', true);
$path = $modx->getOption(\'pdomenu_class_path\', null, MODX_CORE_PATH . \'components/pdotools/model/\', true);
if ($pdoClass = $modx->loadClass($fqn, $path, false, true)) {
    $pdoMenu = new $pdoClass($modx, $scriptProperties);
} else {
    return false;
}
$pdoMenu->pdoTools->addTime(\'pdoTools loaded\');

$cache = !empty($cache) || (!$modx->user->id && !empty($cacheAnonymous));
if (empty($scriptProperties[\'cache_key\'])) {
    $scriptProperties[\'cache_key\'] = \'pdomenu/\' . sha1(serialize($scriptProperties));
}

$output = \'\';
$tree = array();
if ($cache) {
    $tree = $pdoMenu->pdoTools->getCache($scriptProperties);
}
if (empty($tree)) {
    $data = $pdoMenu->pdoTools->run();
    $data = $pdoMenu->pdoTools->buildTree($data, \'id\', \'parent\', $specified_parents);
    $tree = array();
    foreach ($data as $k => $v) {
        if (empty($v[\'id\'])) {
            if (!in_array($k, $specified_parents) && !$pdoMenu->checkResource($k)) {
                continue;
            } else {
                $tree = array_merge($tree, $v[\'children\']);
            }
        } else {
            $tree[$k] = $v;
        }
    }
    if ($cache) {
        $pdoMenu->pdoTools->setCache($tree, $scriptProperties);
    }
}
if (isset($return) && $return === \'data\') {
    return $tree;
}
if (!empty($tree)) {
    $output = $pdoMenu->templateTree($tree);
}

if ($modx->user->hasSessionContext(\'mgr\') && !empty($showLog)) {
    $output .= \'<pre class="pdoMenuLog">\' . print_r($pdoMenu->pdoTools->getTime(), 1) . \'</pre>\';
}

if (!empty($toPlaceholder)) {
    $modx->setPlaceholder($toPlaceholder, $output);
} else {
    return $output;
}',
          'locked' => false,
          'properties' => 
          array (
            'showLog' => 
            array (
              'name' => 'showLog',
              'desc' => 'pdotools_prop_showLog',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать дополнительную информацию о работе сниппета. Только для авторизованных в контекте "mgr".',
              'area_trans' => '',
            ),
            'fastMode' => 
            array (
              'name' => 'fastMode',
              'desc' => 'pdotools_prop_fastMode',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Быстрый режим обработки чанков. Все необработанные теги (условия, сниппеты и т.п.) будут вырезаны.',
              'area_trans' => '',
            ),
            'level' => 
            array (
              'name' => 'level',
              'desc' => 'pdotools_prop_level',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 0,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Уровень генерируемого меню.',
              'area_trans' => '',
            ),
            'parents' => 
            array (
              'name' => 'parents',
              'desc' => 'pdotools_prop_parents',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список родителей, через запятую, для поиска результатов. По умолчанию выборка ограничена текущим родителем. Если поставить 0 - выборка не ограничивается. Если id родителя начинается с дефиса, он и его потомки исключается из выборки.',
              'area_trans' => '',
            ),
            'displayStart' => 
            array (
              'name' => 'displayStart',
              'desc' => 'pdotools_prop_displayStart',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Включить показ начальных узлов меню. Полезно при указании более одного "parents".',
              'area_trans' => '',
            ),
            'resources' => 
            array (
              'name' => 'resources',
              'desc' => 'pdotools_prop_resources',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список ресурсов, через запятую, для вывода в результатах. Если id ресурса начинается с дефиса, этот ресурс исключается из выборки.',
              'area_trans' => '',
            ),
            'templates' => 
            array (
              'name' => 'templates',
              'desc' => 'pdotools_prop_templates',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список шаблонов, через запятую, для фильтрации результатов. Если id шаблона начинается с дефиса, ресурсы с ним исключается из выборки.',
              'area_trans' => '',
            ),
            'context' => 
            array (
              'name' => 'context',
              'desc' => 'pdotools_prop_context',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Ограничение выборки по контексту ресурсов.',
              'area_trans' => '',
            ),
            'cache' => 
            array (
              'name' => 'cache',
              'desc' => 'pdotools_prop_cache',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Кэширование результатов работы сниппета.',
              'area_trans' => '',
            ),
            'cacheTime' => 
            array (
              'name' => 'cacheTime',
              'desc' => 'pdotools_prop_cacheTime',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 3600,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Время актуальности кэша в секундах.',
              'area_trans' => '',
            ),
            'cacheAnonymous' => 
            array (
              'name' => 'cacheAnonymous',
              'desc' => 'pdotools_prop_cacheAnonymous',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Включить кэширование только для неавторизованных посетителей.',
              'area_trans' => '',
            ),
            'plPrefix' => 
            array (
              'name' => 'plPrefix',
              'desc' => 'pdotools_prop_plPrefix',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'wf.',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Префикс для выставляемых плейсхолдеров, по умолчанию "wf.".',
              'area_trans' => '',
            ),
            'showHidden' => 
            array (
              'name' => 'showHidden',
              'desc' => 'pdotools_prop_showHidden',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать ресурсы, скрытые в меню.',
              'area_trans' => '',
            ),
            'showUnpublished' => 
            array (
              'name' => 'showUnpublished',
              'desc' => 'pdotools_prop_showUnpublished',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать неопубликованные ресурсы.',
              'area_trans' => '',
            ),
            'showDeleted' => 
            array (
              'name' => 'showDeleted',
              'desc' => 'pdotools_prop_showDeleted',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать удалённые ресурсы.',
              'area_trans' => '',
            ),
            'previewUnpublished' => 
            array (
              'name' => 'previewUnpublished',
              'desc' => 'pdotools_prop_previewUnpublished',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Включить показ неопубликованных документов, если у пользователя есть на это разрешение.',
              'area_trans' => '',
            ),
            'hideSubMenus' => 
            array (
              'name' => 'hideSubMenus',
              'desc' => 'pdotools_prop_hideSubMenus',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Спрятать неактивные ветки меню.',
              'area_trans' => '',
            ),
            'useWeblinkUrl' => 
            array (
              'name' => 'useWeblinkUrl',
              'desc' => 'pdotools_prop_useWeblinkUrl',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => true,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Генерировать ссылку с учетом класса ресурса.',
              'area_trans' => '',
            ),
            'sortdir' => 
            array (
              'name' => 'sortdir',
              'desc' => 'pdotools_prop_sortdir',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'text' => 'ASC',
                  'value' => 'ASC',
                  'name' => 'ASC',
                ),
                1 => 
                array (
                  'text' => 'DESC',
                  'value' => 'DESC',
                  'name' => 'DESC',
                ),
              ),
              'value' => 'ASC',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Направление сортировки: по убыванию или возрастанию.',
              'area_trans' => '',
            ),
            'sortby' => 
            array (
              'name' => 'sortby',
              'desc' => 'pdotools_prop_sortby',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'menuindex',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Любое поле ресурса для сортировки, включая ТВ параметр, если он указан в параметре "includeTVs". Можно указывать JSON строку с массивом нескольких полей. Для случайно сортировки укажите "RAND()"',
              'area_trans' => '',
            ),
            'limit' => 
            array (
              'name' => 'limit',
              'desc' => 'pdotools_prop_limit',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 0,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Ограничение количества результатов выборки. Можно использовать "0".',
              'area_trans' => '',
            ),
            'offset' => 
            array (
              'name' => 'offset',
              'desc' => 'pdotools_prop_offset',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 0,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Пропуск результатов от начала.',
              'area_trans' => '',
            ),
            'rowIdPrefix' => 
            array (
              'name' => 'rowIdPrefix',
              'desc' => 'pdotools_prop_rowIdPrefix',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Префикс id="" для выставления идентификатора в чанк.',
              'area_trans' => '',
            ),
            'firstClass' => 
            array (
              'name' => 'firstClass',
              'desc' => 'pdotools_prop_firstClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'first',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс для первого пункта меню.',
              'area_trans' => '',
            ),
            'lastClass' => 
            array (
              'name' => 'lastClass',
              'desc' => 'pdotools_prop_lastClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'last',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс последнего пункта меню.',
              'area_trans' => '',
            ),
            'hereClass' => 
            array (
              'name' => 'hereClass',
              'desc' => 'pdotools_prop_hereClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'active',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс для активного пункта меню.',
              'area_trans' => '',
            ),
            'parentClass' => 
            array (
              'name' => 'parentClass',
              'desc' => 'pdotools_prop_parentClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс категории меню.',
              'area_trans' => '',
            ),
            'rowClass' => 
            array (
              'name' => 'rowClass',
              'desc' => 'pdotools_prop_rowClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс одной строки меню.',
              'area_trans' => '',
            ),
            'outerClass' => 
            array (
              'name' => 'outerClass',
              'desc' => 'pdotools_prop_outerClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс обертки меню.',
              'area_trans' => '',
            ),
            'innerClass' => 
            array (
              'name' => 'innerClass',
              'desc' => 'pdotools_prop_innerClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс внутренних ссылок меню.',
              'area_trans' => '',
            ),
            'levelClass' => 
            array (
              'name' => 'levelClass',
              'desc' => 'pdotools_prop_levelClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс уровня меню. Например, если укажите "level", то будет "level1", "level2" и т.д.',
              'area_trans' => '',
            ),
            'selfClass' => 
            array (
              'name' => 'selfClass',
              'desc' => 'pdotools_prop_selfClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс текущего документа в меню.',
              'area_trans' => '',
            ),
            'webLinkClass' => 
            array (
              'name' => 'webLinkClass',
              'desc' => 'pdotools_prop_webLinkClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс документа-ссылки.',
              'area_trans' => '',
            ),
            'tplOuter' => 
            array (
              'name' => 'tplOuter',
              'desc' => 'pdotools_prop_tplOuter',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <ul[[+classes]]>[[+wrapper]]</ul>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк-обёртка всего блока меню.',
              'area_trans' => '',
            ),
            'tpl' => 
            array (
              'name' => 'tpl',
              'desc' => 'pdotools_prop_tpl',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li[[+classes]]><a href="[[+link]]" [[+attributes]]>[[+menutitle]]</a>[[+wrapper]]</li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Имя чанка для оформления ресурса. Если не указан, то содержимое полей ресурса будет распечатано на экран.',
              'area_trans' => '',
            ),
            'tplParentRow' => 
            array (
              'name' => 'tplParentRow',
              'desc' => 'pdotools_prop_tplParentRow',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления контейнера с потомками.',
              'area_trans' => '',
            ),
            'tplParentRowHere' => 
            array (
              'name' => 'tplParentRowHere',
              'desc' => 'pdotools_prop_tplParentRowHere',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления текущего контейнера с потомками.',
              'area_trans' => '',
            ),
            'tplHere' => 
            array (
              'name' => 'tplHere',
              'desc' => 'pdotools_prop_tplHere',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк текущего документа',
              'area_trans' => '',
            ),
            'tplInner' => 
            array (
              'name' => 'tplInner',
              'desc' => 'pdotools_prop_tplInner',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк-обёртка внутренних пунктов меню. Если пуст - будет использовать "tplOuter".',
              'area_trans' => '',
            ),
            'tplInnerRow' => 
            array (
              'name' => 'tplInnerRow',
              'desc' => 'pdotools_prop_tplInnerRow',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления одного пункта меню.',
              'area_trans' => '',
            ),
            'tplInnerHere' => 
            array (
              'name' => 'tplInnerHere',
              'desc' => 'pdotools_prop_tplInnerHere',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления активного пункта меню.',
              'area_trans' => '',
            ),
            'tplParentRowActive' => 
            array (
              'name' => 'tplParentRowActive',
              'desc' => 'pdotools_prop_tplParentRowActive',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления активного контейнера с потомками.',
              'area_trans' => '',
            ),
            'tplCategoryFolder' => 
            array (
              'name' => 'tplCategoryFolder',
              'desc' => 'pdotools_prop_tplCategoryFolder',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Специальный чанк оформления категории. Категория - это документ с потомками и или нулевым шаблоном, или с атрибутом "rel=\\"category\\"".',
              'area_trans' => '',
            ),
            'tplStart' => 
            array (
              'name' => 'tplStart',
              'desc' => 'pdotools_prop_tplStart',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <h2[[+classes]]>[[+menutitle]]</h2>[[+wrapper]]',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления корневого пункта, при условии, что включен "displayStart".',
              'area_trans' => '',
            ),
            'checkPermissions' => 
            array (
              'name' => 'checkPermissions',
              'desc' => 'pdotools_prop_checkPermissions',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Укажите, какие разрешения нужно проверять у пользователя при выводе документов.',
              'area_trans' => '',
            ),
            'hereId' => 
            array (
              'name' => 'hereId',
              'desc' => 'pdotools_prop_hereId',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Id документа, текущего для генерируемого меню. Нужно указывать только если скрипт сам его неверно определяет, например при выводе меню из чанка другого сниппета.',
              'area_trans' => '',
            ),
            'where' => 
            array (
              'name' => 'where',
              'desc' => 'pdotools_prop_where',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Массив дополнительных параметров выборки, закодированный в JSON.',
              'area_trans' => '',
            ),
            'select' => 
            array (
              'name' => 'select',
              'desc' => 'pdotools_prop_select',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список полей для выборки, через запятую. Можно указывать JSON строку с массивом, например {"modResource":"id,pagetitle,content"}.',
              'area_trans' => '',
            ),
            'scheme' => 
            array (
              'name' => 'scheme',
              'desc' => 'pdotools_prop_scheme',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'value' => '',
                  'text' => 'System default',
                  'name' => 'System default',
                ),
                1 => 
                array (
                  'value' => -1,
                  'text' => '-1 (relative to site_url)',
                  'name' => '-1 (relative to site_url)',
                ),
                2 => 
                array (
                  'value' => 'full',
                  'text' => 'full (absolute, prepended with site_url)',
                  'name' => 'full (absolute, prepended with site_url)',
                ),
                3 => 
                array (
                  'value' => 'abs',
                  'text' => 'abs (absolute, prepended with base_url)',
                  'name' => 'abs (absolute, prepended with base_url)',
                ),
                4 => 
                array (
                  'value' => 'http',
                  'text' => 'http (absolute, forced to http scheme)',
                  'name' => 'http (absolute, forced to http scheme)',
                ),
                5 => 
                array (
                  'value' => 'https',
                  'text' => 'https (absolute, forced to https scheme)',
                  'name' => 'https (absolute, forced to https scheme)',
                ),
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Схема формирования ссылок: "uri" для подстановки поля uri документа (очень быстро) или параметр для modX::makeUrl().',
              'area_trans' => '',
            ),
            'toPlaceholder' => 
            array (
              'name' => 'toPlaceholder',
              'desc' => 'pdotools_prop_toPlaceholder',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Если не пусто, сниппет сохранит все данные в плейсхолдер с этим именем, вместо вывода не экран.',
              'area_trans' => '',
            ),
            'countChildren' => 
            array (
              'name' => 'countChildren',
              'desc' => 'pdotools_prop_countChildren',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Вывести точное количество активных потомков документа в плейсхолдер [[+children]].',
              'area_trans' => '',
            ),
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => 'core/components/pdotools/elements/snippets/snippet.pdomenu.php',
          'content' => '/** @var array $scriptProperties */
/** @var modX $modx */

// Convert parameters from Wayfinder if exists
if (isset($startId)) {
    $scriptProperties[\'parents\'] = $startId;
}
if (!empty($includeDocs)) {
    $tmp = array_map(\'trim\', explode(\',\', $includeDocs));
    foreach ($tmp as $v) {
        if (!empty($scriptProperties[\'resources\'])) {
            $scriptProperties[\'resources\'] .= \',\' . $v;
        } else {
            $scriptProperties[\'resources\'] = $v;
        }
    }
}
if (!empty($excludeDocs)) {
    $tmp = array_map(\'trim\', explode(\',\', $excludeDocs));
    foreach ($tmp as $v) {
        if (!empty($scriptProperties[\'resources\'])) {
            $scriptProperties[\'resources\'] .= \',-\' . $v;
        } else {
            $scriptProperties[\'resources\'] = \'-\' . $v;
        }
    }
}

if (!empty($previewUnpublished) && $modx->hasPermission(\'view_unpublished\')) {
    $scriptProperties[\'showUnpublished\'] = 1;
}

$scriptProperties[\'depth\'] = empty($level) ? 100 : abs($level) - 1;
if (!empty($contexts)) {
    $scriptProperties[\'context\'] = $contexts;
}
if (empty($scriptProperties[\'context\'])) {
    $scriptProperties[\'context\'] = $modx->resource->context_key;
}

// Save original parents specified by user
$specified_parents = array_map(\'trim\', explode(\',\', $scriptProperties[\'parents\']));

if ($scriptProperties[\'parents\'] === \'\') {
    $scriptProperties[\'parents\'] = $modx->resource->id;
} elseif ($scriptProperties[\'parents\'] === 0 || $scriptProperties[\'parents\'] === \'0\') {
    if ($scriptProperties[\'depth\'] !== \'\' && $scriptProperties[\'depth\'] !== 100) {
        $contexts = array_map(\'trim\', explode(\',\', $scriptProperties[\'context\']));
        $parents = array();
        if (!empty($scriptProperties[\'showDeleted\'])) {
            /** @var pdoFetch $pdoFetch */
            $pdoFetch = $modx->getService(\'pdoFetch\');
            foreach ($contexts as $ctx) {
                $parents = array_merge($parents, $pdoFetch->getChildIds(\'modResource\', 0, $scriptProperties[\'depth\'], array(\'context\' => $ctx)));
            }
        } else {
            foreach ($contexts as $ctx) {
                $parents = array_merge($parents, $modx->getChildIds(0, $scriptProperties[\'depth\'], array(\'context\' => $ctx)));
            }
        }
        $scriptProperties[\'parents\'] = !empty($parents) ? implode(\',\', $parents) : \'+0\';
        $scriptProperties[\'depth\'] = 0;
    }
    $scriptProperties[\'includeParents\'] = 1;
    $scriptProperties[\'displayStart\'] = 0;
} else {
    $parents = array_map(\'trim\', explode(\',\', $scriptProperties[\'parents\']));
    $parents_in = $parents_out = array();
    foreach ($parents as $v) {
        if (!is_numeric($v)) {
            continue;
        }
        if ($v[0] == \'-\') {
            $parents_out[] = abs($v);
        } else {
            $parents_in[] = abs($v);
        }
    }

    if (empty($parents_in)) {
        $scriptProperties[\'includeParents\'] = 1;
        $scriptProperties[\'displayStart\'] = 0;
    }
}

if (!empty($displayStart)) {
    $scriptProperties[\'includeParents\'] = 1;
}
if (!empty($ph)) {
    $toPlaceholder = $ph;
}
if (!empty($sortOrder)) {
    $scriptProperties[\'sortdir\'] = $sortOrder;
}
if (!empty($sortBy)) {
    $scriptProperties[\'sortby\'] = $sortBy;
}
if (!empty($permissions)) {
    $scriptProperties[\'checkPermissions\'] = $permissions;
}
if (!empty($cacheResults)) {
    $scriptProperties[\'cache\'] = $cacheResults;
}
if (!empty($ignoreHidden)) {
    $scriptProperties[\'showHidden\'] = $ignoreHidden;
}

$wfTemplates = array(
    \'outerTpl\' => \'tplOuter\',
    \'rowTpl\' => \'tpl\',
    \'parentRowTpl\' => \'tplParentRow\',
    \'parentRowHereTpl\' => \'tplParentRowHere\',
    \'hereTpl\' => \'tplHere\',
    \'innerTpl\' => \'tplInner\',
    \'innerRowTpl\' => \'tplInnerRow\',
    \'innerHereTpl\' => \'tplInnerHere\',
    \'activeParentRowTpl\' => \'tplParentRowActive\',
    \'categoryFoldersTpl\' => \'tplCategoryFolder\',
    \'startItemTpl\' => \'tplStart\',
);
foreach ($wfTemplates as $k => $v) {
    if (isset(${$k})) {
        $scriptProperties[$v] = ${$k};
    }
}
//---

/** @var pdoMenu $pdoMenu */
$fqn = $modx->getOption(\'pdoMenu.class\', null, \'pdotools.pdomenu\', true);
$path = $modx->getOption(\'pdomenu_class_path\', null, MODX_CORE_PATH . \'components/pdotools/model/\', true);
if ($pdoClass = $modx->loadClass($fqn, $path, false, true)) {
    $pdoMenu = new $pdoClass($modx, $scriptProperties);
} else {
    return false;
}
$pdoMenu->pdoTools->addTime(\'pdoTools loaded\');

$cache = !empty($cache) || (!$modx->user->id && !empty($cacheAnonymous));
if (empty($scriptProperties[\'cache_key\'])) {
    $scriptProperties[\'cache_key\'] = \'pdomenu/\' . sha1(serialize($scriptProperties));
}

$output = \'\';
$tree = array();
if ($cache) {
    $tree = $pdoMenu->pdoTools->getCache($scriptProperties);
}
if (empty($tree)) {
    $data = $pdoMenu->pdoTools->run();
    $data = $pdoMenu->pdoTools->buildTree($data, \'id\', \'parent\', $specified_parents);
    $tree = array();
    foreach ($data as $k => $v) {
        if (empty($v[\'id\'])) {
            if (!in_array($k, $specified_parents) && !$pdoMenu->checkResource($k)) {
                continue;
            } else {
                $tree = array_merge($tree, $v[\'children\']);
            }
        } else {
            $tree[$k] = $v;
        }
    }
    if ($cache) {
        $pdoMenu->pdoTools->setCache($tree, $scriptProperties);
    }
}
if (isset($return) && $return === \'data\') {
    return $tree;
}
if (!empty($tree)) {
    $output = $pdoMenu->templateTree($tree);
}

if ($modx->user->hasSessionContext(\'mgr\') && !empty($showLog)) {
    $output .= \'<pre class="pdoMenuLog">\' . print_r($pdoMenu->pdoTools->getTime(), 1) . \'</pre>\';
}

if (!empty($toPlaceholder)) {
    $modx->setPlaceholder($toPlaceholder, $output);
} else {
    return $output;
}',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'pdoCrumbs' => 
      array (
        'fields' => 
        array (
          'id' => 10,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'pdoCrumbs',
          'description' => '',
          'editor_type' => 0,
          'category' => 4,
          'cache_type' => 0,
          'snippet' => '/** @var array $scriptProperties */
/** @var pdoFetch $pdoFetch */
/** @var modX $modx */
$fqn = $modx->getOption(\'pdoFetch.class\', null, \'pdotools.pdofetch\', true);
$path = $modx->getOption(\'pdofetch_class_path\', null, MODX_CORE_PATH . \'components/pdotools/model/\', true);
if ($pdoClass = $modx->loadClass($fqn, $path, false, true)) {
    $pdoFetch = new $pdoClass($modx, $scriptProperties);
} else {
    return false;
}
$pdoFetch->addTime(\'pdoTools loaded\');

if (!isset($from) || $from == \'\') {
    $from = 0;
}
if (empty($to)) {
    $to = $modx->resource->id;
}
if (empty($direction)) {
    $direction = \'ltr\';
}
if ($outputSeparator == \'&nbsp;&rarr;&nbsp;\' && $direction == \'rtl\') {
    $outputSeparator = \'&nbsp;&larr;&nbsp;\';
}
if ($limit == \'\') {
    $limit = 10;
}

// For compatibility with BreadCrumb
if (!empty($maxCrumbs)) {
    $limit = $maxCrumbs;
}
if (!empty($containerTpl)) {
    $tplWrapper = $containerTpl;
}
if (!empty($currentCrumbTpl)) {
    $tplCurrent = $currentCrumbTpl;
}
if (!empty($linkCrumbTpl)) {
    $scriptProperties[\'tpl\'] = $linkCrumbTpl;
}
if (!empty($maxCrumbTpl)) {
    $tplMax = $maxCrumbTpl;
}
if (isset($showBreadCrumbsAtHome)) {
    $showAtHome = $showBreadCrumbsAtHome;
}
if (isset($showHomeCrumb)) {
    $showHome = $showHomeCrumb;
}
if (isset($showCurrentCrumb)) {
    $showCurrent = $showCurrentCrumb;
}
// --
$fastMode = !empty($fastMode);
$siteStart = $modx->getOption(\'siteStart\', $scriptProperties, $modx->getOption(\'site_start\'));

if (empty($showAtHome) && $modx->resource->id == $siteStart) {
    return \'\';
}

$class = $modx->getOption(\'class\', $scriptProperties, \'modResource\');
// Start building "Where" expression
$where = array();
if (empty($showUnpublished) && empty($showUnPub)) {
    $where[\'published\'] = 1;
}
if (empty($showHidden)) {
    $where[\'hidemenu\'] = 0;
}
if (empty($showDeleted)) {
    $where[\'deleted\'] = 0;
}
if (!empty($hideContainers) && empty($showContainer)) {
    $where[\'isfolder\'] = 0;
}

$resource = ($to == $modx->resource->id)
    ? $modx->resource
    : $modx->getObject($class, $to);

if (!$resource) {
    $message = \'Could not build breadcrumbs to resource "\' . $to . \'"\';

    return \'\';
}

if (!empty($customParents)) {
    $customParents = is_array($customParents) ? $customParents : array_map(\'trim\', explode(\',\', $customParents));
    $parents = is_array($customParents) ? array_reverse($customParents) : array();
}
if (empty($parents)) {
    $parents = $modx->getParentIds($resource->id, $limit, array(\'context\' => $resource->get(\'context_key\')));
}
if (!empty($showHome)) {
    $parents[] = $siteStart;
}

$ids = array($resource->id);
foreach ($parents as $parent) {
    if (!empty($parent)) {
        $ids[] = $parent;
    }
    if (!empty($from) && $parent == $from) {
        break;
    }
}
$where[\'id:IN\'] = $ids;

if (!empty($exclude)) {
    $where[\'id:NOT IN\'] = array_map(\'trim\', explode(\',\', $exclude));
}

// Fields to select
$resourceColumns = array_keys($modx->getFieldMeta($class));
$select = array($class => implode(\',\', $resourceColumns));

// Add custom parameters
foreach (array(\'where\', \'select\') as $v) {
    if (!empty($scriptProperties[$v])) {
        $tmp = $scriptProperties[$v];
        if (!is_array($tmp)) {
            $tmp = json_decode($tmp, true);
        }
        if (is_array($tmp)) {
            $$v = array_merge($$v, $tmp);
        }
    }
    unset($scriptProperties[$v]);
}
$pdoFetch->addTime(\'Conditions prepared\');

// Default parameters
$default = array(
    \'class\' => $class,
    \'where\' => json_encode($where),
    \'select\' => json_encode($select),
    \'groupby\' => $class . \'.id\',
    \'sortby\' => "find_in_set(`$class`.`id`,\'" . implode(\',\', $ids) . "\')",
    \'sortdir\' => \'\',
    \'return\' => \'data\',
    \'totalVar\' => \'pdocrumbs.total\',
    \'disableConditions\' => true,
);

// Merge all properties and run!
$pdoFetch->addTime(\'Query parameters ready\');
$pdoFetch->setConfig(array_merge($default, $scriptProperties), false);
$rows = $pdoFetch->run();

$output = [];
if (!empty($rows) && is_array($rows)) {
    if (strtolower($direction) == \'ltr\') {
        $rows = array_reverse($rows);
    }

    foreach ($rows as $row) {
        if (!empty($useWeblinkUrl) && $row[\'class_key\'] == \'modWebLink\') {
            $row[\'link\'] = is_numeric(trim($row[\'content\'], \'[]~ \'))
                ? $pdoFetch->makeUrl((int)trim($row[\'content\'], \'[]~ \'), $row)
                : $row[\'content\'];
        } else {
            $row[\'link\'] = $pdoFetch->makeUrl($row[\'id\'], $row);
        }

        $row = array_merge(
            $scriptProperties,
            $row,
            [\'idx\' => $pdoFetch->idx++]
        );
        if (empty($row[\'menutitle\'])) {
            $row[\'menutitle\'] = $row[\'pagetitle\'];
        }

        if (isset($return) && $return === \'data\') {
            $output[] = $row;
            continue;
        }
        if ($row[\'id\'] == $resource->id && empty($showCurrent)) {
            continue;
        } elseif ($row[\'id\'] == $resource->id && !empty($tplCurrent)) {
            $tpl = $tplCurrent;
        } elseif ($row[\'id\'] == $siteStart && !empty($tplHome)) {
            $tpl = $tplHome;
        } else {
            $tpl = $pdoFetch->defineChunk($row);
        }
        $output[] = empty($tpl)
            ? \'<pre>\' . $pdoFetch->getChunk(\'\', $row) . \'</pre>\'
            : $pdoFetch->getChunk($tpl, $row, $fastMode);
    }
}
if (isset($return) && $return === \'data\') {
    return $output;
}

$pdoFetch->addTime(\'Chunks processed\');

if (count($output) == 1 && !empty($hideSingle)) {
    $pdoFetch->addTime(\'The only result was hidden, because the parameter "hideSingle" activated\');
    $output = array();
}

$log = \'\';
if ($modx->user->hasSessionContext(\'mgr\') && !empty($showLog)) {
    $log .= \'<pre class="pdoCrumbsLog">\' . print_r($pdoFetch->getTime(), 1) . \'</pre>\';
}

if (!empty($toSeparatePlaceholders)) {
    $output[\'log\'] = $log;
    $modx->setPlaceholders($output, $toSeparatePlaceholders);
} else {
    $output = implode($outputSeparator, $output);
    if ($pdoFetch->idx >= $limit && !empty($tplMax) && !empty($output)) {
        $output = ($direction == \'ltr\')
            ? $pdoFetch->getChunk($tplMax, array(), $fastMode) . $output
            : $output . $pdoFetch->getChunk($tplMax, array(), $fastMode);
    }
    $output .= $log;

    if (!empty($tplWrapper) && (!empty($wrapIfEmpty) || !empty($output))) {
        $output = $pdoFetch->getChunk($tplWrapper, array(\'output\' => $output, \'crumbs\' => $output), $fastMode);
    }

    if (!empty($toPlaceholder)) {
        $modx->setPlaceholder($toPlaceholder, $output);
    } else {
        return $output;
    }
}',
          'locked' => false,
          'properties' => 
          array (
            'showLog' => 
            array (
              'name' => 'showLog',
              'desc' => 'pdotools_prop_showLog',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать дополнительную информацию о работе сниппета. Только для авторизованных в контекте "mgr".',
              'area_trans' => '',
            ),
            'fastMode' => 
            array (
              'name' => 'fastMode',
              'desc' => 'pdotools_prop_fastMode',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Быстрый режим обработки чанков. Все необработанные теги (условия, сниппеты и т.п.) будут вырезаны.',
              'area_trans' => '',
            ),
            'from' => 
            array (
              'name' => 'from',
              'desc' => 'pdotools_prop_from',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 0,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Id ресурса, от которого строить хлебные крошки. Обычно это корень сайта, то есть "0".',
              'area_trans' => '',
            ),
            'to' => 
            array (
              'name' => 'to',
              'desc' => 'pdotools_prop_to',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Id ресурса для которого строятся хлебные крошки. По умолчанию это id текущей страницы.',
              'area_trans' => '',
            ),
            'customParents' => 
            array (
              'name' => 'customParents',
              'desc' => 'pdotools_prop_customParents',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список id через запятую для кастомного построения хлебных крошек.',
              'area_trans' => '',
            ),
            'limit' => 
            array (
              'name' => 'limit',
              'desc' => 'pdotools_prop_limit',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 10,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Ограничение количества результатов выборки. Можно использовать "0".',
              'area_trans' => '',
            ),
            'exclude' => 
            array (
              'name' => 'exclude',
              'desc' => 'pdotools_prop_exclude',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список id ресурсов, которые нужно исключить из выборки.',
              'area_trans' => '',
            ),
            'outputSeparator' => 
            array (
              'name' => 'outputSeparator',
              'desc' => 'pdotools_prop_outputSeparator',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '
',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Необязательная строка для разделения результатов работы.',
              'area_trans' => '',
            ),
            'toPlaceholder' => 
            array (
              'name' => 'toPlaceholder',
              'desc' => 'pdotools_prop_toPlaceholder',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Если не пусто, сниппет сохранит все данные в плейсхолдер с этим именем, вместо вывода не экран.',
              'area_trans' => '',
            ),
            'includeTVs' => 
            array (
              'name' => 'includeTVs',
              'desc' => 'pdotools_prop_includeTVs',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список ТВ параметров для выборки, через запятую. Например: "action,time" дадут плейсхолдеры [[+action]] и [[+time]].',
              'area_trans' => '',
            ),
            'prepareTVs' => 
            array (
              'name' => 'prepareTVs',
              'desc' => 'pdotools_prop_prepareTVs',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '1',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список ТВ параметров, которые нужно подготовить перед выводом. По умолчанию, установлено в "1", что означает подготовку всех ТВ, указанных в "&includeTVs=``"',
              'area_trans' => '',
            ),
            'processTVs' => 
            array (
              'name' => 'processTVs',
              'desc' => 'pdotools_prop_processTVs',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список ТВ параметров, которые нужно обработать перед выводом. Если установить в "1" - будут обработаны все ТВ, указанные в "&includeTVs=``". По умолчанию параметр пуст.',
              'area_trans' => '',
            ),
            'tvPrefix' => 
            array (
              'name' => 'tvPrefix',
              'desc' => 'pdotools_prop_tvPrefix',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'tv.',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Префикс для ТВ параметров.',
              'area_trans' => '',
            ),
            'where' => 
            array (
              'name' => 'where',
              'desc' => 'pdotools_prop_where',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Массив дополнительных параметров выборки, закодированный в JSON.',
              'area_trans' => '',
            ),
            'showUnpublished' => 
            array (
              'name' => 'showUnpublished',
              'desc' => 'pdotools_prop_showUnpublished',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать неопубликованные ресурсы.',
              'area_trans' => '',
            ),
            'showDeleted' => 
            array (
              'name' => 'showDeleted',
              'desc' => 'pdotools_prop_showDeleted',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать удалённые ресурсы.',
              'area_trans' => '',
            ),
            'showHidden' => 
            array (
              'name' => 'showHidden',
              'desc' => 'pdotools_prop_showHidden',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => true,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать ресурсы, скрытые в меню.',
              'area_trans' => '',
            ),
            'hideContainers' => 
            array (
              'name' => 'hideContainers',
              'desc' => 'pdotools_prop_hideContainers',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Отключает вывод контейнеров, то есть, ресурсов с isfolder = 1.',
              'area_trans' => '',
            ),
            'tpl' => 
            array (
              'name' => 'tpl',
              'desc' => 'pdotools_prop_tpl',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li class="breadcrumb-item"><a href="[[+link]]">[[+menutitle]]</a></li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Имя чанка для оформления ресурса. Если не указан, то содержимое полей ресурса будет распечатано на экран.',
              'area_trans' => '',
            ),
            'tplCurrent' => 
            array (
              'name' => 'tplCurrent',
              'desc' => 'pdotools_prop_tplCurrent',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li class="breadcrumb-item active">[[+menutitle]]</li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления текущего документа в навигации.',
              'area_trans' => '',
            ),
            'tplMax' => 
            array (
              'name' => 'tplMax',
              'desc' => 'pdotools_prop_tplMax',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li class="breadcrumb-item disabled">&nbsp;...&nbsp;</li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк, который добавляется в начало результатов, если их больше чем "&limit".',
              'area_trans' => '',
            ),
            'tplHome' => 
            array (
              'name' => 'tplHome',
              'desc' => 'pdotools_prop_tplHome',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления ссылки на главную страницу.',
              'area_trans' => '',
            ),
            'tplWrapper' => 
            array (
              'name' => 'tplWrapper',
              'desc' => 'pdotools_prop_tplWrapper',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <ol class="breadcrumb">[[+output]]</ol>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк-обёртка, для заворачивания всех результатов. Понимает один плейсхолдер: [[+output]]. Не работает вместе с параметром "toSeparatePlaceholders".',
              'area_trans' => '',
            ),
            'wrapIfEmpty' => 
            array (
              'name' => 'wrapIfEmpty',
              'desc' => 'pdotools_prop_wrapIfEmpty',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Включает вывод чанка-обертки (tplWrapper) даже если результатов нет.',
              'area_trans' => '',
            ),
            'showCurrent' => 
            array (
              'name' => 'showCurrent',
              'desc' => 'pdotools_prop_showCurrent',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => true,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Выводить текущий документ в навигации.',
              'area_trans' => '',
            ),
            'showHome' => 
            array (
              'name' => 'showHome',
              'desc' => 'pdotools_prop_showHome',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Выводить ссылку на главную в начале навигации.',
              'area_trans' => '',
            ),
            'showAtHome' => 
            array (
              'name' => 'showAtHome',
              'desc' => 'pdotools_prop_showAtHome',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => true,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать хлебные крошки на главной странице сайта.',
              'area_trans' => '',
            ),
            'hideSingle' => 
            array (
              'name' => 'hideSingle',
              'desc' => 'pdotools_prop_hideSingle',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Не выводить результат, если он один единственный.',
              'area_trans' => '',
            ),
            'direction' => 
            array (
              'name' => 'direction',
              'desc' => 'pdotools_prop_direction',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'value' => 'ltr',
                  'text' => 'Left To Right (ltr)',
                  'name' => 'Left To Right (ltr)',
                ),
                1 => 
                array (
                  'value' => 'rtl',
                  'text' => 'Right To Left (rtl)',
                  'name' => 'Right To Left (rtl)',
                ),
              ),
              'value' => 'ltr',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Направление навигации: слева направо (ltr) или справа налево (rtl), например для Арабского языка.',
              'area_trans' => '',
            ),
            'scheme' => 
            array (
              'name' => 'scheme',
              'desc' => 'pdotools_prop_scheme',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'value' => '',
                  'text' => 'System default',
                  'name' => 'System default',
                ),
                1 => 
                array (
                  'value' => -1,
                  'text' => '-1 (relative to site_url)',
                  'name' => '-1 (relative to site_url)',
                ),
                2 => 
                array (
                  'value' => 'full',
                  'text' => 'full (absolute, prepended with site_url)',
                  'name' => 'full (absolute, prepended with site_url)',
                ),
                3 => 
                array (
                  'value' => 'abs',
                  'text' => 'abs (absolute, prepended with base_url)',
                  'name' => 'abs (absolute, prepended with base_url)',
                ),
                4 => 
                array (
                  'value' => 'http',
                  'text' => 'http (absolute, forced to http scheme)',
                  'name' => 'http (absolute, forced to http scheme)',
                ),
                5 => 
                array (
                  'value' => 'https',
                  'text' => 'https (absolute, forced to https scheme)',
                  'name' => 'https (absolute, forced to https scheme)',
                ),
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Схема формирования ссылок: "uri" для подстановки поля uri документа (очень быстро) или параметр для modX::makeUrl().',
              'area_trans' => '',
            ),
            'useWeblinkUrl' => 
            array (
              'name' => 'useWeblinkUrl',
              'desc' => 'pdotools_prop_useWeblinkUrl',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => true,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Генерировать ссылку с учетом класса ресурса.',
              'area_trans' => '',
            ),
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => 'core/components/pdotools/elements/snippets/snippet.pdocrumbs.php',
          'content' => '/** @var array $scriptProperties */
/** @var pdoFetch $pdoFetch */
/** @var modX $modx */
$fqn = $modx->getOption(\'pdoFetch.class\', null, \'pdotools.pdofetch\', true);
$path = $modx->getOption(\'pdofetch_class_path\', null, MODX_CORE_PATH . \'components/pdotools/model/\', true);
if ($pdoClass = $modx->loadClass($fqn, $path, false, true)) {
    $pdoFetch = new $pdoClass($modx, $scriptProperties);
} else {
    return false;
}
$pdoFetch->addTime(\'pdoTools loaded\');

if (!isset($from) || $from == \'\') {
    $from = 0;
}
if (empty($to)) {
    $to = $modx->resource->id;
}
if (empty($direction)) {
    $direction = \'ltr\';
}
if ($outputSeparator == \'&nbsp;&rarr;&nbsp;\' && $direction == \'rtl\') {
    $outputSeparator = \'&nbsp;&larr;&nbsp;\';
}
if ($limit == \'\') {
    $limit = 10;
}

// For compatibility with BreadCrumb
if (!empty($maxCrumbs)) {
    $limit = $maxCrumbs;
}
if (!empty($containerTpl)) {
    $tplWrapper = $containerTpl;
}
if (!empty($currentCrumbTpl)) {
    $tplCurrent = $currentCrumbTpl;
}
if (!empty($linkCrumbTpl)) {
    $scriptProperties[\'tpl\'] = $linkCrumbTpl;
}
if (!empty($maxCrumbTpl)) {
    $tplMax = $maxCrumbTpl;
}
if (isset($showBreadCrumbsAtHome)) {
    $showAtHome = $showBreadCrumbsAtHome;
}
if (isset($showHomeCrumb)) {
    $showHome = $showHomeCrumb;
}
if (isset($showCurrentCrumb)) {
    $showCurrent = $showCurrentCrumb;
}
// --
$fastMode = !empty($fastMode);
$siteStart = $modx->getOption(\'siteStart\', $scriptProperties, $modx->getOption(\'site_start\'));

if (empty($showAtHome) && $modx->resource->id == $siteStart) {
    return \'\';
}

$class = $modx->getOption(\'class\', $scriptProperties, \'modResource\');
// Start building "Where" expression
$where = array();
if (empty($showUnpublished) && empty($showUnPub)) {
    $where[\'published\'] = 1;
}
if (empty($showHidden)) {
    $where[\'hidemenu\'] = 0;
}
if (empty($showDeleted)) {
    $where[\'deleted\'] = 0;
}
if (!empty($hideContainers) && empty($showContainer)) {
    $where[\'isfolder\'] = 0;
}

$resource = ($to == $modx->resource->id)
    ? $modx->resource
    : $modx->getObject($class, $to);

if (!$resource) {
    $message = \'Could not build breadcrumbs to resource "\' . $to . \'"\';

    return \'\';
}

if (!empty($customParents)) {
    $customParents = is_array($customParents) ? $customParents : array_map(\'trim\', explode(\',\', $customParents));
    $parents = is_array($customParents) ? array_reverse($customParents) : array();
}
if (empty($parents)) {
    $parents = $modx->getParentIds($resource->id, $limit, array(\'context\' => $resource->get(\'context_key\')));
}
if (!empty($showHome)) {
    $parents[] = $siteStart;
}

$ids = array($resource->id);
foreach ($parents as $parent) {
    if (!empty($parent)) {
        $ids[] = $parent;
    }
    if (!empty($from) && $parent == $from) {
        break;
    }
}
$where[\'id:IN\'] = $ids;

if (!empty($exclude)) {
    $where[\'id:NOT IN\'] = array_map(\'trim\', explode(\',\', $exclude));
}

// Fields to select
$resourceColumns = array_keys($modx->getFieldMeta($class));
$select = array($class => implode(\',\', $resourceColumns));

// Add custom parameters
foreach (array(\'where\', \'select\') as $v) {
    if (!empty($scriptProperties[$v])) {
        $tmp = $scriptProperties[$v];
        if (!is_array($tmp)) {
            $tmp = json_decode($tmp, true);
        }
        if (is_array($tmp)) {
            $$v = array_merge($$v, $tmp);
        }
    }
    unset($scriptProperties[$v]);
}
$pdoFetch->addTime(\'Conditions prepared\');

// Default parameters
$default = array(
    \'class\' => $class,
    \'where\' => json_encode($where),
    \'select\' => json_encode($select),
    \'groupby\' => $class . \'.id\',
    \'sortby\' => "find_in_set(`$class`.`id`,\'" . implode(\',\', $ids) . "\')",
    \'sortdir\' => \'\',
    \'return\' => \'data\',
    \'totalVar\' => \'pdocrumbs.total\',
    \'disableConditions\' => true,
);

// Merge all properties and run!
$pdoFetch->addTime(\'Query parameters ready\');
$pdoFetch->setConfig(array_merge($default, $scriptProperties), false);
$rows = $pdoFetch->run();

$output = [];
if (!empty($rows) && is_array($rows)) {
    if (strtolower($direction) == \'ltr\') {
        $rows = array_reverse($rows);
    }

    foreach ($rows as $row) {
        if (!empty($useWeblinkUrl) && $row[\'class_key\'] == \'modWebLink\') {
            $row[\'link\'] = is_numeric(trim($row[\'content\'], \'[]~ \'))
                ? $pdoFetch->makeUrl((int)trim($row[\'content\'], \'[]~ \'), $row)
                : $row[\'content\'];
        } else {
            $row[\'link\'] = $pdoFetch->makeUrl($row[\'id\'], $row);
        }

        $row = array_merge(
            $scriptProperties,
            $row,
            [\'idx\' => $pdoFetch->idx++]
        );
        if (empty($row[\'menutitle\'])) {
            $row[\'menutitle\'] = $row[\'pagetitle\'];
        }

        if (isset($return) && $return === \'data\') {
            $output[] = $row;
            continue;
        }
        if ($row[\'id\'] == $resource->id && empty($showCurrent)) {
            continue;
        } elseif ($row[\'id\'] == $resource->id && !empty($tplCurrent)) {
            $tpl = $tplCurrent;
        } elseif ($row[\'id\'] == $siteStart && !empty($tplHome)) {
            $tpl = $tplHome;
        } else {
            $tpl = $pdoFetch->defineChunk($row);
        }
        $output[] = empty($tpl)
            ? \'<pre>\' . $pdoFetch->getChunk(\'\', $row) . \'</pre>\'
            : $pdoFetch->getChunk($tpl, $row, $fastMode);
    }
}
if (isset($return) && $return === \'data\') {
    return $output;
}

$pdoFetch->addTime(\'Chunks processed\');

if (count($output) == 1 && !empty($hideSingle)) {
    $pdoFetch->addTime(\'The only result was hidden, because the parameter "hideSingle" activated\');
    $output = array();
}

$log = \'\';
if ($modx->user->hasSessionContext(\'mgr\') && !empty($showLog)) {
    $log .= \'<pre class="pdoCrumbsLog">\' . print_r($pdoFetch->getTime(), 1) . \'</pre>\';
}

if (!empty($toSeparatePlaceholders)) {
    $output[\'log\'] = $log;
    $modx->setPlaceholders($output, $toSeparatePlaceholders);
} else {
    $output = implode($outputSeparator, $output);
    if ($pdoFetch->idx >= $limit && !empty($tplMax) && !empty($output)) {
        $output = ($direction == \'ltr\')
            ? $pdoFetch->getChunk($tplMax, array(), $fastMode) . $output
            : $output . $pdoFetch->getChunk($tplMax, array(), $fastMode);
    }
    $output .= $log;

    if (!empty($tplWrapper) && (!empty($wrapIfEmpty) || !empty($output))) {
        $output = $pdoFetch->getChunk($tplWrapper, array(\'output\' => $output, \'crumbs\' => $output), $fastMode);
    }

    if (!empty($toPlaceholder)) {
        $modx->setPlaceholder($toPlaceholder, $output);
    } else {
        return $output;
    }
}',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'AjaxForm' => 
      array (
        'fields' => 
        array (
          'id' => 45,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'AjaxForm',
          'description' => '',
          'editor_type' => 0,
          'category' => 16,
          'cache_type' => 0,
          'snippet' => '/** @var modX $modx */
/** @var AjaxForm $AjaxForm */
/** @var array $scriptProperties */
if (!$modx->loadClass(\'ajaxform\', MODX_CORE_PATH . \'components/ajaxform/model/ajaxform/\', false, true)) {
    return false;
}
$AjaxForm = new AjaxForm($modx, $scriptProperties);

$snippet = $modx->getOption(\'snippet\', $scriptProperties, \'FormIt\', true);
$tpl = $modx->getOption(\'form\', $scriptProperties, \'tpl.AjaxForm.example\', true);
$formSelector = $modx->getOption(\'formSelector\', $scriptProperties, \'ajax_form\', true);
$objectName = $modx->getOption(\'objectName\', $scriptProperties, \'AjaxForm\', true);
$AjaxForm->loadJsCss($objectName);

/** @var pdoTools $pdo */
if (class_exists(\'pdoTools\') && $pdo = $modx->getService(\'pdoTools\')) {
    $content = $pdo->getChunk($tpl, $scriptProperties);
} else {
    $content = $modx->getChunk($tpl, $scriptProperties);
}
if (empty($content)) {
    return $modx->lexicon(\'af_err_chunk_nf\', array(\'name\' => $tpl));
}

// Add selector to tag form
if (preg_match(\'#<form.*?class=(?:"|\\\')(.*?)(?:"|\\\')#i\', $content, $matches)) {
    $classes = explode(\' \', $matches[1]);
    if (!in_array($formSelector, $classes)) {
        $classes[] = $formSelector;
        $classes = preg_replace(
            \'#class=(?:"|\\\')\' . $matches[1] . \'(?:"|\\\')#i\',
            \'class="\' . implode(\' \', $classes) . \'"\',
            $matches[0]
        );
        $content = str_ireplace($matches[0], $classes, $content);
    }
} else {
    $content = str_ireplace(\'<form\', \'<form class="\' . $formSelector . \'"\', $content);
}

// Add method = post
if (preg_match(\'#<form.*?method=(?:"|\\\')(.*?)(?:"|\\\')#i\', $content)) {
    $content = preg_replace(\'#<form(.*?)method=(?:"|\\\')(.*?)(?:"|\\\')#i\', \'<form\\\\1method="post"\', $content);
} else {
    $content = str_ireplace(\'<form\', \'<form method="post"\', $content);
}

// Add action for form processing
$hash = md5(http_build_query($scriptProperties));
$action = \'<input type="hidden" name="af_action" value="\' . $hash . \'" />\';
if ((stripos($content, \'</form>\') !== false)) {
    if (preg_match(\'#<input.*?name=(?:"|\\\')af_action(?:"|\\\').*?>#i\', $content, $matches)) {
        $content = str_ireplace($matches[0], \'\', $content);
    }
    $content = str_ireplace(\'</form>\', "\\n\\t$action\\n</form>", $content);
}

// Save snippet properties
if (!empty(session_id())) {
    // ... to user`s session
    $_SESSION[\'AjaxForm\'][$hash] = $scriptProperties;
} else {
    // ... to cache file
    $modx->cacheManager->set(\'ajaxform/props_\' . $hash, $scriptProperties, 3600);
}

// Call snippet for preparation of form
$action = !empty($_REQUEST[\'af_action\'])
    ? $_REQUEST[\'af_action\']
    : $hash;

$AjaxForm->process($action, $_REQUEST);

// Return chunk
return $content;',
          'locked' => false,
          'properties' => 
          array (
            'form' => 
            array (
              'name' => 'form',
              'desc' => 'ajaxform_prop_form',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'tpl.AjaxForm.example',
              'lexicon' => 'ajaxform:properties',
              'area' => '',
              'desc_trans' => 'Чанк с формой для отправки.',
              'area_trans' => '',
            ),
            'snippet' => 
            array (
              'name' => 'snippet',
              'desc' => 'ajaxform_prop_snippet',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'FormIt',
              'lexicon' => 'ajaxform:properties',
              'area' => '',
              'desc_trans' => 'Сниппет, который будет обрабатывать указанную форму.',
              'area_trans' => '',
            ),
            'frontend_css' => 
            array (
              'name' => 'frontend_css',
              'desc' => 'ajaxform_prop_frontend_css',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '[[+assetsUrl]]css/default.css',
              'lexicon' => 'ajaxform:properties',
              'area' => '',
              'desc_trans' => 'Файл с css стилями для подключения на фронтенде.',
              'area_trans' => '',
            ),
            'frontend_js' => 
            array (
              'name' => 'frontend_js',
              'desc' => 'ajaxform_prop_frontend_js',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '[[+assetsUrl]]js/default.js',
              'lexicon' => 'ajaxform:properties',
              'area' => '',
              'desc_trans' => 'Файл с javascript для подключения на фронтенде.',
              'area_trans' => '',
            ),
            'actionUrl' => 
            array (
              'name' => 'actionUrl',
              'desc' => 'ajaxform_prop_actionUrl',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '[[+assetsUrl]]action.php',
              'lexicon' => 'ajaxform:properties',
              'area' => '',
              'desc_trans' => 'Коннектор для обработки ajax запросов.',
              'area_trans' => '',
            ),
            'formSelector' => 
            array (
              'name' => 'formSelector',
              'desc' => 'ajaxform_prop_formSelector',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'ajax_form',
              'lexicon' => 'ajaxform:properties',
              'area' => '',
              'desc_trans' => 'Имя CSS класса, который будеи использован как jQuery селектор для инициализации формы. По умолчанию "ajax_form".',
              'area_trans' => '',
            ),
            'objectName' => 
            array (
              'name' => 'objectName',
              'desc' => 'ajaxform_prop_objectName',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'AjaxForm',
              'lexicon' => 'ajaxform:properties',
              'area' => '',
              'desc_trans' => 'Имя объекта для инициализации в подключаемом javascript. По умолчанию "AjaxForm".',
              'area_trans' => '',
            ),
            'clearFieldsOnSuccess' => 
            array (
              'name' => 'clearFieldsOnSuccess',
              'desc' => 'ajaxform_prop_clearFieldsOnSuccess',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => true,
              'lexicon' => 'ajaxform:properties',
              'area' => '',
              'desc_trans' => 'Если установлено значение true, то поля формы будут очищатся после успешной отправки формы без редиректа.',
              'area_trans' => '',
            ),
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => 'core/components/ajaxform/elements/snippets/snippet.ajaxform.php',
          'content' => '/** @var modX $modx */
/** @var AjaxForm $AjaxForm */
/** @var array $scriptProperties */
if (!$modx->loadClass(\'ajaxform\', MODX_CORE_PATH . \'components/ajaxform/model/ajaxform/\', false, true)) {
    return false;
}
$AjaxForm = new AjaxForm($modx, $scriptProperties);

$snippet = $modx->getOption(\'snippet\', $scriptProperties, \'FormIt\', true);
$tpl = $modx->getOption(\'form\', $scriptProperties, \'tpl.AjaxForm.example\', true);
$formSelector = $modx->getOption(\'formSelector\', $scriptProperties, \'ajax_form\', true);
$objectName = $modx->getOption(\'objectName\', $scriptProperties, \'AjaxForm\', true);
$AjaxForm->loadJsCss($objectName);

/** @var pdoTools $pdo */
if (class_exists(\'pdoTools\') && $pdo = $modx->getService(\'pdoTools\')) {
    $content = $pdo->getChunk($tpl, $scriptProperties);
} else {
    $content = $modx->getChunk($tpl, $scriptProperties);
}
if (empty($content)) {
    return $modx->lexicon(\'af_err_chunk_nf\', array(\'name\' => $tpl));
}

// Add selector to tag form
if (preg_match(\'#<form.*?class=(?:"|\\\')(.*?)(?:"|\\\')#i\', $content, $matches)) {
    $classes = explode(\' \', $matches[1]);
    if (!in_array($formSelector, $classes)) {
        $classes[] = $formSelector;
        $classes = preg_replace(
            \'#class=(?:"|\\\')\' . $matches[1] . \'(?:"|\\\')#i\',
            \'class="\' . implode(\' \', $classes) . \'"\',
            $matches[0]
        );
        $content = str_ireplace($matches[0], $classes, $content);
    }
} else {
    $content = str_ireplace(\'<form\', \'<form class="\' . $formSelector . \'"\', $content);
}

// Add method = post
if (preg_match(\'#<form.*?method=(?:"|\\\')(.*?)(?:"|\\\')#i\', $content)) {
    $content = preg_replace(\'#<form(.*?)method=(?:"|\\\')(.*?)(?:"|\\\')#i\', \'<form\\\\1method="post"\', $content);
} else {
    $content = str_ireplace(\'<form\', \'<form method="post"\', $content);
}

// Add action for form processing
$hash = md5(http_build_query($scriptProperties));
$action = \'<input type="hidden" name="af_action" value="\' . $hash . \'" />\';
if ((stripos($content, \'</form>\') !== false)) {
    if (preg_match(\'#<input.*?name=(?:"|\\\')af_action(?:"|\\\').*?>#i\', $content, $matches)) {
        $content = str_ireplace($matches[0], \'\', $content);
    }
    $content = str_ireplace(\'</form>\', "\\n\\t$action\\n</form>", $content);
}

// Save snippet properties
if (!empty(session_id())) {
    // ... to user`s session
    $_SESSION[\'AjaxForm\'][$hash] = $scriptProperties;
} else {
    // ... to cache file
    $modx->cacheManager->set(\'ajaxform/props_\' . $hash, $scriptProperties, 3600);
}

// Call snippet for preparation of form
$action = !empty($_REQUEST[\'af_action\'])
    ? $_REQUEST[\'af_action\']
    : $hash;

$AjaxForm->process($action, $_REQUEST);

// Return chunk
return $content;',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'ms2Gallery' => 
      array (
        'fields' => 
        array (
          'id' => 175,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'ms2Gallery',
          'description' => '',
          'editor_type' => 0,
          'category' => 71,
          'cache_type' => 0,
          'snippet' => '/** @var array $scriptProperties */
/** @var ms2Gallery $ms2Gallery */
$ms2Gallery = $modx->getService(\'ms2gallery\', \'ms2Gallery\', MODX_CORE_PATH . \'components/ms2gallery/model/ms2gallery/\');
/** @var pdoFetch $pdoFetch */
if (!$modx->loadClass(\'pdofetch\', MODX_CORE_PATH . \'components/pdotools/model/pdotools/\', false, true)) {
    return false;
}
$pdoFetch = new pdoFetch($modx, $scriptProperties);
$extDir = $modx->getOption(\'extensionsDir\', $scriptProperties, \'components/ms2gallery/img/mgr/extensions/\', true);
$fenom = !empty($scriptProperties[\'tpl\']);

// Register styles and scripts on frontend
$config = $pdoFetch->makePlaceholders($ms2Gallery->config);
$css = $modx->getOption(\'frontend_css\', $scriptProperties, \'frontend_css\');
if (!empty($css) && preg_match(\'#\\.css#i\', $css)) {
    $modx->regClientCSS(str_replace($config[\'pl\'], $config[\'vl\'], $css));
}
$js = $modx->getOption(\'frontend_js\', $scriptProperties, \'frontend_js\');
if (!empty($js) && preg_match(\'#\\.js#i\', $js)) {
    $tmp = json_encode(array(
        \'cssUrl\' => $ms2Gallery->config[\'cssUrl\'] . \'web/\',
        \'jsUrl\' => $ms2Gallery->config[\'jsUrl\'] . \'web/\',
    ));
    $modx->regClientScript(\'<script type="text/javascript">ms2GalleryConfig=\' . $tmp . \';</script>\');
    $modx->regClientScript(str_replace($config[\'pl\'], $config[\'vl\'], $js));
}
if (empty($outputSeparator)) {
    $outputSeparator = "\\n";
}
if (empty($tagsSeparator)) {
    $tagsSeparator = \',\';
}

$where = array(
    \'File.parent\' => 0,
);

// Define where parameters
if ($scriptProperties[\'parents\'] == \'\' && empty($scriptProperties[\'resources\'])) {
    $resources = !empty($resource)
        ? $resource
        : $modx->resource->get(\'id\');
    $scriptProperties[\'resources\'] = $resources;
}

if (!empty($filetype)) {
    $where[\'File.type:IN\'] = array_map(\'trim\', explode(\',\', $filetype));
}

if (empty($showInactive)) {
    $where[\'File.active\'] = 1;
}

$innerJoin = array(
    \'File\' => array(
        \'class\' => \'msResourceFile\',
        \'on\' => \'File.resource_id = modResource.id\',
    ),
);
if (!empty($tagsVar) && isset($_REQUEST[$tagsVar])) {
    $tags = $modx->stripTags($_REQUEST[$tagsVar]);
}
if (!empty($tags)) {
    $tags = array_map(\'trim\', explode(\',\', str_replace(\'"\', \'\', $tags)));
    $tags = implode(\'","\', $tags);
    $innerJoin[\'Tag\'] = array(
        \'class\' => \'msResourceFileTag\',
        \'on\' => \'Tag.file_id = File.id AND Tag.tag IN ("\' . $tags . \'")\',
    );
}

$select = array(
    \'File\' => \'*\',
);

// Set default sort by File table
if (!empty($sortby)) {
    $sortby = array_map(\'trim\', explode(\',\', $sortby));
    foreach ($sortby as &$value) {
        if (strpos($value, \'.\') === false && strpos($value, \'(\') === false) {
            $value = \'File.\' . $value;
        }
    }
    $scriptProperties[\'sortby\'] = implode(\', \', $sortby);
}

// Process additional query params
foreach (array(\'where\', \'innerJoin\', \'select\') as $v) {
    if (!empty($scriptProperties[$v])) {
        $tmp = json_decode($scriptProperties[$v], true);
        if (is_array($tmp)) {
            $$v = array_merge($$v, $tmp);
        }
    }
    unset($scriptProperties[$v]);
}

if (empty($limit) && !empty($offset)) {
    $scriptProperties[\'limit\'] = 10000;
}

// Default parameters
$default = array(
    \'class\' => \'modResource\',
    \'innerJoin\' => $innerJoin,
    \'where\' => json_encode($where),
    \'select\' => $select,
    \'limit\' => 10,
    \'sortby\' => \'rank\',
    \'sortdir\' => \'ASC\',
    \'fastMode\' => false,
    \'groupby\' => \'File.id\',
    \'return\' => \'data\',
    \'nestedChunkPrefix\' => \'ms2gallery_\',
);

// Merge all properties and run!
if (empty($scriptProperties[\'tpl\']) && !empty($tplRow)) {
    $scriptProperties[\'tpl\'] = $tplRow;
}
$pdoFetch->setConfig(array_merge($default, $scriptProperties));
$rows = $pdoFetch->run();

if (!empty($rows)) {
    $tmp = current($rows);
    $resolution = array();
    /** @var modMediaSource $mediaSource */
    if ($mediaSource = $modx->getObject(\'sources.modMediaSource\', $tmp[\'source\'])) {
        $properties = $mediaSource->getProperties();
        if (isset($properties[\'thumbnails\'][\'value\'])) {
            $fileTypes = json_decode($properties[\'thumbnails\'][\'value\'], true);
            foreach ($fileTypes as $k => $v) {
                if (!is_numeric($k)) {
                    $resolution[] = $k;
                } elseif (!empty($v[\'name\'])) {
                    $resolution[] = $v[\'name\'];
                } else {
                    $resolution[] = @$v[\'w\'] . \'x\' . @$v[\'h\'];
                }
            }
        }
    }
}

// Processing rows
$output = null;
$images = array();
foreach ($rows as $k => $row) {
    $row[\'idx\'] = $pdoFetch->idx++;
    $row[\'tags\'] = \'\';

    if (!empty($row[\'type\'])) {
        if ($row[\'type\'] == \'image\') {
            $previews = $pdoFetch->getCollection(\'msResourceFile\', array(\'parent\' => $row[\'id\']));
            foreach ($previews as $preview) {
                if (preg_match("#/{$preview[\'resource_id\']}/(.*?)/#", $preview[\'url\'], $size)) {
                    $row[$size[1]] = !empty($getPreviewProperties)
                        ? $preview
                        : $preview[\'url\'];
                }
            }
        } else {
            $row[\'thumbnail\'] = file_exists(MODX_ASSETS_PATH . $extDir . $row[\'type\'] . \'.png\')
                ? MODX_ASSETS_URL . $extDir . $row[\'type\'] . \'.png\'
                : MODX_ASSETS_URL . $extDir . \'other.png\';
            if (!empty($resolution)) {
                foreach ($resolution as $v) {
                    $row[$v] = $row[\'thumbnail\'];
                }
            }
        }
    }


    if (!empty($getTags)) {
        $q = $modx->newQuery(\'msResourceFileTag\', array(\'file_id\' => $row[\'id\']));
        $q->select(\'tag\');
        $tstart = microtime(true);
        if ($q->prepare() && $q->stmt->execute()) {
            $modx->queryTime += microtime(true) - $tstart;
            $modx->executedQueries++;
            $row[\'tags\'] = implode($tagsSeparator, $q->stmt->fetchAll(PDO::FETCH_COLUMN));
        }
    }

    $images[] = $row;
}
$pdoFetch->addTime(!empty($getTags) ? \'Thumbnails and tags was retrieved\' : \'Thumbnails was retrieved\');

// Processing chunks
$output = array();
if ($fenom) {
    $output[] = $pdoFetch->getChunk($tpl, array(
        \'files\' => $images,
        \'images\' => $images,
    ));
} else {
    foreach ($images as $row) {
        $tpl = $pdoFetch->defineChunk($row);

        $output[] = empty($tpl)
            ? \'<pre>\' . $pdoFetch->getChunk(\'\', $row) . \'</pre>\'
            : $pdoFetch->getChunk($tpl, $row, $pdoFetch->config[\'fastMode\']);
    }
}
$pdoFetch->addTime(\'Rows was templated\');

// Return output
$log = \'\';
if ($modx->user->hasSessionContext(\'mgr\') && !empty($showLog)) {
    $log .= \'<pre class="ms2GalleryLog">\' . print_r($pdoFetch->getTime(), 1) . \'</pre>\';
}

if (!$fenom) {
    if (!empty($toSeparatePlaceholders)) {
        $output[\'log\'] = $log;
        $modx->setPlaceholders($output, $toSeparatePlaceholders);

        return;
    }
    if (count($output) === 1 && !empty($tplSingle)) {
        $output = $pdoFetch->getChunk($tplSingle, array_shift($images));
    } else {
        $output = implode($outputSeparator, $output);

        if (!empty($output)) {
            $arr = array_shift($images);
            $arr[\'rows\'] = $output;
            $arr[\'images\'] = $images;
            if (!empty($tplOuter)) {
                $output = $pdoFetch->getChunk($tplOuter, $arr);
            }
        } else {
            $output = !empty($tplEmpty)
                ? $pdoFetch->getChunk($tplEmpty)
                : \'\';
        }
    }
}

if (is_array($output)) {
    $output = implode($outputSeparator, $output);
}
$output .= $log;
if (!empty($toPlaceholder)) {
    $modx->setPlaceholder($toPlaceholder, $output);
} else {
    return $output;
}',
          'locked' => false,
          'properties' => 
          array (
            'parents' => 
            array (
              'name' => 'parents',
              'desc' => 'ms2gallery_prop_parents',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Список категорий, через запятую, для поиска результатов. По умолчанию выборка ограничена текущим родителем. Если поставить 0 - выборка не ограничивается.',
              'area_trans' => '',
            ),
            'resources' => 
            array (
              'name' => 'resources',
              'desc' => 'ms2gallery_prop_resources',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Список ресурсов, через запятую, для вывода в результатах. Если id товара начинается с минуса, этот товар исключается из выборки.',
              'area_trans' => '',
            ),
            'showLog' => 
            array (
              'name' => 'showLog',
              'desc' => 'ms2gallery_prop_showLog',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Показывать дополнительную информацию о работе сниппета. Только для авторизованных в контекте "mgr".',
              'area_trans' => '',
            ),
            'toPlaceholder' => 
            array (
              'name' => 'toPlaceholder',
              'desc' => 'ms2gallery_prop_toPlaceholder',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Если не пусто, сниппет сохранит все данные в плейсхолдер с этим именем, вместо вывода не экран.',
              'area_trans' => '',
            ),
            'tpl' => 
            array (
              'name' => 'tpl',
              'desc' => 'ms2gallery_prop_tpl',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'tpl.ms2Gallery',
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Чанк Fenom для оформления всей галереи.',
              'area_trans' => '',
            ),
            'limit' => 
            array (
              'name' => 'limit',
              'desc' => 'ms2gallery_prop_limit',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 0,
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Лимит выборки результатов',
              'area_trans' => '',
            ),
            'offset' => 
            array (
              'name' => 'offset',
              'desc' => 'ms2gallery_prop_offset',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 0,
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Пропуск результатов с начала выборки',
              'area_trans' => '',
            ),
            'where' => 
            array (
              'name' => 'where',
              'desc' => 'ms2gallery_prop_where',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Строка, закодированная в JSON, с дополнительными условиями выборки. Для фильтрации по файлам нужно использовать псевдоним таблицы "File". Например &where=`{"File.name:LIKE":"%img%"}`.',
              'area_trans' => '',
            ),
            'filetype' => 
            array (
              'name' => 'filetype',
              'desc' => 'ms2gallery_prop_filetype',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Тип файлов для выборки. Можно использовать "image" для указания картинок и расширения для остальных файлов. Например: "image,pdf,xls,doc".',
              'area_trans' => '',
            ),
            'showInactive' => 
            array (
              'name' => 'showInactive',
              'desc' => 'ms2gallery_prop_showInactive',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Показывать неактивные файлы.',
              'area_trans' => '',
            ),
            'sortby' => 
            array (
              'name' => 'sortby',
              'desc' => 'ms2gallery_prop_sortby',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'rank',
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Сортировка выборки.',
              'area_trans' => '',
            ),
            'sortdir' => 
            array (
              'name' => 'sortdir',
              'desc' => 'ms2gallery_prop_sortdir',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'text' => 'ASC',
                  'value' => 'ASC',
                  'name' => 'ASC',
                ),
                1 => 
                array (
                  'text' => 'DESC',
                  'value' => 'DESC',
                  'name' => 'DESC',
                ),
              ),
              'value' => 'ASC',
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Направление сортировки',
              'area_trans' => '',
            ),
            'frontend_css' => 
            array (
              'name' => 'frontend_css',
              'desc' => 'ms2gallery_prop_frontend_css',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '[[+cssUrl]]web/default.css',
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Если вы хотите использовать собственные стили - укажите путь к ним здесь, или очистите параметр и загрузите их вручную через шаблон сайта.',
              'area_trans' => '',
            ),
            'frontend_js' => 
            array (
              'name' => 'frontend_js',
              'desc' => 'ms2gallery_prop_frontend_js',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '[[+jsUrl]]web/default.js',
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Если вы хотите использовать собственные скрипты - укажите путь к ним здесь, или очистите параметр и загрузите их вручную через шаблон сайта.',
              'area_trans' => '',
            ),
            'tags' => 
            array (
              'name' => 'tags',
              'desc' => 'ms2gallery_prop_tags',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Список тегов, разделённых запятыми, для вывода файлов.',
              'area_trans' => '',
            ),
            'tagsVar' => 
            array (
              'name' => 'tagsVar',
              'desc' => 'ms2gallery_prop_tagsVar',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Если этот параметр не пуст, то сниппет будет принимать из значение "tags" в $_REQUEST[указанноеимя]. Например, если вы укажите здесь "tag", то сниппет будет выводить только файлы, подходящие в $_REQUEST["tag"].',
              'area_trans' => '',
            ),
            'getTags' => 
            array (
              'name' => 'getTags',
              'desc' => 'ms2gallery_prop_getTags',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Сделать дополнительные запросы, чтобы получить строку с тегами файла?',
              'area_trans' => '',
            ),
            'tagsSeparator' => 
            array (
              'name' => 'tagsSeparator',
              'desc' => 'ms2gallery_prop_tagsSeparator',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => ',',
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'Если вы включили получение тегов файлов при выводе, они будут разделены через строку, указанную в этом параметре.',
              'area_trans' => '',
            ),
            'getPreviewProperties' => 
            array (
              'name' => 'getPreviewProperties',
              'desc' => 'ms2gallery_prop_getPreviewProperties',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'ms2gallery:properties',
              'area' => '',
              'desc_trans' => 'При включении этой опции плейсхолдер с превью превращается в массив всех его свойств. То есть, вместо {$file.small} вы должны использовать {$file.small.url} и можете получать доступ к {$file.small.properties}.',
              'area_trans' => '',
            ),
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => 'core/components/ms2gallery/elements/snippets/snippet.ms2gallery.php',
          'content' => '/** @var array $scriptProperties */
/** @var ms2Gallery $ms2Gallery */
$ms2Gallery = $modx->getService(\'ms2gallery\', \'ms2Gallery\', MODX_CORE_PATH . \'components/ms2gallery/model/ms2gallery/\');
/** @var pdoFetch $pdoFetch */
if (!$modx->loadClass(\'pdofetch\', MODX_CORE_PATH . \'components/pdotools/model/pdotools/\', false, true)) {
    return false;
}
$pdoFetch = new pdoFetch($modx, $scriptProperties);
$extDir = $modx->getOption(\'extensionsDir\', $scriptProperties, \'components/ms2gallery/img/mgr/extensions/\', true);
$fenom = !empty($scriptProperties[\'tpl\']);

// Register styles and scripts on frontend
$config = $pdoFetch->makePlaceholders($ms2Gallery->config);
$css = $modx->getOption(\'frontend_css\', $scriptProperties, \'frontend_css\');
if (!empty($css) && preg_match(\'#\\.css#i\', $css)) {
    $modx->regClientCSS(str_replace($config[\'pl\'], $config[\'vl\'], $css));
}
$js = $modx->getOption(\'frontend_js\', $scriptProperties, \'frontend_js\');
if (!empty($js) && preg_match(\'#\\.js#i\', $js)) {
    $tmp = json_encode(array(
        \'cssUrl\' => $ms2Gallery->config[\'cssUrl\'] . \'web/\',
        \'jsUrl\' => $ms2Gallery->config[\'jsUrl\'] . \'web/\',
    ));
    $modx->regClientScript(\'<script type="text/javascript">ms2GalleryConfig=\' . $tmp . \';</script>\');
    $modx->regClientScript(str_replace($config[\'pl\'], $config[\'vl\'], $js));
}
if (empty($outputSeparator)) {
    $outputSeparator = "\\n";
}
if (empty($tagsSeparator)) {
    $tagsSeparator = \',\';
}

$where = array(
    \'File.parent\' => 0,
);

// Define where parameters
if ($scriptProperties[\'parents\'] == \'\' && empty($scriptProperties[\'resources\'])) {
    $resources = !empty($resource)
        ? $resource
        : $modx->resource->get(\'id\');
    $scriptProperties[\'resources\'] = $resources;
}

if (!empty($filetype)) {
    $where[\'File.type:IN\'] = array_map(\'trim\', explode(\',\', $filetype));
}

if (empty($showInactive)) {
    $where[\'File.active\'] = 1;
}

$innerJoin = array(
    \'File\' => array(
        \'class\' => \'msResourceFile\',
        \'on\' => \'File.resource_id = modResource.id\',
    ),
);
if (!empty($tagsVar) && isset($_REQUEST[$tagsVar])) {
    $tags = $modx->stripTags($_REQUEST[$tagsVar]);
}
if (!empty($tags)) {
    $tags = array_map(\'trim\', explode(\',\', str_replace(\'"\', \'\', $tags)));
    $tags = implode(\'","\', $tags);
    $innerJoin[\'Tag\'] = array(
        \'class\' => \'msResourceFileTag\',
        \'on\' => \'Tag.file_id = File.id AND Tag.tag IN ("\' . $tags . \'")\',
    );
}

$select = array(
    \'File\' => \'*\',
);

// Set default sort by File table
if (!empty($sortby)) {
    $sortby = array_map(\'trim\', explode(\',\', $sortby));
    foreach ($sortby as &$value) {
        if (strpos($value, \'.\') === false && strpos($value, \'(\') === false) {
            $value = \'File.\' . $value;
        }
    }
    $scriptProperties[\'sortby\'] = implode(\', \', $sortby);
}

// Process additional query params
foreach (array(\'where\', \'innerJoin\', \'select\') as $v) {
    if (!empty($scriptProperties[$v])) {
        $tmp = json_decode($scriptProperties[$v], true);
        if (is_array($tmp)) {
            $$v = array_merge($$v, $tmp);
        }
    }
    unset($scriptProperties[$v]);
}

if (empty($limit) && !empty($offset)) {
    $scriptProperties[\'limit\'] = 10000;
}

// Default parameters
$default = array(
    \'class\' => \'modResource\',
    \'innerJoin\' => $innerJoin,
    \'where\' => json_encode($where),
    \'select\' => $select,
    \'limit\' => 10,
    \'sortby\' => \'rank\',
    \'sortdir\' => \'ASC\',
    \'fastMode\' => false,
    \'groupby\' => \'File.id\',
    \'return\' => \'data\',
    \'nestedChunkPrefix\' => \'ms2gallery_\',
);

// Merge all properties and run!
if (empty($scriptProperties[\'tpl\']) && !empty($tplRow)) {
    $scriptProperties[\'tpl\'] = $tplRow;
}
$pdoFetch->setConfig(array_merge($default, $scriptProperties));
$rows = $pdoFetch->run();

if (!empty($rows)) {
    $tmp = current($rows);
    $resolution = array();
    /** @var modMediaSource $mediaSource */
    if ($mediaSource = $modx->getObject(\'sources.modMediaSource\', $tmp[\'source\'])) {
        $properties = $mediaSource->getProperties();
        if (isset($properties[\'thumbnails\'][\'value\'])) {
            $fileTypes = json_decode($properties[\'thumbnails\'][\'value\'], true);
            foreach ($fileTypes as $k => $v) {
                if (!is_numeric($k)) {
                    $resolution[] = $k;
                } elseif (!empty($v[\'name\'])) {
                    $resolution[] = $v[\'name\'];
                } else {
                    $resolution[] = @$v[\'w\'] . \'x\' . @$v[\'h\'];
                }
            }
        }
    }
}

// Processing rows
$output = null;
$images = array();
foreach ($rows as $k => $row) {
    $row[\'idx\'] = $pdoFetch->idx++;
    $row[\'tags\'] = \'\';

    if (!empty($row[\'type\'])) {
        if ($row[\'type\'] == \'image\') {
            $previews = $pdoFetch->getCollection(\'msResourceFile\', array(\'parent\' => $row[\'id\']));
            foreach ($previews as $preview) {
                if (preg_match("#/{$preview[\'resource_id\']}/(.*?)/#", $preview[\'url\'], $size)) {
                    $row[$size[1]] = !empty($getPreviewProperties)
                        ? $preview
                        : $preview[\'url\'];
                }
            }
        } else {
            $row[\'thumbnail\'] = file_exists(MODX_ASSETS_PATH . $extDir . $row[\'type\'] . \'.png\')
                ? MODX_ASSETS_URL . $extDir . $row[\'type\'] . \'.png\'
                : MODX_ASSETS_URL . $extDir . \'other.png\';
            if (!empty($resolution)) {
                foreach ($resolution as $v) {
                    $row[$v] = $row[\'thumbnail\'];
                }
            }
        }
    }


    if (!empty($getTags)) {
        $q = $modx->newQuery(\'msResourceFileTag\', array(\'file_id\' => $row[\'id\']));
        $q->select(\'tag\');
        $tstart = microtime(true);
        if ($q->prepare() && $q->stmt->execute()) {
            $modx->queryTime += microtime(true) - $tstart;
            $modx->executedQueries++;
            $row[\'tags\'] = implode($tagsSeparator, $q->stmt->fetchAll(PDO::FETCH_COLUMN));
        }
    }

    $images[] = $row;
}
$pdoFetch->addTime(!empty($getTags) ? \'Thumbnails and tags was retrieved\' : \'Thumbnails was retrieved\');

// Processing chunks
$output = array();
if ($fenom) {
    $output[] = $pdoFetch->getChunk($tpl, array(
        \'files\' => $images,
        \'images\' => $images,
    ));
} else {
    foreach ($images as $row) {
        $tpl = $pdoFetch->defineChunk($row);

        $output[] = empty($tpl)
            ? \'<pre>\' . $pdoFetch->getChunk(\'\', $row) . \'</pre>\'
            : $pdoFetch->getChunk($tpl, $row, $pdoFetch->config[\'fastMode\']);
    }
}
$pdoFetch->addTime(\'Rows was templated\');

// Return output
$log = \'\';
if ($modx->user->hasSessionContext(\'mgr\') && !empty($showLog)) {
    $log .= \'<pre class="ms2GalleryLog">\' . print_r($pdoFetch->getTime(), 1) . \'</pre>\';
}

if (!$fenom) {
    if (!empty($toSeparatePlaceholders)) {
        $output[\'log\'] = $log;
        $modx->setPlaceholders($output, $toSeparatePlaceholders);

        return;
    }
    if (count($output) === 1 && !empty($tplSingle)) {
        $output = $pdoFetch->getChunk($tplSingle, array_shift($images));
    } else {
        $output = implode($outputSeparator, $output);

        if (!empty($output)) {
            $arr = array_shift($images);
            $arr[\'rows\'] = $output;
            $arr[\'images\'] = $images;
            if (!empty($tplOuter)) {
                $output = $pdoFetch->getChunk($tplOuter, $arr);
            }
        } else {
            $output = !empty($tplEmpty)
                ? $pdoFetch->getChunk($tplEmpty)
                : \'\';
        }
    }
}

if (is_array($output)) {
    $output = implode($outputSeparator, $output);
}
$output .= $log;
if (!empty($toPlaceholder)) {
    $modx->setPlaceholder($toPlaceholder, $output);
} else {
    return $output;
}',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
    ),
    'modTemplateVar' => 
    array (
    ),
  ),
);